[{"id":128025,"title":"Board supports immigrant students, promotes district as sanctuary","permalink":"http:\/\/palyvoice.com\/2017\/01\/15\/board-supports-immigrant-students-promotes-district-as-sanctuary\/","content":"The Palo Alto school board is pursuing a new policy approved with a unanimous vote. During a school board meeting on Tuesday, the board approved a <a href=\"https:\/\/drive.google.com\/file\/d\/0B_Ha6_cxoBV_NThkemhiV19WR0k\/view\">resolution<\/a> that affirms PAUSD's support of immigrant students and families, and states PAUSD should be a sanctuary for students.\r\n\r\n<span style=\"font-weight: 400;\">The new resolution is in line with the ideas of a bill by California Democratic Sen. Kevin de León. According to Patrick McGreevy of the Los Angeles Times, the<\/span><span style=\"font-weight: 400;\"> <a href=\"http:\/\/www.latimes.com\/politics\/essential\/la-pol-ca-essential-politics-updates-senate-leader-proposes-safe-zones-at-1481144070-htmlstory.html\">new bill by de León<\/a> <\/span><span style=\"font-weight: 400;\">will outline the implementation of \"safe zones\" for immigrants in locations like public schools, medical facilities and places of worship, which will prohibit immigration enforcement on such locations. <\/span>\r\n\r\nUnder this proposed bill, immigrant students would be offered a sort of political protection, according to McGreevy. For de León, this is a result of concerns raised following statements made about mass-deportation during the 2016 election cycle.\r\n\r\n<span style=\"font-weight: 400;\">“To the millions of undocumented residents pursuing and contributing to the California dream, the state of California will be your wall of justice should the incoming administration adopt an inhumane and over-reaching mass-deportation policy,” de León said in reference to the <a href=\"http:\/\/leginfo.legislature.ca.gov\/faces\/billNavClient.xhtml?bill_id=201720180SB54\">California Values Act<\/a>.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">PAUSD’s own resolution outlines the board’s policy on providing high-quality public education to both children of legal citizens and to those of undocumented residents. It was developed and revised by the board members themselves.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">This document ensures the safety of all students in PAUSD, according to Supt. Max McGee, who says he “is proud of the education PAUSD serves to every student.” In a <a href=\"https:\/\/www.pausd.org\/explore-pausd\/news\/superintendents-message-boe-resolution-support-immigrant-students\">statement<\/a> released on Thursday, McGee emphasized that PAUSD does not tolerate discrimination based on race, gender, sexual orientation, religion or national origin. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“A<\/span><span style=\"font-weight: 400;\">s educators, we know that students cannot learn when they do not feel welcomed and safe at school,” McGee said in the statement. “For that reason, we work very hard to create and maintain safe learning environments where teachers, students and other staff members can safely learn and work together.\"<\/span>\r\n\r\nSchools are among a relatively short list of locations deemed as “sensitive areas” by the United States Department of Immigration and Custom Enforcement. Sensitive areas are locations in which government enforcement action is taken with an air of caution in order to maintain an environment of safety and tranquility, particularly in places of worship, education, ceremonial practices and medical facilities. The Immigration and Custom Enforcement policy also discourages enforcement actions at schools, except in cases of imminent danger.\r\n\r\nThe resolution states that PAUSD officials will not cooperate with immigration enforcement actions unless specifically required to do so by law, but will not interfere with necessary action carried out by law enforcement. For instance, district staff must respond to questions about students from immigration officers, but will refer them first to the Supt. or his designee, “unless there is an immediate threat to public safety.” Additionally, the resolution states that “PAUSD will not disclose personally identifiable information in a student's ‘educational records’ to outside agencies without written parental consent, judicial order, or lawfully-issued subpoena.”\r\n\r\n<span style=\"font-weight: 400;\">With the passing of this resolution, the Board of Education and Paly administration will be working together to ensure that PAUSD is a “sanctuar[y] for students to the fullest extent allowed by law,” McGee said.<\/span>","excerpt":"During a school board meeting on Tuesday, the board approved a resolution that affirms PAUSD's support of immigrant students and families, and states PAUSD should be a sanctuary for students.","date":"2017-01-15 18:14:01","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/schoolboard051016.jpg","categories":["News","Spotlight"],"tags":["Board of Education","california valuea act","immigrants","Kevin de Leon","McGee","PAUSD","resolution","senate leader","Trump"]},{"id":127942,"title":"Slideshow: Paly girls dominate Mountain View","permalink":"http:\/\/palyvoice.com\/2017\/01\/14\/slideshow-paly-girls-dominate-mountain-view\/","content":"The Palo Alto High School girls' basketball team (9-3, 3-0) continued their undefeated season in league play, defeating the Mountain View Spartans 61-47.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/143ywtI4gQtX54hGMda6xvVbcNKNSIRIVwgrcAcNDaAA\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"650\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School girls' basketball team (9-3, 3-0) continued their undefeated season in league play, defeating the Mountain View Spartans 61-47.\r\n\r\n","date":"2017-01-14 10:53:16","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_85731.jpg","categories":["Slideshow","Sports"],"tags":["2016","basketball","carly leong","CCS","girls","gunn","juniors","new","palo alto","palo alto high school","paly","review","School","seniors","skylar burris","slideshow","sports","student","vikings"]},{"id":127849,"title":"Girls&#8217; soccer hopes to stay undefeated against Homestead","permalink":"http:\/\/palyvoice.com\/2017\/01\/12\/girls-soccer-hopes-to-stay-undefeated-against-homestead\/","content":"[caption id=\"attachment_127359\" align=\"alignnone\" width=\"596\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7891.jpg\"><img class=\" wp-image-127359\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7891.jpg\" alt=\"Senior midfielder Talia Malchin passes the ball upfield against Gunn in December. Photo by Rachel Code.\" width=\"596\" height=\"438\" \/><\/a> Senior midfielder Talia Malchin passes the ball upfield against Gunn in December. Photo by Rachel Code.[\/caption]\r\n\r\nThe Palo Alto High School Girls’ soccer team (7-0-1, 1-0) looks to continue its dominant start by defeating Homestead High School (4-3, 4-2) at 3:30 p.m. on Thursday at Paly.\r\n\r\n<span style=\"font-weight: 400;\">With the Vikes undefeated this season thus far, the team is focusing on the details, according to junior midfield Emily Tomz. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have been focusing on dynamic runs forward and making all opportunities count,” Tomz said. “We have to be confident and beat them with our speed and technical skill.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior forward Tess Preising stressed the need to stay steady in the team's style of play.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“This season so far we are undefeated, and we have managed to stay pretty consistent in our play,” Preising said, “We need to continue to stay hungry to score and not give up easily even when we are ahead.”<\/span>\r\n\r\nThe Vikings are playing well, but there is still much to work on, according to Preising.\r\n\r\n<span style=\"font-weight: 400;\">“Although we have been getting better and building chemistry, we need to play more as a team and work together as a unit rather than just individuals,” Preising said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the team looks to prepare for CCS, Tomz believes the team should simply enjoy the game.<\/span>\r\n\r\n“When we are out there staying focused but also having fun, we play our best soccer,” Tomz said.","excerpt":"The Palo Alto High School Girls’ soccer team (7-0, 1-0) looks to continue its dominant start by defeating Homestead High School (4-3, 4-2) at 3:30 p.m. on Thursday at Paly.","date":"2017-01-12 11:41:51","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7891.jpg","categories":["Sports"],"tags":["emily tomz","girls","homestead","paly","preview","Soccer","sports","Tess Preising","vikings"]},{"id":127957,"title":"Fallen tree disrupts morning traffic","permalink":"http:\/\/palyvoice.com\/2017\/01\/12\/fallen-tree-disrupts-morning-traffic\/","content":"[caption id=\"attachment_127964\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0010.jpg\"><img class=\"size-full wp-image-127964\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0010.jpg\" alt=\"A California Live Oak tree lays on the ground in front of the Palo Alto High School bell tower on Thursday morning. The tree blocked off part of the El Camino parking lot, causing increased traffic. Photo: Rachel Code.\" width=\"600\" height=\"400\" \/><\/a> A California Live Oak tree lays on the ground in front of the Palo Alto High School bell tower on Thursday morning. The tree blocked off part of the El Camino parking lot, causing increased traffic, according to campus supervisor Carl Hubenthal. Photo: Rachel Code.[\/caption]\r\n\r\nThe Palo Alto High School administration is waiting on landscape clearing personnel to remove a large California Live Oak tree that fell into the El Camino parking lot next to the tower building this morning.\r\n\r\nThe tree fell between 6 a.m. and 7 a.m., according to landscape worker José Guzman. This disturbance also affected parking traffic, according to campus supervisor Carl Hubenthal.\r\n\r\n\"Traffic was a lot slower than normal,\" Hubenthal said. \"We still got pretty much everybody cleared by about 8:20 [a.m.], but usually we clear people by 8:15 [a.m.]. We had to stay out here [in the parking lot] and the cones are still up so that people still take it slow. We had to block off one of the turns because the tree is totally in the way.\"\r\n\r\nHubenthal says that administration is waiting on landscape clearing company workers to come cut up and clear the tree, but that district-wide demand due to recent stormy weather is slowing the process.\r\n\r\n\"It should be [cleared] a couple of hours from now,\" Hubenthal said. \"The district is having a lot of trees that are down, so they are having to do this [clear trees] on all of the campuses. Hopefully it will be in the next hour [8:30 to 9:30 a.m.], but it might not be until lunch.\"\r\n\r\nAccording to Hubenthal, the tree's fall can attributed to the effects of the California drought and recent weather.\r\n\r\n\"After a long period of drought where the roots [of a large tree] are very dry, air pockets form in the roots of the tree and the roots shrink,\" Hubenthal said. \"Then, when you get a heavy downpour or a long, steady rain after that, just the weight of the tree will pop it right out of the ground.\"\r\n\r\nCampus workers will be checking other similar trees at Paly to confirm that students and staff are safe on campus, according to Hubenthal.","excerpt":"The Palo Alto High School administration is waiting on landscape clearing personnel to clear a large California Live Oak tree that fell into the El Camino parking lot this morning.","date":"2017-01-12 09:56:13","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DJI_0011-1.jpg","categories":["News","Spotlight"],"tags":["admin","administration","california live oak","el camino","Fall","fallen tree","guzman","hubenthal","landscape","palo alto high school","parking","traffic","tree"]},{"id":127878,"title":"Teen Arts Council movie night to feature &#8216;The Princess Bride&#8217; Friday","permalink":"http:\/\/palyvoice.com\/2017\/01\/12\/teen-arts-council-movie-night-to-feature-the-princess-bride-friday\/","content":"<p style=\"text-align: left;\">The Teen Arts Council will host a movie night as its first event of the year at 7 p.m. on Friday at the Mitchell Park Teen Center.<\/p>\r\n\r\n\r\n[caption id=\"attachment_127880\" align=\"alignleft\" width=\"247\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/15978742_697806837053851_1936034819_n1.jpg\"><img class=\"wp-image-127880\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/15978742_697806837053851_1936034819_n1.jpg\" alt=\"15978742_697806837053851_1936034819_n\" width=\"247\" height=\"357\" \/><\/a> The official poster for the event, designed by Paly senior Claire Eberhart.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The featured film for this year’s annual movie event will be \"The Princess Bride<\/span><span style=\"font-weight: 400;\">.\"<\/span><i><span style=\"font-weight: 400;\"> <\/span><\/i><span style=\"font-weight: 400;\">Admission is free, but concessions will be sold at the event as a fundraiser for the TAC.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">While there is no official theme this year, the infamous date of Friday the 13th will play a role in the evening’s decor. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Movie night does fall on Friday the 13th,” movie night event co-organizer and Palo Alto High School junior Alexandra Dinu said. “The place will be set up to sort of reflect the eerie and suspenseful mood that is so well known with that date.”<\/span>\r\n\r\n\"The Princess Bride,\" told from the perspective of a grandfather reading a fairytale to his grandson, details the story of Buttercup, a former farm girl who has been chosen by Prince Humperdinck to be his bride. However, Buttercup is still in love with a man named Wesley, who was lost at sea. Pirates, thieves, giants, royalty and a kidnapping all come together in this classic romantic comedy.\r\n\r\n<span style=\"font-weight: 400;\">According to junior Publicity Coordinator Nandini Relan, the TAC is comprised of a group of teenagers from the Palo Alto area who have a passion for art and wish to share that enthusiasm with the student population. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We plan all sorts of events throughout the year, [such as] recurring open mics and poetry slams,” Relan said. “All of these events are run almost entirely by high school students.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition to its focus on the arts, the TAC wishes to provide a place for students to decompress through events such as this upcoming movie night. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We provide a safe space for teens to come and de-stress,” Relan said. “It's a super happy environment to be in.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The event was originally planned for finals week, but was moved to this weekend to improve student attendance. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We decided this year that it may be easier to just do it [this Friday] when everyone can just relax more fully and seniors are mostly done with applications,” Dinu said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The TAC encourages students of all backgrounds and interests to come.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“A lot of the time, people think it's just us in Teen Arts Council or just our close group of friends,” Dinu said. “But a huge reason why we have this event [movie night] is to bring people from different backgrounds together to meet and just relax together and have a fun evening.”<\/span>\r\n\r\nFor those who can't make it to this Friday's event, the TAC will also be hosting a poetry slam on Jan. 27, and an open mic night on Feb. 10, according to Relan.","excerpt":"The Teen Arts Council will host a movie night as its first event of the year at 7 p.m. on Friday, at the Mitchell Park Center.","date":"2017-01-12 09:27:27","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0783.jpg","categories":["Uncategorized"],"tags":["friday","friday the 13th","movie night","tac","the princess bride"]},{"id":127917,"title":"Game recap: Boys&#8217; soccer vs. Mountain View ends in shutout","permalink":"http:\/\/palyvoice.com\/2017\/01\/11\/game-recap-boys-soccer-vs-mountain-view-ends-in-shutout\/","content":"As the rain pounded on players and winds blew away spectators' umbrellas, the Palo Alto High School boys’ soccer team (0-1-1, 7-0-1) battled Mountain View High School (1-0-2, 4-3-1) to a, close 0-0, draw on Tuesday at Paly.\r\n\r\nThe Vikings started off the game with a strong offensive push, making an attempt to score half-way through the first half. Senior midfielder Marcel Colchen gained possession of the ball and quickly passed it to fellow senior midfielder Yahli Malchin, who proceeded to barely miss a strong shot over the left corner of the goal.\r\n\r\n“We are still working on our offensive capabilities,” senior Nicholas Camarena said. “We have a few players who are good offensively who are injured right now and when they get back, we should be looking at scoring some more goals.”\r\n\r\nAfter losing their first league game against Los Altos High School last week, 4-2, the Vikings stepped up their defensive game, never letting the ball stay on their side too long.\r\n\r\nSenior goalkeeper Michel Ange Siaba played a key role for the Vikings' defensive squad, shutting out the Mountain View offensive with a couple impressive saves, including a first half corner kick that hit the side post before ricocheting into Siaba's arms. He also made a close save in the final minutes in the game, stopping the Spartans' last attempt to win the game.\r\n\r\nDespite a rocky start to the season, Camarena is still optimistic about the team’s chances at winning Central Coast Sections playoffs.\r\n\r\n“I think we will start improving once a lot of players start coming back from injuries,” Camarena said. “We are still hoping to get a positive record for our wins and losses. Our goal since the beginning of the year has been to win CCS and we are hoping to do that this year.”\r\n\r\nThe Vikings head to Homestead High School for their next match at 3:30 p.m. on Thursday.\r\n\r\n&nbsp;\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1Sdk8RPhKdovxvS8sDIWKTU5d7UyYDC0950LAdjPdIBs\/embed?start=false&amp;loop=true&amp;delayms=10000\" width=\"600\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"As the rain mercilessly pounded on the players and winds blew away umbrellas, the Palo Alto High School boys’ soccer team (0-1-1, 7-0-1) battled Mountain View High School (1-0-2, 4-3-1) in a close, 0-0, draw on Tuesday at Paly.","date":"2017-01-11 22:42:07","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8429.jpg","categories":["Sports","Uncategorized"],"tags":["derek schoenberger","isaiah schoenberger","marcel colchen","matt knowles","michel","michel-ange siaba","nicholas camarena","palo alto boys soccer","Soccer","varsity soccer","yahli malchin"]},{"id":127841,"title":"Boys&#8217; basketball soars past Eagles","permalink":"http:\/\/palyvoice.com\/2017\/01\/11\/boys-basketball-soars-past-eagles\/","content":"[caption id=\"attachment_127882\" align=\"alignright\" width=\"408\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_4927-1.jpg\"><img class=\" wp-image-127882\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_4927-1.jpg\" alt=\"Junior forward Max Dorward fends off a player from Los Altos as he runs down the court.\" width=\"408\" height=\"364\" \/><\/a> Junior forward Max Dorward fends off a player from Los Altos as he runs down the court. Photo by: Benner Mullin[\/caption]\r\n\r\nThe Palo Alto High School boys' basketball team (11-2, 3-0) continued its winning streak last night, breezing by its De Anza League foe, the Los Altos Eagles, (7-6, 0-2), 63-50 Tuesday night at Gunn High School.\r\n\r\nDespite the win, Paly struggled throughout the game with ball security, committing 11 turnovers. Especially sloppy play from the Vikings during the end of the 3rd quarter and beginning of the 4th quarter allowed the Eagles to cut its deficit from 23 points to 11 points with five minutes to play.\r\n\r\nThe Vikings' tenacious full-court pressure in the final minutes of the game shattered any comeback hopes for the Eagles.\r\n\r\nLuckily, the opportunities Paly lost from careless turnovers were recovered by relentless pressure on their opponent, gifting them countless uncontested layups.\r\n\r\nThe Vikings and Eagles traded baskets early, and Los Altos led 20-19 after the 1st quarter. In the second quarter, Paly completely shut down the Los Altos offense, which scored a meager four points, while the Vikings took an 11-point lead into the half, 35-24, and preserved the advantage to the final buzzer.\r\n\r\nJunior forward Max Dorward thought the team played with great energy.\r\n\r\n\"We came out stronger than we normally do on Tuesday nights,\" Dorward said. \"We usually come out slower on Tuesday and so we came into this game thinking 'We need to come out strong,' and that's what we did.\"\r\n\r\nDorward led the Vikings with 24 points, eight rebounds, five assists and three steals, and junior forward Will Schlemmer added nine points, four assists, four steals and three rebounds.\r\n\r\nAccording to head Coach Peter Diepenbrock, the team runs a significantly faster offense this year.\r\n\r\n\"We are playing with a style that fits our talent and skill level, much more than it did last year,\" Diepenbrock said. \"We definitely have a team that is much better at running, pressing and looking for open court possibilities.\"\r\n\r\nThe Vikings are preparing for their next De Anza League matchup at Wilcox High School (7-6, 2-0) this Friday at 7:45 p.m.","excerpt":"The Palo Alto High School boys' basketball team (11-2, 3-0) continued its winning streak last night, breezing by its De Anza League foe the Los Altos Eagles (7-6, 0-2), 63-50 Tuesday night at Gunn High School.","date":"2017-01-11 17:39:40","author":"Benner Mullin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_4927.jpg","categories":["Basketball","Sports","Spotlight","Uncategorized"],"tags":["basketball","de anza league","los altos","max dorward","palo alto basketball","palo alto boys basketball","paly","paly basketball","Peter Diepenbrock","will schlemmer"]},{"id":127823,"title":"Teachers propose 16 new courses for following year","permalink":"http:\/\/palyvoice.com\/2017\/01\/11\/teachers-propose-16-new-courses-for-following-year\/","content":"<span style=\"font-weight: 400;\">Teachers are hoping to have their courses approved for next school year after 16 new course proposals were presented to the Palo Alto Unified School District Board of Education Tuesday night in the district office. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Chief Academic Officer Sharon Ofek spoke on behalf of the teachers present to provide quick summations of each course. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We thank the staff from both high schools to step out of their comfort zones and to create new courses,” Ofek said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Most of the focus of new classes was directed towards potential yoga and calculus classes.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">I’ve heard from many students that the fact there is no course between IAC and AB Calculus, which is frustrating since that AB is the least challenging class they can take and yet they are still struggling,” Paly Associated Student Body School Board Representative David Tayeri said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The current Yoga class offered at Paly, available to 10th graders only, has seen a rise in popularity due to the push to increase social and emotional wellness at Paly. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“To support the social emotional needs of the students that students are getting in their normal physical education, ” Paly Physical Education teacher Sheri Mulroe said. According to Mulroe, yoga will also qualify as a PE credit. [10th graders only]<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Despite all 16 courses being on track for approval at the next board meeting, it’s not guaranteed that all will run. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Often times we get questions about courses and when do they run, when there are enough students, then they make the decision to run that course or not.” Ofek said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">With 16 new classes potentially set to be offered, School Board Representative Jennifer DiBrienza is looking forward to seeing the courses provided in the next school year. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">I’m glad to see a lot of the hands-on thinking doing type classes and I’m excited to see what kids sign up for in the fall,” DiBrienza said.<\/span>\r\n\r\nHere is a complete list of the potentially offered courses and their course description for the next school year:\r\n\r\nClasses to be added at Paly and Gunn:\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR8U6CCF77\/$file\/AP%20Capstone%20Research%20Final%20120116A.pdf\" target=\"_blank\">AAR AP Capstone Research<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR8Y6CD00C\/$file\/APSeminarCourseBoardApproval.pdf\" target=\"_blank\">AAR AP Seminar<\/a>\r\n\r\nClasses to be added at Paly:\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR926CD03F\/$file\/Calculus.pdf\" target=\"_blank\">Calculus<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR966CD262\/$file\/Client%20Based%20Production.pdf\" target=\"_blank\">Client Based Production<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR986CD2B1\/$file\/Intro%20to%20Broadcasting.pdf\" target=\"_blank\">Intro to Broadcasting<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR9C6CD4BE\/$file\/Photojournalism%20-%20Paly.pdf\" target=\"_blank\">Photojournalism<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR9E6CD51E\/$file\/Radio%20Broadcasting%20I.pdf\" target=\"_blank\">Radio Broadcasting I<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR9G6CD589\/$file\/Radio%20Broadcasting%20II.pdf\" target=\"_blank\">Radio Broadcasting II<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR9N6CD605\/$file\/Web%20Development.pdf\" target=\"_blank\">Web Development<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR9S6CD65D\/$file\/Yoga%20Class.pdf\" target=\"_blank\">Yoga<\/a>\r\n\r\nClasses to be added at Gunn:\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR8W6CCFC5\/$file\/AP%20Computer%20Science%20Principles.pdf\" target=\"_blank\">AP Computer Science Principles<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHCPNE626ED4\/$file\/20170110CourseProposalChineseCivilizationandCulture.pdf\" target=\"_blank\">Chinese Civilization and Culture<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHCPNJ628D2E\/$file\/20170110CourseProposalMultimediaJournalism.pdf\" target=\"_blank\">Multimedia Journalism<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR9J6CD5B5\/$file\/The%20Art%20of%20Visual%20Storytelling.pdf\" target=\"_blank\">The Art of Visual Storytelling<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR9L6CD5D9\/$file\/Topics%20in%20Applied%20Math.pdf\" target=\"_blank\">Topics in Applied Mathematics<\/a>\r\n\r\n<a href=\"http:\/\/www.boarddocs.com\/ca\/pausd\/Board.nsf\/files\/AHBR9Q6CD642\/$file\/Yoga%20%26%20Mindfulness%20-%20Gunn.pdf\" target=\"_blank\">Yoga and Mindfulness<\/a>","excerpt":"Teachers are hoping to have their courses approved after 16 new course proposals were presented to the Palo Alto Unified School District Board of Education Tuesday night in the district office.\r\n\r\n","date":"2017-01-11 17:35:45","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/15992127_789217457892818_695388838_o1.jpg","categories":["News","Spotlight"],"tags":["2016","2017","2018","courses","diorio","gunn","new","new courses","palo alto","palo alto high school","paly","PAUSD","School","School Board","student","vikings"]},{"id":126388,"title":"Tuesday Tunes: Jackson Kienitz","permalink":"http:\/\/palyvoice.com\/2017\/01\/10\/tuesday-tunes-jackson-kienitz\/","content":"[caption id=\"attachment_126484\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15133829_1081432702002865_527032860_o.jpg\"><img class=\"wp-image-126484\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15133829_1081432702002865_527032860_o.jpg\" alt=\"15133829_1081432702002865_527032860_o\" width=\"600\" height=\"400\" \/><\/a> Jackson Kienitz poses outside the Performing Arts Center for his Senior Portrait. While he may play classical for theater's production of The Importance of Being Earnest, or come up with zany beats as his character, jNitz, Kienitz is found listening to different music than he plays in public.[\/caption]\r\n\r\nThis week, The Paly Voice sat down with senior rapper Jackson Kienitz to discuss his musical inspirations.\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School senior Jackson Kienitz, is a part-time student, part-time rapper, known around campus for his satirical persona as the vain and self-important artist jNitz. For this installment of Tuesday Tunes, the Paly Voice will not be talking to this humorous caricature, but to the real Kienitz, to find out what music he plays when he isn’t performing on a stage.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Kienitz, music was something he and his dad always shared, exchanging discoveries between each other as they blasted songs throughout the house. Kienitz's dad got the ball rolling by introducing him to some of his first artists. Little did he know that the enthusiasm he instilled in him would manifest itself into Kienitz's own artist, years later. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“When I was a youngster, we'd listen to his various albums everyday on the way to school, whether it be John Mayer, Lenny Kravitz, Kanye West, KT Tunstal or something else,” Kienitz said. “As I've grown older and started to discover artists and songs on my own, the roles have almost reversed.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Kienitz explained how his taste evolved over the years, as what he would listen to on his own permuted periodically, expanding his range of exposure.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“In elementary school, I wasn't actively searching for music, but my iPod consisted of Jackson 5, Queen, Weird Al Yankovic, a random song from The Simpson's and so on,” Kienitz said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Kienitz didn’t  purposefully start exploring new musicians until middle school, when his tastes diverged into newer genres, but mainly consisted of alternative artists like The Black Keys, White Stripes and Gary Clark Jr. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Currently I'm listening to a lot of R&amp;B, Funk, and Hip-Hop but also Folk and of course,  Post-Neo-Modernist-Contemporary,” Kienitz said, the last being a playful jab at the pretentious style expressed by his alternative alias.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Kienitz shared that his favorite artists include Kendrick Lamar, Frank Ocean, Vulfpeck, Jake Bugg and James Blake.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">To show a sample size of what you can find Kienitz listening to, The Paly Voice has consolidated a Top 15 list since there are too many favorites to scale down to ten.<\/span>\r\n\r\n<iframe src=\"https:\/\/embed.spotify.com\/?uri=spotify%3Auser%3Ajwylder%3Aplaylist%3A3W3cYVv9BwogKmRJWRHhNl\" width=\"300\" height=\"380\" frameborder=\"0\"><\/iframe>\r\n\r\n&nbsp;","excerpt":"This week, The Paly Voice sat down with senior rapper Jackson Kienitz to discuss his musical inspirations.","date":"2017-01-10 19:58:00","author":"Donnesh Farmanfarmaian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/11\/15133829_1081432702002865_527032860_o.jpg","categories":["A&amp;E Section Spotlight","Tuesday Tunes"],"tags":["entertainment","jackson kienitz","jNitz","music","Tuesday Tunes"]},{"id":127784,"title":"Paly debater wins out-of-state tournament","permalink":"http:\/\/palyvoice.com\/2017\/01\/10\/paly-debater-wins-out-of-state-tournament\/","content":"[caption id=\"attachment_127816\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0076.jpg\"><img class=\"size-full wp-image-127816\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0076.jpg\" alt=\"Palo Alto High School junior debater Frances Zhuang poses in front of the Media Arts Center on Tuesday. Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Palo Alto High School junior debater Frances Zhuang poses in front of the Media Arts Center on Tuesday. Zhuang placed first at a debate tournament at the University of Puget Sound this weekend. Photo: Emma van der Veen.[\/caption]\r\n\r\nPalo Alto High School Speech and Debate team member junior Frances Zhuang placed first in the Lincoln-Douglas Open Division at the 83rd Annual Puget Sound High School Tournament this weekend in Tacoma, Washington.\r\n\r\nZhuang, a third-year debater, says that her exemplary performance was a result of team support, individual preparation and practice in speaking and thinking on the spot.\r\n\r\n“This [tournament] was definitely one of my personal bests,” Zhuang said. “My teammates all competed there and the way we worked together to help each other out was unbelievable. This put me in great spirits and contributed to my in-round confidence and poise.”\r\n\r\nZhuang  argued on the topic of freedom of speech on college campus.\r\n\r\n\"I did a lot more research about the topic this time and I found a bunch of really good arguments in favor of restricting certain kinds of free speech that people weren't expecting, and a lot of reasons why hate speech codes are good,\" Zhuang said. \"The skills I acquired from the last few years of debate helped me become a faster speaker and a more flexible thinker.”\r\n\r\nJunior debater Barry He and senior debater Colin Fee finished as quarterfinalists in the tournament, according to club president senior Ethan Teo. Teo says Paly was additionally awarded four “speaker awards,” presented to debaters with high average points given for quality of debate strategy and speaking skills in the preliminary rounds of the competition. Paly was awarded 4th, 5th, 6th and 7th places for Zhuang, He, Teo and Fee, respectively.\r\n\r\nAccording to Teo, the Vikings’ performance this weekend was well-deserved.\r\n\r\n“Our team did a phenomenal job this weekend, but I definitely saw it coming,” Teo said. “Frances, Barry and Colin have worked extremely hard on debate, especially this past year, so it's really great to see them perform well at tournaments.”\r\n\r\nThe tournament in Tacoma this weekend is a step towards the Tournament of Champions, the \"World Cup\" of high school debate, according to Zhuang. Zhuang received a bid for the Tournament of Champions because of her performance at this weekend’s competition, placing her halfway to being able to attend the TOC, <a href=\"http:\/\/palyvoice.com\/2016\/12\/13\/students-halfway-to-qualifying-for-tournament-of-champions-debate\/\">just like teammates Fee and He<\/a>.\r\n\r\n“I got what we call a 'bid to the TOC' at UPS [University of Puget Sound tournament],” Zhuang said. “The TOC is the ultimate debate tournament where the best debaters in the country get to compete, and a bid means you're halfway there. Debaters usually need two bids to qualify. Looking forward, my goals are to get another bid to the TOC, to get better at a wider variety of arguments, and to do well at future tournaments.”\r\n\r\nAccording to Teo, the team will compete next weekend in Los Angeles on its next step towards the TOC.","excerpt":"Palo Alto High School Speech and Debate team member junior Frances Zhuang placed first in the Lincoln-Douglas Open Division at the 83rd Annual Puget Sound High School Tournament this weekend in Tacoma, Washington.","date":"2017-01-10 10:37:58","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0076.jpg","categories":["News","Spotlight"],"tags":["debate","Fee","He","los angeles","palo alto high school","puget sound","speech and debate","tacoma","teo","toc","tournament","Tournament of Champions","University","Washington","zhuang"]}]