[{"id":129189,"title":"Due to rain, Club Day has been cancelled and rescheduled for Friday, Feb. 10","permalink":"http:\/\/palyvoice.com\/2017\/02\/03\/due-to-rain-club-day-has-been-cancelled-and-rescheduled-for-friday-feb-10\/","content":"","excerpt":"","date":"2017-02-03 11:34:47","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":129090,"title":"New clubs to spot at second semester Club Day","permalink":"http:\/\/palyvoice.com\/2017\/02\/02\/new-clubs-to-spot-at-second-semester-club-day\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/Screenshot-2017-02-02-at-10.31.49-AM.png\"><img class=\"alignnone size-full wp-image-129134\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/Screenshot-2017-02-02-at-10.31.49-AM.png\" alt=\"Screenshot 2017-02-02 at 10.31.49 AM\" width=\"600\" height=\"401\" \/><\/a>\r\n\r\nWith second semester's Club Day coming up tomorrow, students will be looking to join clubs, but may not know of the new clubs offered on campus in 2017. Read more to find out which clubs are new to Palo Alto High School and why you should sign up and get involved.\r\n\r\n<strong>R.O.C.K. (Reach Out. Care. Know)<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president junior Keahi Asing says that “R.O.C.K. stands for \"Reach Out. Care. Know,\" and is dedicated to mental health awareness and advocacy.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We want to build a strong community that supports itself, and ROCK focuses on educating kids like us on peer counseling so that we are all prepared if a friend, or anyone really, comes to us needing help,” Asing said.<\/span>\r\n\r\n<strong>Paly Green Club<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">According to club co-president junior Sarah Shader, the club will focus on two aspects in regards to nature: preservation and appreciation.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“My friend [and club co-president junior] Julie [Cornfield] and I realized that there wasn't an environmental club this year like there's been in past years, and so we decided we wanted to start our own,” Shader said.<\/span>\r\n\r\nShader says the club will gather in and out of school.\r\n\r\n<span style=\"font-weight: 400;\"> “We're going to do things like go on hikes and picnics, learn about how to cook food when you're camping, get wilderness first-aid certified, and [more]. Also, [we will] do activities [in] environmental awareness and activism, like organizing events at Paly, putting up posters, volunteering at Acterra, going to beach cleanups, [and more].”<\/span>\r\n\r\n<strong>Beach Volleyball Club<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president junior Maddy McNee says that this new club hopes to turn beach volleyball into an official Paly varsity sport in the future, and that making a club is the first step to getting there.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Because it is quite a process to create a sport at Paly, we had to initiate it as a club which may then turn into an actual sport next year if it ends up being approved by the Board [of Education] and other administrators,” McNee said. “We do have Kathy Laurence helping us with the club right now and she is very involved in helping us with the process.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The team will practice regularly and compete in local tournaments, according to McNee.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"We will be competing with others schools in the area and the winner of our league will have the opportunity to travel to Southern California to compete with schools there,\" McNee said. \"This will act as an alternative to an actual [varsity] sport at Paly but will have all the same commitments.”<\/span>\r\n\r\n<strong>Board Game Club <\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president junior Kesavan Soundararajan says Board game club <\/span><span style=\"font-weight: 400;\">is made to unite those with a love for board games, both the classics and cutting edge.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It's a great club for anyone to join because it'll be a social time and a fun hangout spot,” Soundararajan<\/span><span style=\"font-weight: 400;\"> said. “[We will play] the classics, with a couple new ones mixed in. We have the medieval age games, like chess, backgammon, online 8 ball pool, and also some new ones, like Settlers of Catan.”<\/span>\r\n\r\n<strong>Cadmus Magazine<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">According to club president sophomore Maraleis Sinton, Cadmus Magazine is a new creative writing publication, which allows those not enrolled in a creative writing class to “not only share ideas and stories, but [also] take part in something we have a passion [for].”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I encourage people to join who enjoy writing stories either fiction, partly fictional, or true to their own experiences,” Sinton said. “Writing has helped me in many ways and I hope to do the same with others. Behind every smile is a story and that's what I want to share.”<\/span>\r\n\r\n<strong>Paly Agents of Change<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">This new club aims to help students turn their ideas into actions that will impact their communities, specifically regarding social justice issues, according to club president sophomore Kristina Im.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our main goal is to better learn and understand our ever evolving society and establish a sense of purpose among ourselves and other club members,” Im said. “This club is focused on social justice matters, and gives people outside of the Social Justice Pathway an opportunity to engage in similar endeavors. We will have discussions about relevant worldly issues, and plan to turn discussion into action.”<\/span>\r\n\r\n<strong>YIBI Club (Youth International Business Initiative)<\/strong>\r\n\r\nYIBI, or Youth International Business Initiative, is a business club that aims to recruit students that are interested in business and learning more about business. It is currently an organization that exists off campus, so club president sophomore Eric Yap brought a branch of <a href=\"http:\/\/www.yibius.org\">YIBI<\/a> to Paly. The club plans to order Fortune magazines to read and discuss, listen to business speakers, and compete in conferences.\r\n\r\n<strong>Justice League Club<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">This club is dedicated to giving students a place to relax and unwind while watching <a href=\"http:\/\/www.imdb.com\/title\/tt0974015\/\">Justice League<\/a> episodes, according to club president sophomore Robin De Lorenzo.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Justice League Club is a feel-good club, so if people have quizzes or tests coming up, they can just come here and have fun watching cartoons,” De Lorenzo said.<\/span>\r\n\r\n<strong>Paly Marketing and Financing<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president junior Jeremy Dou says that this club will give students with this interest an opportunity to “engage, discuss, and help with each other [with] marketing and financing.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We'll do virtual stock trading simulations and future financing planning,” Dou said. “We believe that, by doing this, we can have a better idea of how we should plan our future wisely financially.”<\/span>\r\n\r\n<strong>Anthro Magazine<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">According to club co-president junior Maya Homan, the club aims to showcase diverse perspectives within local communities.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“At our school there are a lot of people with very diverse perspectives and experiences that we can learn from,” Homan said. “In such a politically polarizing time, it's especially important to be able to respectfully listen to each other and take other people's perspectives into account, which is what Anthro is here to do.”<\/span>\r\n\r\n<strong>SCOOP (Student Cooperative for Openness and Opportunity in Press)<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">SCOOP, or, Student Cooperative for Openness and Opportunity in Press, is a club aimed at finding ways to enhance diversity within journalistic staffs and within news coverage. The club aims to discover how to remove bias in news covering certain genders, religions, and races. This will be carried out through discussions about many topics such as current articles. It also hopes to emphasize the importance and need for diversity in media coverage. Additionally, students in the club will have the opportunity to write articles and listen to guest speakers.<\/span>\r\n\r\n<em>Editor's note: staff writer Soumya Jhaveri is the president of SCOOP club.<\/em>\r\n\r\n<strong>Marine Rescue<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">According to club president Ria Pai, the club aims to educate students about marine biology in an enjoyable way. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We [will] raise awareness for marine animals captivity and write letters to places like Seaworld talking about how capturing marine animals is terrible,” Pai said. “We want to show people that science can be exciting!”<\/span>\r\n\r\n<strong>Writers Club<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">According to club vice president Maya Wilson, students will gather to write and discuss their ideas.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We're going to start off with a warmup to wake you up a little bit then we're going to do some prompt or journaling responses and lastly we're going to finish it off with a sharing period where we share what we wrote about or discuss the prompt,” Wilson said.<\/span>\r\n\r\n<strong>Roots<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president Kat Merk says Roots aims to unite students with a common goal: \"save our planet.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"Roots is a environmental club which guides students to plan and execute projects which benefit our environment,\" Merk said. “Our goal is to to make Palo Alto High School a more environmentally-friendly school by helping students take initiative to fight climate change.\"<\/span>\r\n\r\n<strong>Pet Pals<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president sophomore Eileen Ha says that Pet Pals will be committed to making toys, beds, accessories and other items for their pets and for animals in local shelters.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The purpose of Pet Pals Club is to share love with our beloved pets by giving them handmade gifts,” Ha said. “We also plan to share love with animals at animal shelters by donating dog and cat toys that we make. It's okay if people are not good with making stuff because we all will share ideas and help each other.”<\/span>\r\n\r\n<strong>Archery<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">This new club will inform members about archery and encourage students to try out archery, according to club president junior Andrew Suk.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We teach about archery concepts and prepare people who do want to shoot at nearby archery ranges,” Suk said. “People should join because people do not know much about archery and many people haven't experienced the joy of shooting a bow, especially when shooting with friends.”<\/span>\r\n\r\n&nbsp;","excerpt":"With second semester's Club Day coming up this Friday, students will be looking to join clubs, but may not know what some of the new ones on campus are. Read more to find out which clubs are new to Palo Alto High School and why you should sign up and get involved.","date":"2017-02-02 18:37:17","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/Screenshot-2017-02-02-at-10.31.49-AM.png","categories":["Features","Uncategorized"],"tags":["agents of change","anthro","beach volleyball","board games","cadmus magazine","club day","clubs","financing","green club","justice league","marketing","Rock","scoop","yibi"]},{"id":128777,"title":"MUN shatters records at Santa Clara Valley conference","permalink":"http:\/\/palyvoice.com\/2017\/02\/02\/mun-shatters-records-at-santa-clara-valley-conference\/","content":"[caption id=\"attachment_129143\" align=\"alignnone\" width=\"729\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/16466304_10206273999487767_422112059_o.jpg\"><img class=\" wp-image-129143\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/16466304_10206273999487767_422112059_o.jpg\" alt=\"Senior MUN president Tara Madhav and junior treasurer Simran Pujji conduct research for an upcoming conference. Photo by Aidan Maese-Czeropski\" width=\"729\" height=\"428\" \/><\/a> Senior MUN president Tara Madhav and junior treasurer Simran Pujji conduct research for an upcoming conference. Photo by Aidan Maese-Czeropski[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School Model United Nations club is celebrating an exceptional performance this weekend at the Santa Clara Valley Model United Nations Conference, where they received six awards.<\/span>\r\n\r\nClub president Tara Madhav says the team's accolades were well-earned.\r\n\r\n<span style=\"font-weight: 400;\">“Our success at this conference was the culmination of a lot of hard work by the club this year and, in the long run, the past five years,\" Madhav said. \"SCVMUN was our most successful conference ever, and to see everyone's hard work pay off was amazing.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Madhav, the club members dove into committee proceedings, practiced their speeches, and wrote strong position papers, eventually resulting in their success. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Sophomore Asia Gardias and freshman Ryan Wisowaty won Best Delegates in the United Nations Environmental Programme committee for representing Bolivia and speaking about tailing dams and genetically modified organisms. <\/span>Gardias said her partner Wisowaty played a large part in their victory due to his combined ability to speak on the spot and his knowledge on genetically modified organisms.\r\n\r\n\"I’m seriously very proud of our team,\" Gardias said. \"Everyone did really great. I’m going to be so sad to see the seniors go, we’re all going to cry.\"\r\n\r\n<span style=\"font-weight: 400;\">Additionally, Madhav and senior club vice president Alicia Mies received Honorable Mentions as Bolivia on the LEGAL committee.  The legal committee deals with issues of international law and legal infrastructure. Mies, along with former Paly student Laure Blanchez, who now attends Li Po Chun United World College in Hong Kong, won the first major award for the club in 2016 as Outstanding Delegates, one of the three tiers of awards that can be won.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Seniors Kimberly Markevitch and MUN secretary Aidan Maese-Czeropski both won Honorable Mentions for Bolivia on the SOCHUM (Social-Humanitarian) committee in the conference. The committee <\/span><span style=\"font-weight: 400;\">deals with social, humanitarian and cultural issues such as reproductive rights, racism, refugees and child rights. <\/span><span style=\"font-weight: 400;\">Maese-Czeropski previously received a Verbal Commendation in November 2016 at the Stanford Model United Nations Conference. <\/span>\r\n\r\n<span style=\"font-weight: 400;\"> Madhav is excited about what lies in store for the club.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I know that this conference marks a new mark of achievement in Model UN's continued growth and achievement as a club,” Madhav said. <\/span>","excerpt":"The Palo Alto High School Model United Nations club is celebrating an exceptional performance this weekend at the Santa Clara Valley Model United Nations Conference, where they received six awards.\r\n\r\n\r\n","date":"2017-02-02 17:51:53","author":"Soumya Jhaveri","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/16466304_10206273999487767_422112059_o1.jpg","categories":["Global Outlook","News"],"tags":["aidan maese-czeropski","alicia mies","asia gardias","kimberly markevitch","mun","paly mun","ryan wisowaty","scvmun","Tara Madhav"]},{"id":128733,"title":"15 senior athletes commit to schools on National Signing Day","permalink":"http:\/\/palyvoice.com\/2017\/02\/02\/15-senior-athletes-commit-to-schools-on-national-signing-day\/","content":"[caption id=\"attachment_129049\" align=\"alignnone\" width=\"563\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_7124.jpg\"><img class=\"wp-image-129049\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_7124.jpg\" alt=\"IMG_7124\" width=\"563\" height=\"337\" \/><\/a> Palo Alto High School student athletes convened during lunch on Wednesday in the Media Arts Center for the National Signing Day Ceremony. \"You have made our entire school community proud and we are so happy to celebrate this with you,\" Principal Kim Diorio said. \"You embody all the values that we hold so dearly at Paly: things like integrity, respect, teamwork and collaboration.\" Photo: Daniel Li.[\/caption]\r\n\r\nMany student athletes often dream of the day when they can represent their school at the collegiate level. Fifteen Palo Alto High School senior athletes hit a milestone toward that dream on Wednesday during lunch, when the school honored them on National Signing Day in the Media Arts Center.\r\n\r\nThe National Signing Day Ceremony, usually the first Wednesday of February, marks the first day a high school senior athlete can sign the Letter of Intent for a sport with a school affiliated with the <a title=\"National Collegiate Athletic Association\" href=\"https:\/\/en.wikipedia.org\/wiki\/National_Collegiate_Athletic_Association\">National Collegiate Athletic Association<\/a>.\r\n\r\nThe athletes include Alex Liang (Stanford University) and Grace Zhao (Stanford University) for swimming; Lauola Amanoni (San Jose State University), Mason Wittman (University of North Carolina, Chapel Hill), Neil Verwillow (Trinity University) and Mara Zenger (Westminster College) for soccer; Troy Henderson (University of Puget Sound) and Peter Snodgrass (Northwestern University) for football; Jessica Lee (Claremont McKenna College) and Cassie Fong (San Francisco State University) for volleyball; Kimmi Chin (University of California, Los Angeles), Clay Watson (Columbia University) and Jackson Wood (University of Pennsylvania) for rowing; Kaitlin Chiu (Smith College) for lacrosse; and Bennet Huang (University of Iowa) for gymnastics.\r\n\r\nAccording to Liang, he feels extremely grateful for the opportunity to continue the sport he loves at a Division one school for the next four years.\r\n\r\n\"I have sacrificed so much time and schoolwork over the years for this sport and it is finally paying off,\" Liang said. \"I am so excited and feel so fortunate to have the opportunity to swim with such highly ranked swimmers at Stanford.\"\r\n\r\nPrincipal Kim Diorio, Athletic Director Kathi Bowers and University of California-Davis alumna and volleyball player Ally Whitson spoke at the event.\r\n\r\nBowers emphasized the importance <span style=\"font-weight: 400;\">of recognizing that these student athletes have shown a consistent commitment both in the classroom and on the field, gym or pool throughout their years at Paly. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"This is a culmination of lots of work; it’s not something that happens in one season or one year,\" Bowers said. \"It takes the support of their families, their coaches, their teachers and their friends.\"<\/span>\r\n\r\nWhitson shed insight on the lessons she learned as a collegiate athlete to the college-bound seniors.\r\n\r\n\"<span style=\"font-weight: 400;\">There’s definitely going to be a few sacrifices that you are going to make, but you learn some of the most valuable lessons by playing a sport,\" Whitson said. \"First, you will learn time management: how to balance your practice schedule with academics and just being a college student. You will learn determination when you come in as a freshman: wanting to beat out a returning player to get that starting spot. You will also learn discipline: having to get out of bed when your alarm goes off in the middle of winter for 6 a.m. weights and biking across Davis in the rain. Furthermore, one of the biggest things I learned was resilience: having to show up to practice the day after an extremely tough loss and ready to work even harder. Lastly, you will learn how to be a team player: you want to work as hard as you can for your teammates; after all, you will win together and lose together.\"<\/span>\r\n\r\nWhitson encouraged the athletes to enjoy the journey and to not be afraid to reach out for help.\r\n\r\n<span style=\"font-weight: 400;\">\"Remember that you guys aren’t alone in this adventure,\" Whitson said. \"Never hesitate to reach out to the people around you. You only get a few years as a collegiate athlete, but the lessons you learn will be there for the rest of your life.\"<\/span>","excerpt":"Many student athletes often dream of the day when they can represent their school at the collegiate level. Fifteen Palo Alto High School hit a milestone toward that dream on Wednesday during lunch, when the school honored them on National Signing Day in the Media Arts Center.","date":"2017-02-02 09:20:01","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_7124.jpg","categories":["Sports","Spotlight"],"tags":["Alex","ally","athlete","bowers","college","kathi","liang","national signing day","whitson"]},{"id":128876,"title":"In review: The Paly Voice summarizes Donald Trump&#8217;s first week in office","permalink":"http:\/\/palyvoice.com\/2017\/02\/01\/in-review-the-paly-voice-summarizes-donald-trumps-first-week-in-office\/","content":"[caption id=\"attachment_129038\" align=\"aligncenter\" width=\"353\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Executive-Order.png\"><img class=\" wp-image-129038\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Executive-Order.png\" alt=\"caption caption caption\" width=\"353\" height=\"402\" \/><\/a> President Donald Trump has had a very active first week in office, passing several executive orders as well as making appointments to his cabinet. Illustration: Timothy Liu.[\/caption]\r\n\r\nThe 45th president of the United States had a very busy first week in which he issued several executive orders reflective of his major campaign promises. Below is a list of some of the most noteworthy actions taken  by President Donald J. Trump during his first week in the Oval Office.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/2\/executive-order-minimizing-economic-burden-patient-protection-and\">Affordable Care Act:<\/a><\/strong>\r\n\r\nThe president's first executive order was passed on the day of his inauguration, which is a relatively vague order aiming to \"minimize the economic burden\" of the Patient Protection and Affordable Care Act.\r\n\r\nIt begins with President Trump declaring that his administration will work to replace and repeal the act. The order itself is intended to reduce costs of the Affordable Care Act until this replacement occurs.\r\n\r\nWashington executives with authority under the act, such as  have the power to \"waive, defer, grant exemptions from, or delay the implementation of any provision or requirement of the Act that would impose a fiscal burden on any State or a cost, fee, tax, penalty, or regulatory burden on individuals, families, healthcare providers, health insurers, patients, recipients of healthcare services, purchasers of health insurance, or makers of medical devices, products, or medications.\"\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/24\/executive-order-expediting-environmental-reviews-and-approvals-high\">Environmental Reviews and Infrastructure:<\/a><\/strong>\r\n\r\nTrump's next executive order was passed four days later, this time \"expediting environmental reviews and approvals for high priority infrastructure projects.\" Trump identifies the purpose of the order as an effort to increase the efficiency of decisions to promote infrastructure investment in order to grow the American economy.\r\n\r\nThe president aims to expedite the process by implementing a 30-day period following a project's proposal, during which time the importance will be determined. If it is deemed to be highly beneficial to the \"general welfare\" of the nation, it will be labeled as a \"high priority.\"\r\n\r\nThe Chairman of the Council of Environmental Quality and the head of the relevant agency will then design \"expedited procedures and deadlines\" for the completion of environmental reviews and approvals of \"high priority\" projects.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/25\/presidential-executive-order-enhancing-public-safety-interior-united\">Sanctuary Cities:<\/a><\/strong>\r\n\r\nOn Jan. 25, Trump issued another executive order that addresses sanctuary cities, which violate federal law by shielding undocumented immigrants from deportation.\r\n\r\nTrump introduces the order by stating \"The purpose of this order is to direct executive departments and agencies (agencies) to employ all lawful means to enforce the immigration laws of the United States.\"\r\n\r\nThe action will also \"ensure that jurisdictions that fail to comply with applicable Federal law do not receive Federal funds, except as mandated by law.\"\r\n\r\nTrump also emphasizes his desire for government agencies to utilize \"all available resources\" in ensuring that immigration laws and regulations are followed without exception.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/25\/executive-order-border-security-and-immigration-enforcement-improvements\">Illegal Immigration\/The Wall:<\/a><\/strong>\r\n\r\nPresident Trump's next executive order, which was issued on Jan. 25, was intended to reduce the strain on both federal resources and federal organizations responsible for maintaining border security. Trump specifically names illegal immigration across the southern border as the cause of this strain. In line with one of President Trump's most notable campaign promises, this executive order begins the process of constructing a wall on America's border with Mexico.\r\n\r\nThe action's most notable component is the process to \"secure the southern border of the United States through the immediate construction of a physical wall on the southern border, monitored and supported by adequate personnel so as to prevent illegal immigration, drug and human trafficking, and acts of terrorism.\"\r\n\r\nThe order also pushes government agencies to speed up the process of determining the eligibility of a person detained on suspicion of violating US immigration policy.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/27\/executive-order-protecting-nation-foreign-terrorist-entry-united-states\">Restriction on Immigration\/Travel:<\/a><\/strong>\r\n\r\nOn Jan. 27, Trump passed an executive order which implements a \"Suspension of Issuance of Visas and Other Immigration Benefits to Nationals of Countries of Particular Concern.\" These countries include Iraq, Iran, Syria, Yemen, Sudan, Somalia and Libya.\r\n\r\nTrump also ordered that for a 90 day period, \"immigrant and nonimmigrant entry into the United States of aliens\" from these 7 countries will be restricted. Foreign nationals traveling on certain diplomatic visas will be exempt from this restriction.\r\n\r\nTravelers who are detained are subject to vetting and investigation. Once they have been evaluated, the travelers will be either be permitted access to the country or denied it, depending on whether or not they can be confirmed as peaceful.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/28\/executive-order-ethics-commitments-executive-branch-appointees\">Ethics Pledge:<\/a><\/strong>\r\n\r\nThe president issued yet another executive order on Jan. 28, consisting of nine major ethical commitments which the members of his executive branch must uphold. These commitments range from preventing members of his cabinet from participating in certain lobbying activities, to keeping members of his cabinet from being influenced by lobbyists during their service.\r\n\r\nThe order also mandates that the members of his cabinet carefully read and then sign the document.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/27\/executive-order-protecting-nation-foreign-terrorist-entry-united-states\">Government Regulation of Business:<\/a><\/strong>\r\n\r\nOn Jan. 28, the president passed an executive order impacting federal regulation of business. This executive order requires a minimum of two previously existing governmental regulations of business to be proposed for elimination whenever a new policy is implemented. It is in line with his \"one in two out\" campaign promise.\r\n\r\nTrump declared that that it \"is important that for every one new regulation issued, at least two prior regulations be identified for elimination, and that the cost of planned regulations be prudently managed and controlled through a budgeting process.\"\r\n\r\nThis executive order specifically affects the \"fiscal year 2017, which is in progress\". This statement restricts the longevity of the order to the end of this fiscal year.\r\n\r\nThe order also mandates that \"the total incremental cost\" of  all new regulations, including repealed regulations, finalized in 2017 cannot exceed zero, unless otherwise required by law or if advised by the Director of the Office of Management and Budget (Director).\r\n\r\nTrump has had a very busy first week, and this will not be the end of his actions as president. Check back with The Paly Voice for future breakdowns of the Trump administration's actions.","excerpt":"The 45th president of the United States had a very busy first week in which he issued several executive orders reflective of his major campaign promises. Below is a list of some of the most noteworthy actions taken by President Donald J. Trump during his first week in the Oval Office.","date":"2017-02-01 21:30:18","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_46311.jpg","categories":["Election 2016","News","Spotlight"],"tags":["Donald Trump","election 2016","Executive Orders","first week","inauguration","law","Politics"]},{"id":128748,"title":"International Response to the first week of Trump&#8217;s Presidency","permalink":"http:\/\/palyvoice.com\/2017\/02\/01\/international-response-to-the-first-week-of-trumps-presidency\/","content":"<span style=\"font-weight: 400;\">The 2016 presidential election cycle has left the people of the United States polarized. With portions of the nation in utter triumph, and others in vigorous protest, Trump's first week as President has already witnessed a variety of executive actions that have inspired events like the <\/span><a href=\"http:\/\/palyvoice.com\/2017\/01\/31\/greater-than-fear-womens-march-in-san-francisco\/\"><span style=\"font-weight: 400;\">Women’s March<\/span><\/a><span style=\"font-weight: 400;\">, <\/span><a href=\"http:\/\/palyvoice.com\/2017\/01\/31\/locals-protest-new-trump-policies-at-san-francisco-international-airport\/\"><span style=\"font-weight: 400;\">airport protests in San Francisco<\/span><\/a><span style=\"font-weight: 400;\"> and <\/span><a href=\"http:\/\/www.latimes.com\/local\/lanow\/la-me-lax-protest-20170129-story.html\"><span style=\"font-weight: 400;\">Los Angeles<\/span><\/a><span style=\"font-weight: 400;\">, and local protests throughout the Bay Area. But what does the international scene have to say about this? Let’s meet a small pool of the world wide view. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">In response to the first week of Trump’s administration, The Paly Voice interviewed interested individuals from 15 different nationalities. The themes mentioned repeatedly have been social issues, international relations, racism, economic growth and decay, the rise of nationalism, relations with China and Russia, environmental protection and divided populations. <\/span>\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n<img class=\"alwaysThinglink aligncenter\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/882838972944875522\/1024\/10\/scaletowidth#tl-882838972944875522;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>","excerpt":"In response to the first week of Trump’s administration, The Paly Voice interviewed interested individuals from 15 different nationalities. ","date":"2017-02-01 18:40:51","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/thefutureisfemale-copy.jpg","categories":["Editor's Pick","Global Outlook","Spotlight"],"tags":["Canada","China","executive order","International","Italy","New Zealand","Norway","Olivia Ross","palo alto","paly","Pramstaller","protests","Reactions","Russia","sister march","Spain","Trump","trump administration","Waghorn","Women's March"]},{"id":128968,"title":"Girls&#8217; soccer ends Spartans&#8217; spotless record, keeps its own unblemished","permalink":"http:\/\/palyvoice.com\/2017\/02\/01\/girls-soccer-ends-spartans-spotless-record-keeps-its-own-unblemished\/","content":"[caption id=\"attachment_129017\" align=\"alignnone\" width=\"494\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/DSC_0070.jpeg\"><img class=\"wp-image-129017 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/DSC_0070.jpeg\" alt=\"\" width=\"494\" height=\"308\" \/><\/a> Junior midfielder Ally Scheve prepares to take a free kick for Paly, just outside Mountain View's penalty box. The Vikings would go on to shut out the Spartans, ending Mountain View's winning streak and prolonging their own. Photo: Jackson Doerr[\/caption]\r\n\r\nThough it is a common conception that Palo Alto High School's primary athletic rival is either Gunn or Los Gatos, if you ask a member of the girls' soccer team, the response will overwhelmingly be “Mountain View.”\r\n\r\nIt was the Spartans who stopped the Vikings from winning the Central Coast Section final in 2015. It was Mountain View that ended the Vikings' chance at a perfect season in 2016. Other teams may see Mountain View as a tough opponent, but nothing more than that: they have no vendetta with the Spartans the way the girls’ soccer team does.\r\n\r\n<span style=\"font-weight: 400;\">It’s fitting, then, that Paly would face off against Mountain View in almost the exact same position that they were in a year ago, with the Vikes’ undefeated record on the line. But this time, instead of faltering for the third time, the Vikings prevailed, emerging with a 2-0 victory, propelling them into first place in the De Anza League, with an almost spotless record of 5-0-3, edging out Mountain View’s record of 5-1-1. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The highlight of the game occurred late in the first half, with the ball being fiercely contested by both teams, neither side maintaining possession for longer than a minute. Senior defender Lauola Amanoni spotted an opening, sprinting up from the back line, she received a pass from freshman midfielder Chloe Japic. Dribbling the ball up the middle, Amanoni beat out two consecutive Spartan defenders and fired a shot from way beyond the 18-yard line into the goal. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Amanoni’s goal woke the Vikings up; their play became more precise, and not five minutes later they had scored again, this time a goal by Japic. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">While the Vikes may have shut the Spartans out, play was not perfect on the defensive side. Communication errors plagued Paly early in the game, leading to some goal opportunities for Mountain View.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior midfielder Tess Preising attributes the on-field confusion to a new formation the Vikings were trying out.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“What we didn’t do too well was defending and marking because we played with a new formation,” Preising said. “We were doing a 5-4-1 so some of us were confused in the midfield.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> The new formation certainly caused some disarray on the field, but as the game progressed, errors appeared less and less. Chatter on the field increased, players letting each other know if they had time, or if they had to get rid of the ball immediately. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Mountain View’s errors came from their inability to capitalize on mistakes that Paly made. Too often the Vikes would fail to get the ball out of their back line, or if they did, it would immediately return to a Spartan player. Amanoni recognizes the team's difficulties with clearing the ball as a problem to work on. “We kept clearing it [the ball], where they were able to advance off of it.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to head coach Kurt Devlin, Paly faced off against Mountain View down several players. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We need to work on getting healthy,\" Devlin said. \"We have a bunch of girls that are nicked up or sick, so we need to rest and get healthy for the rest of the way out.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The team’s next match will be against the Homestead High School Mustangs, who currently sit in the middle of the De Anza league standings with a record of 4-4-0. The game at Homestead on Thursday will give the Vikings the chance to try out their new formation again before facing third place Santa Clara High School (3-0-3) in a week.<\/span>","excerpt":"The Palo Alto High School girls' soccer team emerged victorious over Mountain View with a final score of 2-0. ","date":"2017-02-01 12:14:51","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DJI_0003.jpg","categories":["Sports","Spotlight"],"tags":["chloe japic","girls","kurt devlin","lauola amanoni","mountain view","paly","Soccer","spartans","Tess Preising","vikings"]},{"id":128519,"title":"Greater than fear: Women&#8217;s March in San Francisco","permalink":"http:\/\/palyvoice.com\/2017\/01\/31\/greater-than-fear-womens-march-in-san-francisco\/","content":"[caption id=\"attachment_128541\" align=\"aligncenter\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/orange.jpg\"><img class=\"wp-image-128541\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/orange.jpg\" alt=\"orange\" width=\"650\" height=\"433\" \/><\/a> A bright blue and orange sign reads \"pussy power\" against a bright orange wall at the San Francisco Women's March, a reference to the videos of President Trump's remarks regarding women that leaked during the election cycle. Photo: Rachel Code.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">More than 100,000 men and women attended the San Francisco Women's March on January 21st, chanting and singing amidst a downpour of rain, under a multi-colored canopy of umbrellas and vibrant posters. <\/span>\r\n\r\nThis march was among the 673 reported around the world just one day after Donald Trump was sworn in as president, according to <a href=\"https:\/\/www.nytimes.com\/interactive\/2017\/01\/22\/us\/politics\/womens-march-trump-crowd-estimates.html\">The New York Times<\/a>, all following a movement led by women in Washington DC. The march sought predominantly to advocate for women's rights, but also to stand in solidarity with the diverse communities in our country, and for the freedom of expression and choice of individuals of all races, religions, ethnicities and sexual orientations, according to the Women's March on Washington <a href=\"https:\/\/www.womensmarch.com\/mission\/\">website<\/a>.\r\n\r\nThe crowd of 2.5 million people across the world sent a strong signal, organizers said, to the world and our government that the coming years will be unfamiliar territory, the future a time of action and bold change.\r\n\r\nThe Paly Voice marched alongside the powerful crowd and gathered personal stories of those who felt it necessary to speak up that day.\r\n\r\n<strong><span style=\"font-size: 14pt; color: #ff99cc;\">Scenes from the San Fransisco Women's March<\/span><\/strong>\r\n<iframe src=\"https:\/\/www.youtube.com\/embed\/tpFMypWPvZA\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n<p style=\"text-align: justify;\"><span style=\"font-size: 14pt; color: #ff99cc;\"><strong>Locations of sister marches throughout California<\/strong><\/span><\/p>\r\n<iframe src=\"https:\/\/www.google.com\/maps\/d\/embed?mid=16Ryr-xl3ghrwTItdGlV_megnmqA\" width=\"640\" height=\"480\"><\/iframe>\r\n\r\n<span style=\"font-size: 18pt; color: #ff99cc;\"><strong>The Train <\/strong><\/span>\r\n\r\nAt the Caltrain station on the way to the protest, Palo Altans formed a crowd sporting pink \"pussy hats,\" a reference to a leaked video of President Trump remark's towards women and holding bright colored signs. The line for the ticket booth, including this group of reporters for The Paly Voice, stretched to the other side of the station and the ticket dispensers ran out of exact change for the demonstrators. An excited energy of anticipation prickled the air as people stood waiting for the 2:30 p.m. train.\r\n\r\nStanford student Yaelle Viner was one demonstrator wearing a pink hat. She smiled through the cold air as she explained why she found it necessary to partake in the march.\r\n\r\n“I have a 6-year-old sister, and granted she is a little young to understand socio-political issues, but I am marching so [that] she is able to see a world as progressive as I have seen in my lifetime,” Viner said.\r\n\r\nHer friend, Grace Wallace, stressed the importance of advocating for intersectional feminism, emphasizing that we must remember how limited an individualist viewpoint can be.\r\n\r\n[caption id=\"attachment_128533\" align=\"alignright\" width=\"370\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/trainstation.jpg\"><img class=\"wp-image-128533\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/trainstation.jpg\" alt=\"trainstation\" width=\"370\" height=\"247\" \/><\/a> Palo Alto student protesters Grace Wallace, Emma Rothenburg, Yaelle Viner and Sarah Vernalis hold a poster reading, \"I march for intersectional feminism.\" Photo: Rachel Code.[\/caption]\r\n\r\n“I am marching to show that feminist causes are intersectional and apply to many different people,\" Wallace said.  \"All of them are equally valid and need to be heard. My sign reads, ‘I march for intersectional feminism’ and then on the back, ‘not open-minded fascism.' Intersectionality is basically the theory that identities coalesce to form different experiences so that the experience of a white-identifying woman and a black-identifying woman will not be the same and it is important to acknowledge those differences.”\r\n\r\nAs the train arrived, the demonstrators filled the train-cars past their limit, no seat remained empty, no isle devoid of pink. People clung to the windows and each other, cramped on stairs and in walkways as they made their way into the city.\r\n\r\nBella Gaberal, a Gunn High School senior riding the Caltrain, reflected on the excitement of taking part in a global movement.\r\n\r\n<span style=\"font-weight: 400;\">“It’s [The protest is] happening worldwide and in many countries,” Gaberal said. “To me it’s just a promise to keep fighting.”<\/span>\r\n\r\nAs the journey continued and the train reached the San Francisco station, the lines, between young and old, between the Palo-Altan and the San Francisco natives, between race, gender, ethnicity mingled into a single entity as the crowd bonded in a common purpose.\r\n\r\nEmma Rothenburg, protester and college student, grew up surrounded by a powerful female environment. For her, it was important that her mom, her sister and all women and men alike were marching, although separated by miles, together.\r\n\r\n“I am marching with my mother and sister — my mother is down in southern California and my sister will be in S.F. so I am joining them,” Rothenburg said. “I was raised by a strong female, who was also raised by another strong female and so on. I know there is nothing a woman can't do and I want everyone to know that.”\r\n\r\n[caption id=\"attachment_128548\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/littleboy1.jpg\"><img class=\"wp-image-128548\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/littleboy1.jpg\" alt=\"littleboy\" width=\"600\" height=\"400\" \/><\/a> A small boy sits on the shoulders of his father amidst the wild crowds of the San Francisco Women's March at the Civic Center Plaza on Jan. 21. Behind him a multitude of signs, including a \"Bernie 2020\" poster, wave in the wind. Photo: Emilia Diaz-Magaloni.[\/caption]\r\n\r\n[caption id=\"attachment_128527\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/NO.jpg\"><img class=\"wp-image-128527\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/NO.jpg\" alt=\"NO\" width=\"600\" height=\"400\" \/><\/a> A women's hand holds a small poster reading \"No!\" amidst the large crowds during the rally. Photo: Rachel Code.[\/caption]\r\n\r\n<span style=\"color: #ff99cc;\"><strong><span style=\"font-size: 18pt;\">The Rally <\/span><\/strong><\/span>\r\n\r\nThe sound of various feminist chants and fierce cheers filled the San Francisco streets as thousands of people stood together, bodies pressed up against each other in solidarity to advocate for equality. Creative signs, reading “keep your rosaries off my ovaries ”and “fight like a girl,” coupled with colorful drawings and designs waved high over the heads of the protestors.\r\n\r\n[caption id=\"attachment_128544\" align=\"alignright\" width=\"421\"]<img class=\"wp-image-128544\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0320.jpg\" alt=\"DSC_0320\" width=\"421\" height=\"280\" \/> Paly junior Sophia Muiz holds her beautiful hand drawn poster reading \"equality and liberty, unity and hope.\" Photo: Rachel Code.[\/caption]\r\n\r\nAs more and more people joined the rally, rain began to pour down and yet no one dared to move. Instead, they embraced the cold dreary weather in a sort of protest, taking out pink rain jackets and vibrant umbrella’s and craning their necks to listen to Supervisor Jane Kim as she passionately spoke into the microphone insisting that San Francisco has an important role in gender equality and women’s rights. This was followed by speakers making statements about the election and \"moving forward.\"\r\n\r\n<span style=\"font-weight: 400;\">As the night moved on, folk singer Joan Baez and queer hip hop artist <\/span><span style=\"font-weight: 400;\">MicahTron<\/span> <span style=\"font-weight: 400;\">performed, energizing the crowd and moving most to their feet regardless of age. People of all ages, races and genders swayed to the beat of the music becoming one powerful movement in the name of equality and respect.<\/span>\r\n\r\nPaly junior Sofia Muiz says she felt empowered as she passionately rallied the streets of downtown San Francisco with a bright sign reading “equality and liberty, unity in hope.”\r\n\r\n“I am marching in solidarity with women in protest of the [man] that just got sworn in, seeing Obama leave on that helicopter might be the saddest moment of my life,” Muiz said. “This man has said so many terrible things to so many wonderful people. I think today we should be working towards equality for all genders, races and creeds and keep fighting.”\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/12wa1S_HBgY_9Fb-lykLT-Kqppex0GyrpX6TlWF1wKW8\/embed?start=true&amp;loop=true&amp;delayms=5000\" width=\"665\" height=\"443\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>\r\n\r\n<span style=\"font-weight: 400;\">Benedito dos Santos, demonstrator and anthropologist, presented a unique viewpoint on the protest. Originally from Brazil and working in a psychology department centered on children's rights issues, Santos explained in a heavy accent how we must view this march with a broad perspective, going farther than the streets of S.F. and even Washington.<\/span>\r\n\r\n“I decided to come to the march because it is an international movement,\" dos Santos said. \"There is a conservative movement taking over the country — in Brazil it is also happening. I came to be in solidarity with the Americans, and the Americans against Trump.”\r\n\r\n<span style=\"font-size: 18pt; color: #ff99cc;\"><strong>The March<\/strong><\/span>\r\n\r\nAs the rally came to an end, the march began. Thousands of people poured into dark San Francisco streets lit up by red lanterns, the light reflecting off puddles and raindrops still clinging to umbrellas and jackets, that in turn illuminated the streets with a warm flickering glow. Loud chants echoed through the city, voices joining through the soft pattering of rain as the storm subsided.\r\n\r\nAccording to dos Santos, while walking in the rain a special energy took over the crowd.\r\n\r\n“Walking, I felt the sensation of coming together, of thousands of people coming together,\" dos Santos said. \"I like the energy, the energy that comes out of these gatherings. I feel like oh my God, these people, we are talking about the same language. The energy is part of it, it helps us see how people can make a difference.”\r\n\r\n“In Brazil,” dos Santos added, “it would probably be louder, with dancing. Here it was very orderly and quiet, but I like the phrases that were said. The number of people was inspiring.”\r\n\r\n[caption id=\"attachment_128554\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0223.jpg\"><img class=\"wp-image-128554\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0223.jpg\" alt=\"DSC_0223\" width=\"600\" height=\"400\" \/><\/a> The march surges down Market Street in downtown San Francisco. Photo: Emilia Diaz-Magaloni.[\/caption]\r\n\r\n[caption id=\"attachment_128586\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/rain.jpg\"><img class=\"wp-image-128586\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/rain.jpg\" alt=\"rain\" width=\"600\" height=\"400\" \/><\/a> A man holds his poster \"come on ladies lets get in formation\" above his head to shield himself from the rain. Photo: Emilia Diaz-Magaloni.[\/caption]\r\n\r\n[caption id=\"attachment_128546\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/nightmarch.jpg\"><img class=\"wp-image-128546\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/nightmarch.jpg\" alt=\"nightmarch\" width=\"600\" height=\"400\" \/><\/a> Shepard Fairey's \"we the people\" design of a Hispanic women is illuminated by the orange glow of lanterns as the protestors march through the rain. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\n[caption id=\"attachment_128789\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0381.jpg\"><img class=\"wp-image-128789\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0381.jpg\" alt=\"A neon green sign reads &quot;respect my existence or expect resistance.&quot; Photo: Emilia Diaz-Magaloni\" width=\"600\" height=\"400\" \/><\/a> A neon green sign reads \"respect my existence or expect resistance.\" Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\n[caption id=\"attachment_128542\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/signfocus.jpg\"><img class=\"wp-image-128542\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/signfocus.jpg\" alt=\"signfocus\" width=\"600\" height=\"400\" \/><\/a> Protestors flood Market Street as the sun sets and the rain continues to fall. A small group holds up matching \"defend dignity\" posters. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">According to dos Santos, this demonstration is not just a release of anger but a necessary way to participate in democracy. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It [the demonstration's purpose] is to come to the streets, to say here we are, [to] listen,” dos Santos said \"<\/span>What we do know is that he can bring a lot of damage to the country and we need to think about how to oppose things, He can do a lot of damage to the social movements and to democracy.”\r\n\r\n<span style=\"font-weight: 400;\">The democratic process is not solely reserved to voting.<a href=\"https:\/\/www.aclu.org\/issues\/free-speech\/rights-protesters\"> The First Amendment <\/a>enables us the constitutional right to peacefully protest against things we feel are unjust and unfair.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Peaceful protest, according to dos Santos, gives personal stories and faces to the people Trump’s presidency will ultimately affect, and the visibility of these people on a global scale can have a large impact on how the government and a people view a situation.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Protest serves to dissolve isolationism, liberating people through a communal sense of “moral indignation,” according to Yale professor Susan Stokes in her research paper <\/span><i><span style=\"font-weight: 400;\">“<\/span><\/i><span style=\"font-weight: 400;\">Why Do People Join Backlash Protests?<\/span><i><span style=\"font-weight: 400;\">” <\/span><\/i><span style=\"font-weight: 400;\">In other words, instead of coming from an individualist mindset, protest rises from a common sense of moral injustice. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The one thing that we expect at least is that conservative governments can bring progressive people together,” dos Santos said.  <\/span>\r\n\r\n[caption id=\"attachment_128540\" align=\"aligncenter\" width=\"650\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/wethepeople.jpg\"><img class=\"wp-image-128540\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/wethepeople.jpg\" alt=\"wethepeople\" width=\"650\" height=\"433\" \/><\/a> A man holds a homemade Shepard Fairey designed poster reading \"we the people are greater than fear\" high above the crowd. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">To those who look down on peaceful protest as an ineffective tactic that won't amount to anything, dos Santos said people should remember that such rhetoric is exactly the kind of thinking that pulls us apart.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> “That is going to be Trump's type of talk,” dos Santos said. “He knows that the visibility of these demonstrations is very powerful. He has to know that he will not be free to do what he wants to do. He has to know that people are going to be watching him, opposing him, and stop him from going backward on what we have achieved so far.”<\/span>\r\n\r\n<span style=\"font-size: 18pt; color: #ff99cc;\"><b>Moving Forward<\/b><\/span>\r\n\r\n[caption id=\"attachment_128547\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/night.jpg\"><img class=\"wp-image-128547\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/night.jpg\" alt=\"night\" width=\"600\" height=\"400\" \/><\/a> The protesters take on downtown San Francisco as they march through the rain. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\nThe critical question going forward is whether we can sustain the fight when actual policies are initiated, according to dos Santos.\r\n\r\n“Coming to the streets and protesting is important, but it is not enough with just one demonstration,” dos Santos said. “The challenge now is to keep us mobilized. Mobilization, permanent mobilization can stop him.”\r\n\r\nAfter exceeding their goal of having millions of men and women march for equality the organizers of the Women's March have launched a new campaign. To make sure the movement continues, \"10 actions in 100 days was created,\" outlining a step by step guide to spark change as the presidency continues, according to their <a href=\"https:\/\/www.womensmarch.com\/100\/\">website. <\/a>\r\n\r\nAccording to dos Santos, this next era will be unlike the years of progressive social initiatives that we have been lucky to see happen in the past.\r\n\r\n<span style=\"font-weight: 400;\">”We have to rethink the way Democrats are making progress, and the way we think about politics,\" dos Santos said. \"We need to propose new things.”<\/span>\r\n\r\n&nbsp;","excerpt":"More than 100,000 men and women attended the San Francisco Women's March on January 21st, chanting and singing amidst a downpour of rain, under a multi-colored canopy of umbrellas and vibrant posters.","date":"2017-01-31 14:48:34","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0398.jpg","categories":["Features","Spotlight"],"tags":["Donald Trump","january 21st","march","protest","Pussy March","san fransisco","Trump","women","women's equality","Women's March"]},{"id":128151,"title":"A fight for change: A teacher&#8217;s journey in the Washington women&#8217;s march","permalink":"http:\/\/palyvoice.com\/2017\/01\/31\/a-fight-for-change-a-teachers-journey-in-the-washington-womens-march\/","content":"While she sits in the front of the classroom, Palo Alto High School math teacher Deanna Chute presents material with confidence and passion. These traits would soon come in to play as she shifted her focus from mathematics to women's rights. The day after the inauguration of President Donald J. Trump, Chute was one of thousands of Americans who joined together during a peaceful demonstration outside of Washington D.C.\r\n\r\nFor Chute, her need to speak up became clear the day after the national election, in which Republican Presidential Nominee Donald Trump stunned the nation with his unexpected and controversial victory.\r\n\r\n\"The day after the election I was just physically shaking with the need of doing something, not necessarily knowing what that something was,\" Chute said. \"I was the classic example of someone who had their head in the sand and had no idea this [the outcome of the election] was possible.\"\r\n\r\nLike many other Americans, Chute felt as though the values and identities of too many people were threatened by the incoming presidential administration.\r\n\r\n[caption id=\"attachment_128467\" align=\"alignright\" width=\"311\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Ms.-Chute-Washington.jpg\"><img class=\" wp-image-128467\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Ms.-Chute-Washington.jpg\" alt=\"Palo Alto High School math teacher Deanna Chute celebrates her arrival at the women's march in Washington D.C on the morning of January 21. According to Chute, the event was both awe inspiring and unifying for members of all nationalities, ethnicities, genders, and sexual orientations. &quot;My response was this feeling that everyone was there, and it felt like there wasn't anybody who wasn't represented there,&quot; Chute said. Photo: Laura Bricca \" width=\"311\" height=\"415\" \/><\/a> Palo Alto High School math teacher Deanna Chute celebrates her arrival at the women's march in Washington D.C on the morning of Jan. 21. According to Chute, the event was both awe inspiring and unifying for members of all nationalities, ethnicities, genders and sexual orientations. \"My response was this feeling that everyone was there, and it felt like there wasn't anybody who wasn't represented there,\" Chute said. Photo: Laura Bricca.[\/caption]\r\n\r\n\"Women's rights and gender equality are issues that are very close to me,\" Chute said. \"I am a female in math, so I have certainly had my share of experiences and stories [about gender inequality].\"\r\n\r\nShe needed to take a stand and she needed to do it immediately. For Chute, the best way to do this was by joining a peaceful Women's March, which was held the day after President Trump's inauguration in Washington D.C.\r\n\r\n\"Once I found out about it [the march], I started messaging people about it,\" Chute said. \"I needed to do something, and this was the quickest thing I could throw myself into.\"\r\n\r\nDetermined to join the demonstration in Washington, she began to coordinate a trip with her peers from Paly. Special Education Instructional Supervisor Laura Bricca quickly expressed interest in accompanying Chute. Together, the two of them set off for D.C.\r\n\r\n\"We didn't get there until one in the morning before the march,\" Chute said. \"We were way outside the city, and everybody was converging on Washington.\"\r\n\r\nThe streets were filled with marchers who were all headed towards the demonstration. While moving through the dense crowd, Chute first noticed the obvious diversity of the demonstrators.\r\n\r\n\"It felt like every nationality, every age group, every gender was represented,\" Chute said. \"It was such a powerful, uplifting feeling to think that everyone was in this together.\"\r\n\r\nShe was quickly inspired and moved by the sight of so many different people who were connected by their pride and love for their nation and democracy.\r\n\r\n\"What felt powerful to me was wondering 'have we finally reached a place where all these people understand that oppression against anyone is oppression against everyone?'\" Chute said. \"The humanity of it all was overwhelming.\"\r\n\r\nChute met a wide array of people, with whom she exchanged messages of acceptance, love and understanding.\r\n\r\n\"I don't have to understand these people's life choices, but I do support the right for all people to have a happy life and make those choices,\" Chute said.\r\n\r\nThe group decided to turn some of the president's comments into a symbolic source of unity.\r\n\r\n\"When Trump was commenting on the Inauguration attendance, he said something about the tarps that were covering all of the plants and blaming them for why it looked like there weren't many people [in attendance],\" Chute said. \"Those very same tarps were confiscated by marchers.\"\r\n\r\nThe demonstrators connected the tarps together and wrote the preamble to the constitution across the top. The rest of the tarps stretched for blocks and were covered in the signatures of all who attended the march.\r\n\r\n\"For an hour of the march hundreds of thousands of people were carrying this tarp, and having people watching on the sides sign it,\" Chute said.\r\n\r\n[caption id=\"attachment_128510\" align=\"alignright\" width=\"372\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/We-The-People-Tarp.jpg\"><img class=\" wp-image-128510\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/We-The-People-Tarp.jpg\" alt=\"Caption Caption Caption\" width=\"372\" height=\"279\" \/><\/a> Participants in the march carried tarps covered in the words of the constitution for miles during the march, and they invited spectators to sign it. Photo: Deanna Chute.[\/caption]\r\n\r\nThe experience inspired Chute to continue to be an activist back home and to motivate others to always speak out for their beliefs.\r\n\r\n\"I'm amped in a way that I never thought possible,\" Chute said.  \"I was asleep at the wheel, and now I realize that I need to garner up my inner activist and figure out how to go forward.\"\r\n\r\nChute discovered a network of people who are working to capitalize on the positive energy generated by the march and to continue to promote activism.\r\n\r\n\"I'm looking for guidance from people who know more than me and I'm following their lead,\" Chute said. \"I'm trying to learn as I go.\"\r\n\r\nChute is one of the many of Americans who have been inspired by the recent demonstrations to become figures of positive change in their communities. She looks forward to continuing to make an impact and to fiercely standing up for what she believes in.","excerpt":"The day after the inauguration of President Donald J. Trump, math teacher Deanna Chute was one of thousands of Americans who joined together during a women's march outside of Washington D.C.","date":"2017-01-31 14:47:25","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/We-The-People-Tarp1.jpg","categories":["Features","Spotlight"],"tags":["D.C","Deanna Chute","feature","Ms. Chute","peace march","Politics","rally","Teacher","Washington","Women's March"]},{"id":128813,"title":"Locals protest new Trump Policies at San Francisco International Airport","permalink":"http:\/\/palyvoice.com\/2017\/01\/31\/locals-protest-new-trump-policies-at-san-francisco-international-airport\/","content":"While a typical airport experience for most entails never-ending check-in lines and snail-paced Transportation Security Administration checks, the scene described by Palo Alto High School students at the San Francisco International Airport this past weekend was anything but ordinary. As TSA officers watched from behind glass doors, police donned in riot gear pushed through a crowd of hundreds of Bay Area residents who were protesting President Donald Trump’s Jan. 27 <a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/27\/executive-order-protecting-nation-foreign-terrorist-entry-united-states\" target=\"_blank\">executive order<\/a> to ban<span style=\"font-weight: 400;\"> all travel between the U.S. and seven Muslim-majority countries, including Iran and Syria. D<\/span><span style=\"font-weight: 400;\">espite the <a href=\"https:\/\/www.dhs.gov\/news\/2017\/01\/29\/statement-secretary-john-kelly-entry-lawful-permanent-residents-united-states\" target=\"_blank\">Department of Homeland Security’s ruling<\/a> that such restrictions did not apply to US residents, or “green card holders,” Trump and his advisers said that these lawful residents would be granted entry upon their return on a case-by-case basis.<\/span>\r\n\r\n[caption id=\"attachment_128865\" align=\"alignright\" width=\"331\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-30-at-10.45.34-AM.png\"><img class=\" wp-image-128865\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-30-at-10.45.34-AM.png\" alt=\"Locals gather at SFO in an effort to pressure officials to release five detainees as a result of Trump’s recent travel restrictions. Photo by Harrison Frahn.\" width=\"331\" height=\"255\" \/><\/a> Locals gather at SFO in an effort to pressure officials to release five detainees as a result of Trump’s recent travel restrictions. Photo by Harrison Frahn.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Residents of the seven banned countries were detained in airports across the country, including nearby SFO, which held five detainees as of Sunday afternoon. However, they weren’t alone; backing them up were hundreds of protesters from around the Bay Area. Among the crowd were several students, who told The Paly Voice that they had no plan to leave until those five people walked out of the terminal with them.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">One of the attending Paly students, junior Lia Straight, said she felt compelled to join the protest because she wanted to aid detainees as well as stand up against the current state of US politics. <\/span>\r\n\r\n“I decided to go to the protest today because if I didn't go, if I didn't stand up and fight everyone's rights, who else would?” Straight said. “I'm not a lawyer. I'm not anyone in a position of power, but I can go to this protest and I can help shut down SFO and put pressure on Trump and our government to stop violating people's rights and the Constitution.”\r\n\r\n<span style=\"font-weight: 400;\">One of the other attending students, sophomore Harrison Frahn, recounted learning about the implications of Trump's ban from his fellow protesters.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I talked to several people who were immigrants or refugees, and were allowed to come to the U.S. legally,” Frahn said. “One of them told me that it took him seven whole years to get his green card after he came to the U.S., and he that it took others even longer. This just shows how clueless the Trump administration is, because to get a green card, you already have to go through extremely extensive screening, and now, with the ban, you are not even allowed to enter the country.”<\/span>\r\n\r\n[caption id=\"attachment_128866\" align=\"alignleft\" width=\"309\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/voicesfo2.jpg\"><img class=\" wp-image-128866\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/voicesfo2.jpg\" alt=\"Protesters block escalators in SFO's international terminal. Photo by Lia Straight.\" width=\"309\" height=\"213\" \/><\/a> Protesters block escalators in SFO's international terminal. Photo by Lia Straight.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Despite appearances by riot police, Straight described the general ambiance as peaceful, jubilant and dedicated.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It felt like we were all making history and doing something to actually make a difference, and that really helped the vibe of the protest,” Straight said.<\/span>\r\n\r\n“This wasn't just a little temper tantrum,” Straight said. “It was an organized movement and it felt like it. Restaurants sent us food, people told stories of how Trump's executive order affected them, moms brought their toddlers and set up stations to make signs [and] people supported one another. SFO is a very large airport, but it felt incredibly small with the [tens] of hundreds of protestors screaming and chanting and taking up space, persisting in this fight for people's rights.”\r\n\r\nFrahn echoed Straight's sentiments.\r\n\r\n<span style=\"font-weight: 400;\">“It was very uplifting to see that there are so many people united against hate and discrimination and that so many people are willing to fight for the rights of others,\" Frahn said. \"We were all there to show the Trump administration that the American people will stand up for the rights of all people, to show that not all Americans support the kind of discriminatory policies that the Trump administration is putting in place and that we will fight to make sure that nobody is treated unfairly or discriminated against based on their beliefs.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After a weekend of full of marching, chanting and pure determination, protesters received word that the five detainees had been released at around 7 p.m. Sunday evening. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It felt like we were all making history,” Straight said. “We surrounded the entire international terminal of SFO with a thick band of protestors, marching and chanting. We shut down Terminal G, we stood our ground in the face of police, and we made a difference.”<\/span>\r\n\r\nClick through the slideshow below to see the photos Straight and Frahn took at the protest.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/17xQRI0XUJ4fOyeI0HGywom-dez77SI2hCuW9acZ17iw\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"700\" height=\"495\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"While a chaotic airport experience for most entails never-ending check-in lines and snail-paced Transportation Security Administration checks, the scene at San Francisco International Airport this past weekend brought about an entirely new meaning to the phrase.","date":"2017-01-31 09:33:58","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-30-at-10.45.34-AM.png","categories":["News","Spotlight","Uncategorized"],"tags":["airport","DHS","protest","security","sfo","travel","Trump"]}]