[{"id":128158,"title":"Proposed calendar changes prompt delays","permalink":"http:\/\/palyvoice.com\/2017\/01\/21\/proposed-calendar-changes-prompt-delays\/","content":"<span style=\"font-weight: 400;\">Palo Alto Unified School District students and staff are currently unable to solidify their mid-year vacation plans for the 2017-18 school year due to delays caused by unforeseen adjustments to next school year's calendar. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to PAUSD Superintendent of Human Resources Scott Bowers, the calendar, which is determined at the district level, is behind schedule, as many proposed schedule changes are slowing down the committee's process. The school year start and end dates, as well as various local holidays, have not yet been finalized.<\/span>\r\n\r\n\"We fully expect the student start dates for 2017-2018 to be similar to 2016-2017 (that is, Monday 8\/14\/17 for HS and Tuesday, 8\/15\/17 for K-8),\" the PAUSD <a href=\"https:\/\/www.pausd.org\/teaching-learning\/school-year-calendars\">website reads<\/a>.\r\n\r\n<span style=\"font-weight: 400;\">The calendar committee consists of teachers and administration who gather to discuss potential calendar schedules and submit a recommendation to the Board of Education. Typically, the committee discusses the calendar schedule in three-year increments, then presents the proposal to the board.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The committee's recommendation usually goes back to the bargaining teams for review and final agreement before it is presented to the board,” Bowers said. “The committee has done its work and now the negotiating teams are talking about the proposals.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Bowers, the calendar will be finalized at the upcoming school board meeting.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the calendar will be confirmed later than usual, students are unable to plan their vacations for next school year without the possibility of missing school.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“For people who take vacations and especially for people who are trying to plan their summers now, it’s hard because you don’t know when you are going to be back and whether you need to miss school,” junior Sarah Brodbeck said. “I don’t think I’ll necessarily be affected, but I know friends that definitely would be if they didn’t know what days they had to be at school.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly staff are also experiencing issues in planning their yearly schedules.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It is a little frustrating to not know what is going to happen next year this late in the school year,” librarian Rachel Kellerman said. “I hope they [the committee] are taking the input from past calendars to put together a really good calendar. I’m hoping the product will be worth the wait.\"<\/span>","excerpt":"Palo Alto Unified School District students and staff are currently unable to solidify their mid-year vacation plans for the 2017-18 school year due to delays caused by unforeseen adjustments to next school year's calendar. ","date":"2017-01-21 22:44:00","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screenshot-2017-01-20-at-10.50.58-PM.png","categories":["News","Spotlight"],"tags":["calendar","Committee","delay","palo alto","PAUSD","schedule"]},{"id":128120,"title":"Game Preview: Boys&#8217; basketball set to continue rampage in league play","permalink":"http:\/\/palyvoice.com\/2017\/01\/19\/game-preview-boys-basketball-set-to-continue-rampage-in-league-play\/","content":"Last year's first-round Central Coast Section (CCS) playoff  loss to the Cupertino High School Pioneers (11-6, 3-2) will be fresh in the mind of the Palo Alto High School (12-2, 4-0) boys' basketball squad when the Vikings have a chance to avenge their season-ending loss to the Pioneers at 7:45 p.m. on Friday at Gunn High School.\r\n\r\nAccording to head coach Peter Diepenbrock, the image of the Pioneers celebrating on the court last year has fueled the Vikings' anticipation for the rematch.\r\n\r\n\"It seems like the guys are very excited to play Cupertino after such a tough loss last season,\" Diepenbrock said. \"They know it's going to be a great challenge because Cupertino is so well coached and has some very good players.\"\r\n\r\n[caption id=\"attachment_127882\" align=\"alignright\" width=\"441\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_4927-1.jpg\"><img class=\" wp-image-127882\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_4927-1.jpg\" alt=\"Junior forward Max Dorward drives past a Los Altos High School defender. Dorward has carried the Vikings to a strong, 4-0 start, in De Anza League play. Photo: Benner Mullin. \" width=\"441\" height=\"394\" \/><\/a> Junior forward Max Dorward drives past a Los Altos High School defender. Dorward has carried the Vikings to a strong, 4-0 start, in De Anza League play. Photo: Benner Mullin.[\/caption]\r\n\r\nThe Vikings fell in a close battle to the Pioneers last February, 54-50, but Diepenbrock believes Paly have the necessary talent on its roster to take home a victory Friday evening.\r\n\r\n\"I think this year's [Paly] team is a much more experienced team and much more composed team,\" Diepenbrock said.\r\n\r\nJunior forward and one of Paly's leading scorers, Max Dorward, said the team has been preparing for Cupertino's specific defensive style.\r\n\r\n\"We've been working on our ball security to cut down on turnovers,\" Dorward said. \"Especially our passing because Cupertino plays [a zone defense].\"\r\n\r\nA balanced and deep roster has proved to be one of the characteristics that has made the team so successful this year. Contributions from players off the bench have been instrumental in the teams' results on the court.\r\n\r\nAccording to junior point guard Will Schmutz, who has served as a viable backup for senior starting point guard Miles Tention, one of the keys to the game for the Vikings will be controlling the tempo.\r\n\r\n\"We hope that our press can speed them up because they like to play slow,\" Schmutz said. \"We hope to take them out of rhythm.\"\r\n\r\nPaly has dominated in league play thus far, winning all its league games by 13 or more points, and hopes Friday's matchup will be no different.\r\n\r\nThe Vikings will round out the first half of league play next week against the Los Gatos Wildcats (11-5, 1-3) on Tuesday, January 24th.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Last year's first-round Central Coast Section (CCS) playoff  loss to the Cupertino High School Pioneers (11-6, 3-2) will be fresh in the mind of the Palo Alto High School (12-2, 4-0) boys' basketball squad when the Vikings have a chance to avenge their season-ending loss to the Pioneers at 7:45 p.m. on Friday at Gunn High School.\r\n\r\n","date":"2017-01-19 23:27:48","author":"Benner Mullin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/paul-bruh.jpg","categories":["Basketball","Sports","Uncategorized"],"tags":["basketball","CCS","cupertino","diepenbrock","dorward","max dorward","Peter Diepenbrock","pioneers","vikings","will schmutz"]},{"id":128196,"title":"Girls&#8217; soccer plays out an unexpected tie against Los Gatos","permalink":"http:\/\/palyvoice.com\/2017\/01\/19\/girls-soccer-plays-out-an-unexpected-tie-against-los-gatos\/","content":"[caption id=\"attachment_128198\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8862.jpg\"><img class=\"wp-image-128198 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8862.jpg\" alt=\"Freshman Chloe Japić narrowly avoids a Los Gatos player's attack. Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Freshman midfielder Chloe Japić narrowly avoids a Los Gatos High School (8-3-1, 2-1-1) player's attack during the second half of the match on Thursday. Japić sat out part of the first half of the game due to a temporary head injury, according to head coach Kurt Devlin. Photo: Emma van der Veen.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">With seconds left on the clock, Palo Alto High School girls' soccer team member senior defender Talia Malchin attempted one last desperate shot on goal off of a corner kick in an effort to break the tie with the Los Gatos Wildcats (8-3-1, 2-1-1), but the ball hit the crossbar of the goal.<\/span><b> <\/b>Despite high pressure from the Paly team's (8-0-3, 2-0-3) offense, the team was unable to capitalize on key moments in its scoreless draw, 0-0, against the Wildcats on Thursday at Paly.\r\n\r\nPaly remains undefeated in its De Anza league and overall season, a notable feat for the Vikings, but tonight's performance did not showcase a composed, dominant team.\r\n\r\n<span style=\"font-weight: 400;\">The Vikings and the Wildcats fought for possession of the ball throughout the game. Paly players continued to pressure the Los Gatos offense with notable efforts from senior defenders Malchin and Lauola Amanoni and junior midfielder Emily Tomz.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In the second half, Paly had several shots on goal, with a few that even hit the crossbar. With ten minutes left in the game, a shot on goal by Paly fell into the hands of the Wildcats’ goalkeeper. Two close shots by Malchin and freshman midfielder Chloe Japić followed right behind.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">With victories against Los Gatos in recent years, tying the Wildcats was not a favorable outcome, according to senior captain and midfielder Natalie Maloney.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We were definitely expecting to win this one [game], especially with all of the shots that we had,” Maloney said. “I’m actually surprised that none of them went in, but Talia is cursed by the crossbar now.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Maloney, the Vikings need to focus on getting shots on frame and capitalizing on scoring opportunities. Settling the ball down, connecting to one another on the field and simply putting balls in the net are essential to the Vikings’ success in coming games. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have hit the crossbar and shot it [the ball] wide way too many times,” Maloney said. “We get really frantic when we don’t score in the first half because it doesn’t feel like we have a ton of time. We really need to calm the game down.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According head coach Kurt Devlin, the team’s performance was “lackluster.”<\/span>\r\n\r\n“It hurts because we weren’t able to score, and we had so many chances,” Devlin said. “That definitely would have changed the complexion of the match.”\r\n\r\nAccording to Devlin, Malchin and Japić were sidelined for the latter part of the first half after suffering from a cramp and a “blow to the head,” respectively. Both players returned to the game in the second half.\r\n\r\n<span style=\"font-weight: 400;\">Up next, the Vikings are set to take on Fremont High School (5-6-2, 0-4-0) at 3:30 p.m. next Tuesday in Fremont.<\/span>","excerpt":"With seconds left on the clock, Palo Alto High School girls' soccer team member senior defender Talia Malchin attempted one last desperate shot on goal off of a corner kick in an effort to break the tie with the Los Gatos Wildcats (8-3-1, 2-1-1), but the ball hit the crossbar of the goal. Despite high pressure from the Paly team's (8-0-3, 2-0-3) offense, the team was unable to capitalize on key moments in its scoreless draw, 0-0, against the Wildcats on Thursday at Paly.","date":"2017-01-19 22:13:41","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8606.jpg","categories":["Sports"],"tags":["devlin","girls soccer","japic","kurt","los gatos","malchin","maloney","palo alto high school","palo alto high school girls soccer","Soccer","sports","tomz","vikings"]},{"id":128173,"title":"Girls&#8217; basketball to face Homestead for the first time in recent history","permalink":"http:\/\/palyvoice.com\/2017\/01\/19\/girls-basketball-to-face-homestead-for-the-first-time-in-recent-history\/","content":"<span style=\"font-weight: 400;\">For the first time in recent history Palo Alto High School girls' basketball (11-3, 4-0) will be taking on the Homestead High School Mustangs (8-7, 1-3) — a recently added De Anza League contender — at 6:15 p.m. tomorrow at Gunn High School.<\/span>\r\n\r\nWith an impressive De Anza league start, the Vikings are currently ranked first in leagues and are well-positioned to make it deep into the Central Coast Section Playoffs and California Interscholastic Federation state playoffs.\r\n\r\nThe Vikings have only dropped three non-league games throughout their current season, all to high-ranked schools like St. Mary’s High School (11-3, 0-0) out of Stockton, California who are currently ranked fifth in the state, and 13th in the nation. Along with this loss, Paly lost nail-biting games to Pinewood High School (13-2, 2-0) and Castro Valley High School (13-3, 3-0), by two points and five points, respectively.\r\n\r\nRigorous games like these have prepared the Vikings for upcoming league matchups, according to senior forward Skylar Burris.\r\n\r\n\"Playing against teams that are as good as Saint Mary's and Pinewood forces us to recognize how hard we have to work to get to that level,\" Burris said. \"We can't drop to the level of the competition, and by playing against great teams it forces us to play great as well, setting a standard for even our least competitive game.\"\r\n\r\nHomestead is new to the De Anza League this year, as the team moved up from the El Camino League after demolishing their competition with a 12-0 league record last season. The Mustangs replaced the Los Altos High School Eagles (6-9, 2-2), who went 2-10 in the De Anza League last year.\r\n\r\nThe Viking offense will again be led by Burris and junior guard Carly Leong, who have made a name for themselves by consistently draining shots from beyond the arc. According to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/palo-alto-vikings-(palo-alto,ca)\/girls-basketball\/home.htm\" target=\"_blank\">maxpreps<\/a>, Paly ranks 4th in California and 28th nationally for most 3-point shots made.\r\n\r\nAccording to Leong, one of the keys to the game for Paly is controlling the tempo and staying disciplined.\r\n\r\n“We cannot play down to their level, because if we do they would have a good chance of winning,” Leong said. “We just have to play our game and keep shooting and shoot transition shots even if we are up by a lot, and focus on defense.”\r\n\r\nHomestead is coming off a, 58-56 league win against Gunn High School (9-8, 3-2) whom the Vikings beat with a score of 72-63 on Jan. 6.\r\n\r\nFollowing the game against the Mustangs, Paly will have seven more league games before heading into the playoffs.","excerpt":"For the first time in recent history Palo Alto High School girls' basketball (11-3, 4-0) will be taking on the Homestead High School Mustangs (8-7, 1-3) — a recently added De Anza League contender — at 6:15 p.m. tomorrow at Gunn High School.\r\n\r\n","date":"2017-01-19 22:12:48","author":"Isabella Marcus","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_00321.jpg","categories":["Sports"],"tags":["basketball","carly leong","girls basketball","homestead","paly","skylar burris","vikings"]},{"id":128122,"title":"Students and staff to face off in winter rally","permalink":"http:\/\/palyvoice.com\/2017\/01\/19\/students-and-staff-to-face-off-in-winter-rally\/","content":"[caption id=\"attachment_114584\" align=\"alignnone\" width=\"614\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed.jpg\"><img class=\"wp-image-114584 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed.jpg\" alt=\"unnamed\" width=\"614\" height=\"287\" \/><\/a> Participants in last year's rally line up for a photo. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Students will be looking for revenge in the winter rally next Thursday after losing to the teachers in last year's student vs. staff soccer game.<\/span>\r\n\r\nDue to gym construction, Associate Student Body will once again host the rally on the football field and will include a student vs. staff soccer game in lieu of the traditional basketball game. <span style=\"font-weight: 400;\">The 40-minute rally is scheduled for 9:50 a.m. and will be followed by a 10-minute break before 4th period classes begin. Because of this alternate schedule, there will be no Advisory on the day of the rally and school will end at 2:25 p.m.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“For the student vs. staff, it’s for seniors only, just to guarantee they have a spot since it’s their last year and it’s kind of been a tradition,” said Senior Class Vice President Natalie Maloney.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Seniors can sign up <a href=\"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLSeoMJRjniA0aooEjHGp-n4y9nqU80zUgZHHn1cP-dG4BIFWvA\/viewform?c=0&amp;w=1\" target=\"_blank\">online<\/a> until midnight tomorrow. According to Maloney, ASB will take gender into account when selecting players and coaches for the soccer game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The players are selected based on a gender ratio, for example if the ratio of sign ups is two:one boys to girls then for every two boys selected, one girl will be selected,” Maloney said. “The selections are random. On the survey there was also an option for ‘other’ under gender; we haven’t gotten any responses for that but if we do, we will alter our selection method.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While varsity soccer players cannot actually play in the game, they may sign up to be a coach. Senior varsity soccer captain Derek Schoenberger hopes to be selected to coach the student soccer team. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I've always wanted to be a part of the soccer rally ever since we could no longer do the basketball rally as a result of the gym being under construction,” Schoenberger said. “The rivalry between students and staff has always been exciting and I really want to have a more significant role in helping the students defeat the Paly staff.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition, this year’s Prom location will be revealed at the event. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’m looking forward to the prom location and people’s reactions, because the venue is going to be sweet,” Maloney said.<\/span>","excerpt":"Students will be looking for revenge in the winter rally next Thursday after losing to the teachers in last year's student vs. staff soccer game.","date":"2017-01-19 15:43:57","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16145278_595442037309420_241543337_o.jpg","categories":["News","Spotlight"],"tags":["ASB","prom","Soccer","Staff","student","winter rally"]},{"id":128088,"title":"Slideshow: Girls&#8217; soccer pulls off hard-fought win","permalink":"http:\/\/palyvoice.com\/2017\/01\/17\/slideshow-girls-soccer-pulls-off-hard-fought-win\/","content":"The Palo Alto High School girls' soccer team (8-0-1, 2-0-1) continues its undefeated streak winning 2-0 versus Homestead High School (7-3-2, 1-2) despite a weak showing.\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1sZuAYQEZFVPlILDo9-11IMBSAtsTSrH6ig7pyUp-lu0\/embed?start=true&amp;loop=true&amp;delayms=3000\" width=\"700\" height=\"550\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School girls soccer team (8-0-1, 2-0-1) continues its undefeated streak winning 2-0 versus Homestead High School (7-3-2, 1-2) despite a weak showing.","date":"2017-01-17 19:44:35","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8245.jpg","categories":["Sports","Spotlight"],"tags":["girls","homestead","Soccer","undefeated","win"]},{"id":128105,"title":"Girls&#8217; soccer optimistic to keep winning streak alive against Santa Clara","permalink":"http:\/\/palyvoice.com\/2017\/01\/17\/girls-soccer-optimistic-to-keep-winning-streak-alive-against-santa-clara\/","content":"[caption id=\"attachment_128107\" align=\"aligncenter\" width=\"652\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8217.jpg\"><img class=\" wp-image-128107\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8217.jpg\" alt=\"Sophomore Leena Srinivasan passes the ball in the second half. Srinivasan was dominant in the midfield tracking down loose balls and blocking the passing lanes. Photo by Ethan Kao.\" width=\"652\" height=\"481\" \/><\/a> Sophomore Leena Srinivasan passes the ball in the second half. Srinivasan was dominant in the midfield tracking down loose balls and blocking the passing lanes. Photo by Ethan Kao.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Aside from one tie, the Palo Alto girls’ soccer team (8-0-1, 2-0-1) is on a blazing path of victories this season. The Vikings aim to further their hot streak when they face the Santa Clara High School Bruins (5-1-2, 2-0) at 6 p.m. tonight at the Bruins’ homefield. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Bruins are one of the more skilled teams the Vikings play during the regular season, according to senior defender Lauola Amanoni. To secure a win in the upcoming game, the Vikings have prepared during practice by working on their weaknesses: defense and ball movement.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Santa Clara is a pretty good team so this game will surely be a competitive one especially since it's a Santa Clara home game,” Amanoni said. “Since we struggled last game with a couple of defensive style plays, we worked on that. We were able to practice yesterday to fix passes and find more productive ways to get the ball forward.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After a hard fought loss versus Homestead High School last Thursday, senior forward Tess Preising stresses the importance of practicing the little things.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We need to make the simple plays,” Preising said. “Last game [versus Homestead] we were sloppy with our possessions and were constantly dribbling into trouble. If we make the simple passes and plays, we would be in a better position to score.”<\/span>\r\n\r\nThe Vikings are also conscious of their undefeated streak, and hope to extend the clean record, according to Preising.\r\n\r\n\"I am looking forward to keeping our undefeated streak and obviously scoring a lot of goals this game, but scoring them creatively,\" Preising said. \"Maybe by implementing the plays we've been working on in practice or getting some off a good counter attack.\"\r\n\r\n<span style=\"font-weight: 400;\">Amanoni expressed a mild concern for the game against Santa Clara regarding its under groomed soccer field.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Santa Clara has poor playing field conditions that over the years made it difficult to get good results,” Amanoni said. “Playing every team, we notice that we can never look at a game as an easy win; it ends up making us always play our worst. However, Santa Clara will for sure be a good match.”<\/span>\r\n\r\nPreising revealed a similar view on preparing for the game.\r\n\r\n\"I think this game will be neither easy nor hard, since we've done well against Santa Clara before but I don't think we should have any expectations of what the game could be like,\" Preising said. \"It's a new year and they (Bruins) have new players, we have new players, so it really all comes down to whether we will show a good performance on the field or not today.\"","excerpt":"Aside from one tie, the Palo Alto girls’ soccer team (8-0-1, 2-0-1) is on a blazing path of victories this season. The Vikings aim to further their hot streak when they face the Santa Clara High School Bruins (5-1-2, 2-0) at 6 p.m. tomorrow at the Bruins’ homefield.","date":"2017-01-17 15:01:51","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8217.jpg","categories":["Sports","Spotlight"],"tags":["bruins","girls","Lauola Amonani","paly","passing","santa clara","season","Soccer","Tess Preising","vikings","winning"]},{"id":128073,"title":"Paly library to close this summer for renovations","permalink":"http:\/\/palyvoice.com\/2017\/01\/17\/paly-library-to-close-this-summer-for-renovations\/","content":"[caption id=\"attachment_128085\" align=\"alignright\" width=\"374\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/library.jpg\"><img class=\" wp-image-128085\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/library.jpg\" alt=\"Paly plans to add a new computer lab, collaboration rooms, and more in the new library shown in the layout above. Construction will begin during the summer. Photo: Jevan Yu. \" width=\"374\" height=\"374\" \/><\/a> Among the changes to the library is the elimination of the pass-through walkway from the Quad to the 800s building. Instead, the new guidance offices will occupy this space. Drawing: DLM Architects.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School students will enjoy access to yet another state-of-the-art facility in two years, as the highly-anticipated library renovation project is scheduled to commence this summer, according to librarian Rachel Kellerman.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Kellerman said the “best case scenario” is that the library will be completed by the 2018-2019 winter.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The new library will feature a task-lit silent study room, which will facilitate focused work, and a makerspace, a \"flexible\" room that may include 3-D printers, according to Kellerman. <a href=\"http:\/\/palyvoice.com\/2015\/09\/08\/school-seeks-to-pilot-new-technology-policy\/\">Since all students will have Google Chromebooks<\/a> by the time the project will be complete, the computer lab area will be smaller than before. There will also be an enclosed instructional area, designated collaboration rooms for small groups and a staff operation room, among other additions. The south end of the building will house the guidance offices as well as the College and Career Center, according to Kellerman.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">New furniture, such as updated high counter seating areas and book displays made to look similar to those at bookstores, will also be installed.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“What we endeavor to do is think about how students work and how we can accommodate them,” Kellerman said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Kellerman, the construction crew will demolish the inside of the library during the renovation process and the provisional library will reside in the Student Center, with the adjacent portables (P3 and P5) serving as temporary storage rooms for books.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’s not ideal, but this way we’ll keep our books safe and secure,” Kellerman said.<\/span>\r\n\r\nThe relocations of other rooms affected by the project are still tentative, according to Assistant Principal Jerry Berkson. As of now, the teacher copy room and ARC will move to the 400s building, the computer lab and ASB to the portables, and the English and World Languages teacher offices to the 300s building, he said.\r\n\r\n<span style=\"font-weight: 400;\">In the meantime, the library staff will encourage students to use the digital library resources, and Kellerman will also be visiting classes for instructional lessons.<\/span>\r\n\r\nAccording to Kellerman, the Strong Schools Bond Initiative – a privately-funded organization that has financed all of Paly's latest renovations except for the gym – will provide the money for the library project. Kellerman, however, doesn't know the cost at the moment, as the project has not yet been bid.\r\n\r\n<span style=\"font-weight: 400;\">Sophomore Nisha McNealis is a frequent user of the library and, although disappointed about the timing, is looking forward to eventually gaining access to the new facility.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Even though I'd obviously rather have it done earlier, I think that the new improvements are important enough that I'm okay with waiting for a while and only having access to the complete library for a semester,” McNealis said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Some of the new features are going to be especially practical, she said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The collaboration rooms will be really useful since I'm in debate and my teammates and I sometimes have practice rounds in the library,\" McNealis said. \"But it's really loud and hard to focus with everyone else in the library.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Kellerman, too, is thrilled about the renovation project.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It’ll definitely be a sacrifice for all, but it’s so worth it,” Kellerman said. “It’s going to be really awesome and we’re really excited about it.”<\/span>","excerpt":"Palo Alto High School students will enjoy access to yet another state-of-the-art facility in two years, as the highly-anticipated library renovation project is scheduled to commence this summer, according to librarian Rachel Kellerman.","date":"2017-01-17 09:42:47","author":"Jevan Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/0000\/00\/library.jpg","categories":["News","Spotlight"],"tags":["Berkson","construction","Kellerman","Library","renovation"]},{"id":128068,"title":"Thursday, Jan. 19 is the last day to add a class","permalink":"http:\/\/palyvoice.com\/2017\/01\/17\/thursday-jan-19-is-the-last-day-to-add-a-class\/","content":"","excerpt":"","date":"2017-01-17 08:51:27","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":127819,"title":"ASB premieres Throwback Dance","permalink":"http:\/\/palyvoice.com\/2017\/01\/16\/asb-premieres-throwback-dance\/","content":"<span style=\"font-weight: 400;\">Students will soon gather to hear the songs of their middle school days such as Beyoncé’s “Halo” and Taio Cruz’s “Dynamite” at the second Palo Alto High School dance of the 2016-17 school year. Associated Student Body is putting on a “throwback”-themed dance from 7 to 10 p.m. on Friday, Feb. 24 at the Mitchell Park Community Center.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to <\/span>Social Commissioner senior Isabel Black, the “throwback” theme will be focused on middle school music and trends.\r\n\r\n<span style=\"font-weight: 400;\">“We [ASB officers] decided it would be super fun to throw it back to our middle school days,” Black said. “We got the idea for a throwback dance when we were reminiscing on middle school dances and how good the music was.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Students should dress as they might have in middle school, according to Black.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Dress is casual, so feel free to bring out your Abercrombie and silly bands,” Black said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> Sophomore Vivian Feng says the throwback dance is appealing for underclassmen.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It's a great idea to have another dance,” Feng said. “Since homecoming was with Gunn [High School] and the only other dance is prom, I really support and appreciate that ASB decided to plan another dance. I think that it'll be particularly popular among underclassmen since we can't attend prom.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Christian Rider hopes to bring back his middle school dance moves in February at the throwback dance.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"I remember back at the JLS [Jane Lathrop Stanford Middle School] dances I use to cut a little rug because of the great song selection, so I'll be happy to be able to do that again,” Rider said.<\/span>\r\n\r\nStudents can request any song they would like played at the dance here: <a href=\"https:\/\/docs.google.com\/a\/pausd.us\/forms\/d\/e\/1FAIpQLSelN5wcHHmAHsYfPbk7lCWzx15TCMhMsevdmv6hQByJIfZZTA\/viewform\">https:\/\/docs.google.com\/a\/pausd.us\/forms\/d\/e\/1FAIpQLSelN5wcHHmAHsYfPbk7lCWzx15TCMhMsevdmv6hQByJIfZZTA\/viewform<\/a>.","excerpt":"Students will soon gather to hear the songs of their middle school days such as Béyonce’s “Halo” and Taio Cruz’s “Dynamite” at the second Palo Alto High School dance of the school year. Paly Associated Student Body is putting on a “throwback”-themed dance from 7 to 10 p.m. on Friday, February 24th at the Mitchell Park Community Center.","date":"2017-01-16 15:07:46","author":"Soumya Jhaveri","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-16-at-2.56.04-PM.jpg","categories":["News","Spotlight"],"tags":["ASB","christian rider","dance","Isabel Black","jls","palo alto high school","paly","prom","Throwback","throwbackdance","vivian feng"]}]