[{"id":128922,"title":"Student groups vie for PAC accessibility","permalink":"http:\/\/palyvoice.com\/2017\/02\/07\/student-groups-vie-for-pac-accessibility\/","content":"[caption id=\"attachment_129354\" align=\"alignnone\" width=\"678\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_31222.jpg\"><img class=\"wp-image-129354\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_31222.jpg\" alt=\"performing arts center\" width=\"678\" height=\"509\" \/><\/a> The Performing Arts Center towers as one of Palo Alto High School's newest additions. Photo: Adrienne Kwok.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The newly-built Performing Arts Center is Palo Alto High School’s newest landmark. With a grand total of 25,100 square feet that boasts a motorized orchestra pit and 582 seats, the PAC is a display of grandeur on Paly’s campus. However, as of now, the PAC remains a closed-off resource that many Paly students find difficult to utilize.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Since its <a href=\"http:\/\/palyvoice.com\/2016\/10\/04\/performing-arts-center-formally-introduced\/\">grand opening<\/a> in October 2016, the PAC has held theater, choir, band and orchestra performances. However, one group that has found difficulty in reserving the PAC is Paly's very own Team 8 Robotics group. With approximately 83 students, Paly Robotics is one of the largest student organizations found on campus.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Clubs at Paly have the option to rent out spaces such as the Media Arts Center to use for events. The<\/span><span style=\"font-weight: 400;\"> robotics team recently intended to use the PAC for their kickoff day, to mark the beginning of their 6-week “build season” during which team members build a robot for competition, and also for their awards night, according to Head Coach Christopher Kuszmaul.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The PAC is an extremely valuable educational resource,” Kuszmaul said. “It is my duty to make use of educational resources that are at my disposal. The PAC very much has my attention because I feel an obligation to the taxpayers who pay for this resource and if I don’t use it, I am neglecting my duty.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Robotics students, including senior project manager Jonathan Zwiebel, expressed similar concern.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The issue isn’t that they charge money, the issue is that most students have never been in the PAC, ever,” Zwiebel said. “Most students aren’t ever allowed to go into the PAC. You shouldn’t spend money on a building then not use it because you don’t want it to get dirty. It should be like the MAC or the MRC [Math Resource Center] or the library where there are just people in there because it’s an open space.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Assistant Principal of Operations Jerry Berkson, the PAC’s schedule is packed with events, partly due to Gunn High School’s Spangenberg Theater which is currently undergoing renovation.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“[The PAC] is booked a lot because right now we are sharing because Gunn’s theater is under renovation,” Berkson said. “We will eventually rent it out to outside parties. We’re not going to do that for at least the first year, and probably beyond that. … We've got two plays from us per year, two plays per year for Gunn, all the choir events [and] all the instrumentals. There's so much going on that there is not a lot of space.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Robotics is not alone in its struggle to utilize Paly’s resources. During the winter season, Paly’s wrestling team requested to use the PAC.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">We wanted to use the PAC because we currently don't have a gym to use for our dual meets,” said wrestling coach Ryan Kessler. “Our home competitions are all at Gunn High School. When I told my team it was a possibility we would be wrestling in there, they were pretty fired up. I mostly feel bad for our seniors Seth Goyal and Sara Aguilar who will miss out on the new gym that's being built. It would have been nice to send them off with a home match at Paly.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">There are four different categories used to determine the charges for renting a Palo Alto Unified School District facility. District and school-sponsored clubs and groups are allowed to rent all district facilities, with the exception of pools, at no charge. Departments of local governments, community organizations with 501c3 (nonprofit) status, and government agencies that are not charging fees are all required to pay a fee for rental. Businesses and religious organizations must pay a fee higher than that of the aforementioned groups. The charge for camps is per week rather than per hour. <\/span><span style=\"font-weight: 400;\">The rental charge per hour is also dependent on the room or field one wishes to rent, with a greater charge for larger spaces.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">A calendar delineating the PAC, Haymarket Theater and Gunn’s Spangenberg Theater schedules may be found <\/span><a href=\"http:\/\/spangenbergtheatre.org\/productioncalendar.html\"><span style=\"font-weight: 400;\">here<\/span><\/a><span style=\"font-weight: 400;\">.<\/span>\r\n\r\nThe robotics team is looking forward to the PAC being available for more students to use.\r\n\r\n<span style=\"font-weight: 400;\">According to Kuszmaul, “the PAC seems to be like the guest towels that nobody can use because we might make them dirty.”<\/span>","excerpt":"The newly-built Performing Arts Center is Palo Alto High School’s newest landmark. With a grand total of 25,100 square feet that boasts a motorized orchestra pit and 582 seats, the PAC is a display of grandeur on Paly’s campus. However, as of now, the PAC remains a closed-off resource that many Paly students find difficult to utilize.","date":"2017-02-07 11:25:38","author":"Soumya Jhaveri","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_31222.jpg","categories":["News"],"tags":["admin","Berkson","chris","fun","Jerry","jonathan","kessler","kuszmaul","mac","mrc","pac","robotics","ryan","School","wrestling","zwiebel"]},{"id":129226,"title":"Recap: Boys&#8217; basketball clinches league title; suffers tough road loss","permalink":"http:\/\/palyvoice.com\/2017\/02\/06\/recap-boys-basketball-clinches-league-title-suffers-tough-road-loss\/","content":"Saturday night's game is one the Palo Alto Vikings boys' basketball team (18-3, 9-0) is hoping to forget soon. Nothing seemed to go right for the Vikings; shots didn't fall, rebounds just out of reach, and calls didn't go their way.\r\n\r\nPalo Alto suffered its first defeat in over a month, falling to the Menlo-Atherton Bears (17-4, 8-1), 58-46.\r\n\r\nThe loss was especially surprising, after another resounding league victory against the Wilcox Chargers (9-10, 4-4) on Friday night, 73-52, clinching first place in league play in the De Anza League.\r\n\r\nJunior guard Jared Wulbrun thinks that the title can be a stepping stone to success for Paly.\r\n\r\n\"As a team, we set goals for the season and this was our first one,\" Wulbrun said. \"You have to take the season one step at a time and we reached that on Friday night. We can't be satisfied, though. We all know what our other goals are that we want to achieve, so this is just the beginning. There's a lot of work left to do.\"\r\n\r\nThe game started off well for the Vikings, who led by eight points at the end of the first quarter and extended their lead to 12 points just into the second quarter.\r\n\r\nThen, everything began to fall apart for the Vikings. Menlo-Atherton senior guard Eric Norton, who scored a game-high 22 points, led the charge for the Bears and netted seven points in the second quarter. The Bears dominated the latter parts of the second period and the teams headed into halftime knotted at 28-28.\r\n\r\nThe second half started no better than the first half ended. Menlo-Atherton took an early lead and never relented, ultimately outlasting the Vikings.\r\n\r\n[caption id=\"attachment_129227\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_1344.jpg\"><img class=\"wp-image-129227\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_1344.jpg\" alt=\"Junior Bryant Jefferson lines up a free throw against Menlo-Atherton. Photo by Benner Mullin\" width=\"600\" height=\"450\" \/><\/a> Junior Bryant Jefferson lines up for a free throw against Menlo-Atherton. Photo: Benner Mullin[\/caption]\r\n\r\nJunior forward Max Dorward, who scored a team-high 16 points and grabbed five rebounds, believes Palo Alto can take away some important lessons from the tough game atmosphere.\r\n\r\n\"We knew it was gonna be a tough game going to their place but we've been doing it for the past couple years without our home gym,\" Dorward said. \"We just focused on playing our game and not worrying about that too much.\"\r\n\r\nThe loss should provide a wake-up call the Vikings, who hadn't played an opponent of Menlo-Atherton's quality since Dec. 30th, 2016, in a loss to Saint Francis.\r\n\r\nNext week, the Vikings will look to bounce back from their defeat when they trek to Cupertino to play the Cupertino Pioneers (13-8, 5-4) on Friday, Feb. 10 at 7:45 p.m.","excerpt":"Saturday night's game is one the Palo Alto Vikings boys' basketball team (18-3, 9-0) is hoping to forget soon. Nothing seemed to go right for the Vikings; shots didn't fall, rebounds just out of reach, and calls didn't go their way.","date":"2017-02-06 22:56:34","author":"Benner Mullin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_1344.jpg","categories":["Basketball","Sports","Uncategorized"],"tags":["basketball","League title","loss","MA","menlo-atherton","vikings"]},{"id":129241,"title":"Students qualify for FBLA state conference","permalink":"http:\/\/palyvoice.com\/2017\/02\/06\/students-qualify-for-fbla-state-conference\/","content":"<span style=\"font-weight: 400;\">Three members of Palo Alto High School’s Future Business Leaders of America club are preparing for an upcoming state conference after their successes at Saturday’s Bay Section Leadership Conference.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Sophomores Ria Vora, Emily Wang and Leyton Ho <\/span> <span style=\"font-weight: 400;\">qualified for the California State Leadership Conference. Vora and Wang placed fifth as a team in the Entrepreneurship event, while Ho ranked fourth in Introduction to Financial Math.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition, sophomores Caity Berry and Soumya Jhaveri placed sixth in Impromptu and fifth in Public Speaking I, respectively. Wang came in 10th for Intro to Business.<\/span>\r\n\r\n[caption id=\"attachment_129298\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/DSC_1476.jpg\"><img class=\"size-full wp-image-129298\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/DSC_1476.jpg\" alt=\"Left to right: Emily Wang, Ria Vora, Soumya Jhaveri and Leyton Ho pose with their plaques after placing at different conference events. Caity Berry, not pictured, also placed at the conference. Wang, Vora, and Ho will be competing at an upcoming state conference.\" width=\"600\" height=\"400\" \/><\/a> Left to right: Sophomores Emily Wang, Ria Vora, Soumya Jhaveri and Leyton Ho pose with their plaques after placing at different conference events. Sophomore Caity Berry, not pictured, also placed at the conference. Wang, Vora, and Ho will be competing at an upcoming state conference.[\/caption]\r\n\r\n\"It [Impromptu] is a super fun event and I really love thinking on my toes,\" Berry said. \"It's a great skill to have because throughout my life I'm going to be put in a lot of situations where I have to think fast.\"\r\n\r\n<span style=\"font-weight: 400;\">Paly's FBLA began two years ago as part of a nationwide student-run initiative to give high school students an introduction to the field of business through competitive conferences.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">At these conferences, members compete in different events, listen to speakers, network and participate in workshops. The Bay Section Leadership Conference was the first conference held this year, and included high schools in the Bay Area such as Lynbrook, Monta Vista, Cupertino and Homestead. While any member can participate in conferences at the sectional level, participants must qualify for the proceeding conferences. The state level conference will be held April 6-9 in Sacramento, and the national conference will be in Anaheim June 29 - July 2.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior and club co-president Adeline Zhou credits the success of club members to individual dedication, as this is the first year that members of the club have qualified for the state conference.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“During our meetings, we [club officers] handed out study guides and provided lists of resources,” Zhou said. “For the most part, our members are self-driven, and we are there for guidance and logistics.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Looking forward, Zhou is optimistic about the future of FBLA.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We're really looking forward to seeing how we'll progress as a chapter in the upcoming months and years,” Zhou said. “Hopefully, with some hard work and dedication, we'll be able to qualify for Nationals or have more members qualify for States in the next years.”<\/span>","excerpt":"Three members of Palo Alto High School’s Future Business Leaders of America club are looking to prepare for the upcoming state conference after successes at this Saturday’s Bay Section Leadership Conference.\r\n","date":"2017-02-06 19:12:26","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/DSC_1476-1.jpg","categories":["News","Spotlight"],"tags":["business","club","conference","FBLA","state"]},{"id":128964,"title":"Preview:  Boys&#8217; basketball faces tough test on the road","permalink":"http:\/\/palyvoice.com\/2017\/02\/04\/preview-boys-basketball-faces-tough-test-on-the-road\/","content":"<span style=\"font-weight: 400;\">The keys to success in basketball are consistency and showing up ready to play with 100 percent effort each time your team steps on the court. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">This message is one that varsity boys' basketball head coach Peter Diepenbrock has echoed to his team the past few weeks.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our motivation comes from our goal to be the best team we can be,” Diepenbrock said. “So each night we are striving to play our best game of the season and improve in every area.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">On Saturday, the Vikings (17-2, 8-0) head down Middlefield Road to take on the Menlo-Atherton Bears (14-4, 6-1) at 6 p.m. <\/span><span style=\"font-weight: 400;\">The Bears present the toughest opponent for the Vikings since their last loss at the Saint Francis Lancers (15-4, 6-3) on Dec. 30th.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Diepenbrock believes the key to the Vikings’ success on Saturday will depend on their ability to shut down Menlo-Atherton’s star guard, senior Eric Norton. Norton was voted Most Valuable Player of the Peninsula South Basketball League his junior year, and his strong play has continued in this season.<\/span>\r\n\r\n[caption id=\"attachment_129209\" align=\"alignnone\" width=\"601\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/012717-Boys-Varsity-Basketball-vs-Gunn_DH-8758.jpg\"><img class=\"wp-image-129209\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/012717-Boys-Varsity-Basketball-vs-Gunn_DH-8758.jpg\" alt=\"Palo Alto Children's Theatre Outreach, Aladdin, Palo Alto, CA: January 28, 2017\" width=\"601\" height=\"400\" \/><\/a> Junior Jared Wulbrun looks for the open man against rival Gunn. Photo by David Hickey[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Tuesday’s matchup at Los Altos proved to be a bumpy contest for the Vikings, before prevailing, 66-61, in double overtime. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The game should have been over in regulation,” junior forward William Schlemmer said. “We didn’t make our free throws and we didn’t make our possessions count.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Diepenbrock hopes the sloppy game on Tuesday can be a lesson for the team in their upcoming games.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Hopefully the experience of Tuesday night will help us be a better finishing team moving forward,” Diepenbrock said. “We need to rebound for 32 minutes.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings will have to execute and remain composed in a hostile game environment. Diepenbrock believes the game will have an electrifying playoff atmosphere and encourages all Viking faithful to make to trip and support their Vikes.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto also has a league game on Friday night against the Wilcox Chargers (9-9, 4-3), who they trounced in their first meeting, 75-54.<\/span>","excerpt":"On Saturday, the Vikings (17-2, 8-0) head down Middlefield Road to take on the Menlo-Atherton Bears (14-4, 6-1) at 6 p.m. The Bears present the toughest opponent for the Vikings since their last loss versus at the Saint Francis Lancers (15-4, 6-3) on Dec. 30th.","date":"2017-02-04 12:38:08","author":"Benner Mullin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/012717-Boys-Varsity-Basketball-vs-Gunn_DH-8758.jpg","categories":["Basketball","Sports","Uncategorized"],"tags":["bears","eric norton","los altos eagles","menlo-atherton","palo alto","Peter Diepenbrock","vikings","wilcox chargers","william schlemmer"]},{"id":129189,"title":"Due to rain, Club Day has been cancelled and rescheduled for Friday, Feb. 10","permalink":"http:\/\/palyvoice.com\/2017\/02\/03\/due-to-rain-club-day-has-been-cancelled-and-rescheduled-for-friday-feb-10\/","content":"","excerpt":"","date":"2017-02-03 11:34:47","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":128971,"title":"Column: How I survived as a senior in PE","permalink":"http:\/\/palyvoice.com\/2017\/02\/02\/column-how-i-survived-as-a-senior-in-pe\/","content":"[caption id=\"attachment_128997\" align=\"aligncenter\" width=\"516\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_44451.jpg\"><img class=\"wp-image-128997\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_44451.jpg\" alt=\"IMG_4445\" width=\"516\" height=\"387\" \/><\/a> Students complete the warm-up sequence during Physical Education. These students were my sophomore classmates for a semester. Everyone pictured here is \"suited up,\" an unusual occurrence. A few are even smiling. Photo: Emily Hwang.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">“You look a little sweaty,” my friend remarks, to my dismay.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">It’s lunch after third period, and I am glistening with the post-PE shine. Indeed, I had forgotten about this, and about a lot of other aspects of life as a PE student. I’d forgotten the feeling of my polyester PE shorts riding up on my waist as I ran the compulsory two warm-up laps on the track. I’d forgotten the atmosphere of a high school locker room and the dread I’d feel when my PE teacher announced we had a mile run coming up. Along with the things I’d forgotten, there were new strategies to getting through a semester with sophomore classmates that I had yet to learn.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Physical Education at Palo Alto High School is required for four semesters. Typically, students enroll in PE during their freshman and sophomore years. I, however, injured my knee in the second semester of my sophomore year, and decided to fulfill the remainder of my PE requirement first semester of my senior year. According to PE teacher Jacob Halas, there are about two or three seniors per year taking PE, usually due to injury or failure of the class. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">I was one of those seniors, and these are phases of my journey as a student in Halas’ third period PE class.<\/span>\r\n\r\n<b>Phase One: I hate fitness testing, my life is a joke<\/b>\r\n\r\n[caption id=\"attachment_128999\" align=\"alignright\" width=\"339\"]<img class=\"wp-image-128999\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_44601.jpg\" alt=\"IMG_4460\" width=\"339\" height=\"254\" \/> Sophomore PE students perform the push-up test. Unfortunately, the photo does not show the electronic push-up counting contraptions that never fail to elicit grievances from students. Photo: Emily Hwang.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">I had a number of gripes, right off the bat. The temporary locker room situation meant a smaller number of lockers in the locker room and that I couldn’t keep my clothes and shoes there between classes. The gray PE shirt and green shorts combo was an outfit I was not proud (read: humiliated) to don, especially when I ran into fellow seniors on my walk from the locker room to the track. When people asked what my next class would be, my reply of \"PE\" always received a hearty chuckle, a sympathetic \"I'm sorry\" and a question: \"Why?\".<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The first few weeks as a senior in PE consisted of fitness testing, during which each day brought another form of cruelty. There were both the old favorites, like the mile and push-ups, and new inventions of the PE Department such as the Viking and Figure 8 runs. Thankfully, after fitness testing ended I got my fall sport prep.<\/span>\r\n\r\n<b>Phase Two: I have no friends in this class, but do I want to be friends with sophomores anyway? <\/b>\r\n\r\n<span style=\"font-weight: 400;\">The golf team’s failure to advance past the NorCal stage of postseason not only resulted in the end of my high school golf career, it meant that I would have to go back to PE. There was another senior in my class at the beginning of the semester, but soon enough she desperately sought out (and succeeded in finding) an alternative to her PE requirement. I was forced to face the daunting sea of underclassmen on my own.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Honestly, I did very little to be sociable in that class, and so I did more listening to the sophomores than talking.  The worst was when they mentioned college. I was drowning in college applications and these toddlers had the audacity to complain about not knowing which school to apply to early? In fact, it seemed like sophomores moaned and groaned about every single thing we did in that class, especially when they didn’t get their preps as fast as they wanted to. They reeked of immaturity and even worse, reminded me of what my life was like two years ago. Though I must admit, Algebra 2 and Chemistry stressed me out too.<\/span>\r\n\r\nIn addition, I regularly saw them outside of class, painful reminders of my PE life. You know <a href=\"http:\/\/palyvoice.com\/2017\/01\/30\/invasion-of-the-arts-art-in-unusual-places\/\" target=\"_blank\">Arts in Unusual Places<\/a>? It was like that, except replace the art with sophomores, and the unusual part was recognizing underclassmen in unusual places. (Note: my attitude about this has changed. See next phase.)\r\n\r\n<b>Phase Three: Actually, sophomores aren’t that bad I guess<\/b>\r\n\r\n<span style=\"font-weight: 400;\">A few instances of kindness from sophomores stick out in my mind when I think of my time in PE. First, when I returned to class after golf season, a particularly nice sophomore introduced herself to me when she noticed my unfamiliar presence. It felt good to be welcomed with a smile.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">On a separate occasion, as I was kicking around the weird rubber pellets of the lacrosse field turf waiting for the PE teachers to show up, a couple of girls signaled me to approach them. I was confused at first. I glanced around. <\/span><i><span style=\"font-weight: 400;\">Me? Are they gesturing at me?<\/span><\/i><span style=\"font-weight: 400;\"> Seeing as there was no one else in my immediate vicinity, I concluded that there was no other possibility. We started conversing and I revealed my plight to them. In general, I think most of the sophomores had sympathy for me when they realized I was a senior. I was like a poor, misunderstood alien creature trying to navigate a new world and they were the altruistic humans attempting to help me adjust.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Plus, the evasive tactics my classmates used in PE were entertaining. One girl in my class hid in the bathroom almost every time we had to run. Another group of students started walking their warm-up laps before the PE teachers got to the track, so that they would have less distance to run once the teachers did show up. Ingenius.<\/span>\r\n\r\n<b>Phase Four: Hey, PE can be pretty fun and I Am A Champion<\/b>\r\n\r\nIf nothing else, one tangible accomplishment did come out of this: I am proudly a member of the winning team of the 3rd period sophomore PE softball tournament. Yes, I know you’re jealous. The other (losing) sophomores were, because our team got to sit out of an extensive bleacher run the next day. I sat and watched as panting sophomores trudged past me, and I couldn’t help but revel in the sweet, sweet victory.\r\n\r\n[caption id=\"attachment_128998\" align=\"alignleft\" width=\"312\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_4464-12.jpg\"><img class=\"wp-image-128998\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_4464-12.jpg\" alt=\"IMG_4464 (1)\" width=\"312\" height=\"234\" \/><\/a> PE teacher Jacob Halas observes his students playing lacrosse. None of us really got the cradling technique down in such a short period of time. Photo: Emily Hwang.[\/caption]\r\n\r\nOften, we would warm up and then play a sport for the rest of the period, which I found greatly enjoyable. We tackled lacrosse, a sport most of us had never played before. As a whole, our skills were wonderfully, hilariously mediocre. <span style=\"font-weight: 400;\">In a lot of ways, PE made me feel like a kid again. It’s difficult to organize a large group of people with the equipment necessary to play sports and games. In PE, I had the opportunity to do that every other day, which I was surprisingly grateful for.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Over time, I recognized that participating in PE as a senior was not significantly different from being a sophomore in PE. I had a chat with PE teacher Jason Fung about this, and he reflected on the attitude of PE students and the goals of teachers in this unique subject. It’s really just a state of mind, according to Fung. Athletes will come into PE with the mindset of wanting to succeed. I didn't really care about being the best at PE, but I did attempt to be optimistic about it.<\/span>\r\n\r\n<b>Phase Five: Bye, PE! Advice from me to you, underclassmen<\/b>\r\n\r\n<span style=\"font-weight: 400;\">As finals week rolled around, so did my official last week of high school PE. Granted, I hesitate to say that I miss PE, though it did force me to reflect on the growth I've experienced in the past two years of my life. It's incredible how much you can learn in two years, really. So, as a senior and participant in PE for eight-ish weeks, I feel validated in telling underclassmen a few things.<\/span>\r\n\r\n[caption id=\"attachment_129000\" align=\"alignright\" width=\"324\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_44441.jpg\"><img class=\"wp-image-129000\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_44441.jpg\" alt=\"IMG_4444\" width=\"324\" height=\"250\" \/><\/a> PE teacher Jacob Halas flashes a thumbs-up at his students during their warm-up. Fun fact: Halas temporarily lost my prep contract at the start of the semester and I was irate. It's okay, he found it later and never wronged me again. Photo: Emily Hwang.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Dear freshmen and sophomores, please remember that the PE teachers really aren’t trying to torture you. According to Fung, all they want to do is give you the tools to live a healthier life and teach you to value fitness. Those seem like noble goals to me. Yeah, running isn't the best, but think of PE as a much-needed break from your normal schoolwork, a chance to get some fresh air and socialize with your peers. PE isn’t worth having a bad attitude about. You’ll never have any fun if you focus on how much better life would be if you had a prep.<\/span>\r\n\r\nThank you, to the sophomores who showed me compassion and played sports with me, and to my merciful PE teachers. PE wasn't all that bad.","excerpt":"It's not often that seniors have to take PE...","date":"2017-02-02 22:36:39","author":"Emily Hwang","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_44451.jpg","categories":["Opinion","Opinion Editor's Pick","Spotlight"],"tags":["column","experience","fun","halas","learning","misery","pe","senior","Sophomores"]},{"id":129090,"title":"New clubs to spot at second semester Club Day","permalink":"http:\/\/palyvoice.com\/2017\/02\/02\/new-clubs-to-spot-at-second-semester-club-day\/","content":"<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/Screenshot-2017-02-02-at-10.31.49-AM.png\"><img class=\"alignnone size-full wp-image-129134\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/Screenshot-2017-02-02-at-10.31.49-AM.png\" alt=\"Screenshot 2017-02-02 at 10.31.49 AM\" width=\"600\" height=\"401\" \/><\/a>\r\n\r\nWith second semester's Club Day coming up tomorrow, students will be looking to join clubs, but may not know of the new clubs offered on campus in 2017. Read more to find out which clubs are new to Palo Alto High School and why you should sign up and get involved.\r\n\r\n<strong>R.O.C.K. (Reach Out. Care. Know)<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president junior Keahi Asing says that “R.O.C.K. stands for \"Reach Out. Care. Know,\" and is dedicated to mental health awareness and advocacy.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We want to build a strong community that supports itself, and ROCK focuses on educating kids like us on peer counseling so that we are all prepared if a friend, or anyone really, comes to us needing help,” Asing said.<\/span>\r\n\r\n<strong>Paly Green Club<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">According to club co-president junior Sarah Shader, the club will focus on two aspects in regards to nature: preservation and appreciation.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“My friend [and club co-president junior] Julie [Cornfield] and I realized that there wasn't an environmental club this year like there's been in past years, and so we decided we wanted to start our own,” Shader said.<\/span>\r\n\r\nShader says the club will gather in and out of school.\r\n\r\n<span style=\"font-weight: 400;\"> “We're going to do things like go on hikes and picnics, learn about how to cook food when you're camping, get wilderness first-aid certified, and [more]. Also, [we will] do activities [in] environmental awareness and activism, like organizing events at Paly, putting up posters, volunteering at Acterra, going to beach cleanups, [and more].”<\/span>\r\n\r\n<strong>Beach Volleyball Club<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president junior Maddy McNee says that this new club hopes to turn beach volleyball into an official Paly varsity sport in the future, and that making a club is the first step to getting there.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Because it is quite a process to create a sport at Paly, we had to initiate it as a club which may then turn into an actual sport next year if it ends up being approved by the Board [of Education] and other administrators,” McNee said. “We do have Kathy Laurence helping us with the club right now and she is very involved in helping us with the process.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The team will practice regularly and compete in local tournaments, according to McNee.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"We will be competing with others schools in the area and the winner of our league will have the opportunity to travel to Southern California to compete with schools there,\" McNee said. \"This will act as an alternative to an actual [varsity] sport at Paly but will have all the same commitments.”<\/span>\r\n\r\n<strong>Board Game Club <\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president junior Kesavan Soundararajan says Board game club <\/span><span style=\"font-weight: 400;\">is made to unite those with a love for board games, both the classics and cutting edge.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It's a great club for anyone to join because it'll be a social time and a fun hangout spot,” Soundararajan<\/span><span style=\"font-weight: 400;\"> said. “[We will play] the classics, with a couple new ones mixed in. We have the medieval age games, like chess, backgammon, online 8 ball pool, and also some new ones, like Settlers of Catan.”<\/span>\r\n\r\n<strong>Cadmus Magazine<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">According to club president sophomore Maraleis Sinton, Cadmus Magazine is a new creative writing publication, which allows those not enrolled in a creative writing class to “not only share ideas and stories, but [also] take part in something we have a passion [for].”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I encourage people to join who enjoy writing stories either fiction, partly fictional, or true to their own experiences,” Sinton said. “Writing has helped me in many ways and I hope to do the same with others. Behind every smile is a story and that's what I want to share.”<\/span>\r\n\r\n<strong>Paly Agents of Change<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">This new club aims to help students turn their ideas into actions that will impact their communities, specifically regarding social justice issues, according to club president sophomore Kristina Im.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our main goal is to better learn and understand our ever evolving society and establish a sense of purpose among ourselves and other club members,” Im said. “This club is focused on social justice matters, and gives people outside of the Social Justice Pathway an opportunity to engage in similar endeavors. We will have discussions about relevant worldly issues, and plan to turn discussion into action.”<\/span>\r\n\r\n<strong>YIBI Club (Youth International Business Initiative)<\/strong>\r\n\r\nYIBI, or Youth International Business Initiative, is a business club that aims to recruit students that are interested in business and learning more about business. It is currently an organization that exists off campus, so club president sophomore Eric Yap brought a branch of <a href=\"http:\/\/www.yibius.org\">YIBI<\/a> to Paly. The club plans to order Fortune magazines to read and discuss, listen to business speakers, and compete in conferences.\r\n\r\n<strong>Justice League Club<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">This club is dedicated to giving students a place to relax and unwind while watching <a href=\"http:\/\/www.imdb.com\/title\/tt0974015\/\">Justice League<\/a> episodes, according to club president sophomore Robin De Lorenzo.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Justice League Club is a feel-good club, so if people have quizzes or tests coming up, they can just come here and have fun watching cartoons,” De Lorenzo said.<\/span>\r\n\r\n<strong>Paly Marketing and Financing<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president junior Jeremy Dou says that this club will give students with this interest an opportunity to “engage, discuss, and help with each other [with] marketing and financing.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We'll do virtual stock trading simulations and future financing planning,” Dou said. “We believe that, by doing this, we can have a better idea of how we should plan our future wisely financially.”<\/span>\r\n\r\n<strong>Anthro Magazine<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">According to club co-president junior Maya Homan, the club aims to showcase diverse perspectives within local communities.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“At our school there are a lot of people with very diverse perspectives and experiences that we can learn from,” Homan said. “In such a politically polarizing time, it's especially important to be able to respectfully listen to each other and take other people's perspectives into account, which is what Anthro is here to do.”<\/span>\r\n\r\n<strong>SCOOP (Student Cooperative for Openness and Opportunity in Press)<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">SCOOP, or, Student Cooperative for Openness and Opportunity in Press, is a club aimed at finding ways to enhance diversity within journalistic staffs and within news coverage. The club aims to discover how to remove bias in news covering certain genders, religions, and races. This will be carried out through discussions about many topics such as current articles. It also hopes to emphasize the importance and need for diversity in media coverage. Additionally, students in the club will have the opportunity to write articles and listen to guest speakers.<\/span>\r\n\r\n<em>Editor's note: staff writer Soumya Jhaveri is the president of SCOOP club.<\/em>\r\n\r\n<strong>Marine Rescue<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">According to club president Ria Pai, the club aims to educate students about marine biology in an enjoyable way. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We [will] raise awareness for marine animals captivity and write letters to places like Seaworld talking about how capturing marine animals is terrible,” Pai said. “We want to show people that science can be exciting!”<\/span>\r\n\r\n<strong>Writers Club<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">According to club vice president Maya Wilson, students will gather to write and discuss their ideas.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We're going to start off with a warmup to wake you up a little bit then we're going to do some prompt or journaling responses and lastly we're going to finish it off with a sharing period where we share what we wrote about or discuss the prompt,” Wilson said.<\/span>\r\n\r\n<strong>Roots<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president Kat Merk says Roots aims to unite students with a common goal: \"save our planet.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"Roots is a environmental club which guides students to plan and execute projects which benefit our environment,\" Merk said. “Our goal is to to make Palo Alto High School a more environmentally-friendly school by helping students take initiative to fight climate change.\"<\/span>\r\n\r\n<strong>Pet Pals<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Club president sophomore Eileen Ha says that Pet Pals will be committed to making toys, beds, accessories and other items for their pets and for animals in local shelters.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The purpose of Pet Pals Club is to share love with our beloved pets by giving them handmade gifts,” Ha said. “We also plan to share love with animals at animal shelters by donating dog and cat toys that we make. It's okay if people are not good with making stuff because we all will share ideas and help each other.”<\/span>\r\n\r\n<strong>Archery<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">This new club will inform members about archery and encourage students to try out archery, according to club president junior Andrew Suk.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We teach about archery concepts and prepare people who do want to shoot at nearby archery ranges,” Suk said. “People should join because people do not know much about archery and many people haven't experienced the joy of shooting a bow, especially when shooting with friends.”<\/span>\r\n\r\n&nbsp;","excerpt":"With second semester's Club Day coming up this Friday, students will be looking to join clubs, but may not know what some of the new ones on campus are. Read more to find out which clubs are new to Palo Alto High School and why you should sign up and get involved.","date":"2017-02-02 18:37:17","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/Screenshot-2017-02-02-at-10.31.49-AM.png","categories":["Features","Uncategorized"],"tags":["agents of change","anthro","beach volleyball","board games","cadmus magazine","club day","clubs","financing","green club","justice league","marketing","Rock","scoop","yibi"]},{"id":128777,"title":"MUN shatters records at Santa Clara Valley conference","permalink":"http:\/\/palyvoice.com\/2017\/02\/02\/mun-shatters-records-at-santa-clara-valley-conference\/","content":"[caption id=\"attachment_129143\" align=\"alignnone\" width=\"603\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/16466304_10206273999487767_422112059_o.jpg\"><img class=\" wp-image-129143\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/16466304_10206273999487767_422112059_o.jpg\" alt=\"Senior MUN president Tara Madhav and junior treasurer Simran Pujji conduct research for an upcoming conference. Photo by Aidan Maese-Czeropski\" width=\"603\" height=\"339\" \/><\/a> Senior MUN president Tara Madhav and junior treasurer Simran Pujji conduct research for an upcoming conference. Photo by Aidan Maese-Czeropski[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The Palo Alto High School Model United Nations club is celebrating an exceptional performance this weekend at the Santa Clara Valley Model United Nations Conference, where they received six awards.<\/span>\r\n\r\nClub president Tara Madhav says the team's accolades were well-earned.\r\n\r\n<span style=\"font-weight: 400;\">“Our success at this conference was the culmination of a lot of hard work by the club this year and, in the long run, the past five years,\" Madhav said. \"SCVMUN was our most successful conference ever, and to see everyone's hard work pay off was amazing.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Madhav, the club members dove into committee proceedings, practiced their speeches, and wrote strong position papers, eventually resulting in their success. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Sophomore Asia Gardias and freshman Ryan Wisowaty won Best Delegates in the United Nations Environmental Programme committee for representing Bolivia and speaking about tailing dams and genetically modified organisms. <\/span>Gardias said her partner Wisowaty played a large part in their victory due to his combined ability to speak on the spot and his knowledge on genetically modified organisms.\r\n\r\n\"I’m seriously very proud of our team,\" Gardias said. \"Everyone did really great. I’m going to be so sad to see the seniors go, we’re all going to cry.\"\r\n\r\n<span style=\"font-weight: 400;\">Additionally, Madhav and senior club vice president Alicia Mies received Honorable Mentions as Bolivia on the LEGAL committee.  The legal committee deals with issues of international law and legal infrastructure. Mies, along with former Paly student Laure Blanchez, who now attends Li Po Chun United World College in Hong Kong, won the first major award for the club in 2016 as Outstanding Delegates, one of the three tiers of awards that can be won.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Seniors Kimberly Markevitch and MUN secretary Aidan Maese-Czeropski both won Honorable Mentions for Bolivia on the SOCHUM (Social-Humanitarian) committee in the conference. The committee <\/span><span style=\"font-weight: 400;\">deals with social, humanitarian and cultural issues such as reproductive rights, racism, refugees and child rights. <\/span><span style=\"font-weight: 400;\">Maese-Czeropski previously received a Verbal Commendation in November 2016 at the Stanford Model United Nations Conference. <\/span>\r\n\r\n<span style=\"font-weight: 400;\"> Madhav is excited about what lies in store for the club.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I know that this conference marks a new mark of achievement in Model UN's continued growth and achievement as a club,” Madhav said. <\/span>","excerpt":"The Palo Alto High School Model United Nations club is celebrating an exceptional performance this weekend at the Santa Clara Valley Model United Nations Conference, where they received six awards.\r\n\r\n\r\n","date":"2017-02-02 17:51:53","author":"Soumya Jhaveri","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/16466304_10206273999487767_422112059_o1.jpg","categories":["Global Outlook","News"],"tags":["aidan maese-czeropski","alicia mies","asia gardias","kimberly markevitch","mun","paly mun","ryan wisowaty","scvmun","Tara Madhav"]},{"id":128733,"title":"15 senior athletes commit to schools on National Signing Day","permalink":"http:\/\/palyvoice.com\/2017\/02\/02\/15-senior-athletes-commit-to-schools-on-national-signing-day\/","content":"[caption id=\"attachment_129049\" align=\"alignnone\" width=\"563\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_7124.jpg\"><img class=\"wp-image-129049\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_7124.jpg\" alt=\"IMG_7124\" width=\"563\" height=\"337\" \/><\/a> Palo Alto High School student athletes convened during lunch on Wednesday in the Media Arts Center for the National Signing Day Ceremony. \"You have made our entire school community proud and we are so happy to celebrate this with you,\" Principal Kim Diorio said. \"You embody all the values that we hold so dearly at Paly: things like integrity, respect, teamwork and collaboration.\" Photo: Daniel Li.[\/caption]\r\n\r\nMany student athletes often dream of the day when they can represent their school at the collegiate level. Fifteen Palo Alto High School senior athletes hit a milestone toward that dream on Wednesday during lunch, when the school honored them on National Signing Day in the Media Arts Center.\r\n\r\nThe National Signing Day Ceremony, usually the first Wednesday of February, marks the first day a high school senior athlete can sign the Letter of Intent for a sport with a school affiliated with the <a title=\"National Collegiate Athletic Association\" href=\"https:\/\/en.wikipedia.org\/wiki\/National_Collegiate_Athletic_Association\">National Collegiate Athletic Association<\/a>.\r\n\r\nThe athletes include Alex Liang (Stanford University) and Grace Zhao (Stanford University) for swimming; Lauola Amanoni (San Jose State University), Mason Wittman (University of North Carolina, Chapel Hill), Neil Verwillow (Trinity University) and Mara Zenger (Westminster College) for soccer; Troy Henderson (University of Puget Sound) and Peter Snodgrass (Northwestern University) for football; Jessica Lee (Claremont McKenna College) and Cassie Fong (San Francisco State University) for volleyball; Kimmi Chin (University of California, Los Angeles), Clay Watson (Columbia University) and Jackson Wood (University of Pennsylvania) for rowing; Kaitlin Chiu (Smith College) for lacrosse; and Bennet Huang (University of Iowa) for gymnastics.\r\n\r\nAccording to Liang, he feels extremely grateful for the opportunity to continue the sport he loves at a Division one school for the next four years.\r\n\r\n\"I have sacrificed so much time and schoolwork over the years for this sport and it is finally paying off,\" Liang said. \"I am so excited and feel so fortunate to have the opportunity to swim with such highly ranked swimmers at Stanford.\"\r\n\r\nPrincipal Kim Diorio, Athletic Director Kathi Bowers and University of California-Davis alumna and volleyball player Ally Whitson spoke at the event.\r\n\r\nBowers emphasized the importance <span style=\"font-weight: 400;\">of recognizing that these student athletes have shown a consistent commitment both in the classroom and on the field, gym or pool throughout their years at Paly. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"This is a culmination of lots of work; it’s not something that happens in one season or one year,\" Bowers said. \"It takes the support of their families, their coaches, their teachers and their friends.\"<\/span>\r\n\r\nWhitson shed insight on the lessons she learned as a collegiate athlete to the college-bound seniors.\r\n\r\n\"<span style=\"font-weight: 400;\">There’s definitely going to be a few sacrifices that you are going to make, but you learn some of the most valuable lessons by playing a sport,\" Whitson said. \"First, you will learn time management: how to balance your practice schedule with academics and just being a college student. You will learn determination when you come in as a freshman: wanting to beat out a returning player to get that starting spot. You will also learn discipline: having to get out of bed when your alarm goes off in the middle of winter for 6 a.m. weights and biking across Davis in the rain. Furthermore, one of the biggest things I learned was resilience: having to show up to practice the day after an extremely tough loss and ready to work even harder. Lastly, you will learn how to be a team player: you want to work as hard as you can for your teammates; after all, you will win together and lose together.\"<\/span>\r\n\r\nWhitson encouraged the athletes to enjoy the journey and to not be afraid to reach out for help.\r\n\r\n<span style=\"font-weight: 400;\">\"Remember that you guys aren’t alone in this adventure,\" Whitson said. \"Never hesitate to reach out to the people around you. You only get a few years as a collegiate athlete, but the lessons you learn will be there for the rest of your life.\"<\/span>","excerpt":"Many student athletes often dream of the day when they can represent their school at the collegiate level. Fifteen Palo Alto High School hit a milestone toward that dream on Wednesday during lunch, when the school honored them on National Signing Day in the Media Arts Center.","date":"2017-02-02 09:20:01","author":"Daniel Li","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_7124.jpg","categories":["Sports","Spotlight"],"tags":["Alex","ally","athlete","bowers","college","kathi","liang","national signing day","whitson"]},{"id":128876,"title":"In review: The Paly Voice summarizes Donald Trump&#8217;s first week in office","permalink":"http:\/\/palyvoice.com\/2017\/02\/01\/in-review-the-paly-voice-summarizes-donald-trumps-first-week-in-office\/","content":"[caption id=\"attachment_129038\" align=\"aligncenter\" width=\"353\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Executive-Order.png\"><img class=\" wp-image-129038\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Executive-Order.png\" alt=\"caption caption caption\" width=\"353\" height=\"402\" \/><\/a> President Donald Trump has had a very active first week in office, passing several executive orders as well as making appointments to his cabinet. Illustration: Timothy Liu.[\/caption]\r\n\r\nThe 45th president of the United States had a very busy first week in which he issued several executive orders reflective of his major campaign promises. Below is a list of some of the most noteworthy actions taken  by President Donald J. Trump during his first week in the Oval Office.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/2\/executive-order-minimizing-economic-burden-patient-protection-and\">Affordable Care Act:<\/a><\/strong>\r\n\r\nThe president's first executive order was passed on the day of his inauguration, which is a relatively vague order aiming to \"minimize the economic burden\" of the Patient Protection and Affordable Care Act.\r\n\r\nIt begins with President Trump declaring that his administration will work to replace and repeal the act. The order itself is intended to reduce costs of the Affordable Care Act until this replacement occurs.\r\n\r\nWashington executives with authority under the act, such as  have the power to \"waive, defer, grant exemptions from, or delay the implementation of any provision or requirement of the Act that would impose a fiscal burden on any State or a cost, fee, tax, penalty, or regulatory burden on individuals, families, healthcare providers, health insurers, patients, recipients of healthcare services, purchasers of health insurance, or makers of medical devices, products, or medications.\"\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/24\/executive-order-expediting-environmental-reviews-and-approvals-high\">Environmental Reviews and Infrastructure:<\/a><\/strong>\r\n\r\nTrump's next executive order was passed four days later, this time \"expediting environmental reviews and approvals for high priority infrastructure projects.\" Trump identifies the purpose of the order as an effort to increase the efficiency of decisions to promote infrastructure investment in order to grow the American economy.\r\n\r\nThe president aims to expedite the process by implementing a 30-day period following a project's proposal, during which time the importance will be determined. If it is deemed to be highly beneficial to the \"general welfare\" of the nation, it will be labeled as a \"high priority.\"\r\n\r\nThe Chairman of the Council of Environmental Quality and the head of the relevant agency will then design \"expedited procedures and deadlines\" for the completion of environmental reviews and approvals of \"high priority\" projects.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/25\/presidential-executive-order-enhancing-public-safety-interior-united\">Sanctuary Cities:<\/a><\/strong>\r\n\r\nOn Jan. 25, Trump issued another executive order that addresses sanctuary cities, which violate federal law by shielding undocumented immigrants from deportation.\r\n\r\nTrump introduces the order by stating \"The purpose of this order is to direct executive departments and agencies (agencies) to employ all lawful means to enforce the immigration laws of the United States.\"\r\n\r\nThe action will also \"ensure that jurisdictions that fail to comply with applicable Federal law do not receive Federal funds, except as mandated by law.\"\r\n\r\nTrump also emphasizes his desire for government agencies to utilize \"all available resources\" in ensuring that immigration laws and regulations are followed without exception.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/25\/executive-order-border-security-and-immigration-enforcement-improvements\">Illegal Immigration\/The Wall:<\/a><\/strong>\r\n\r\nPresident Trump's next executive order, which was issued on Jan. 25, was intended to reduce the strain on both federal resources and federal organizations responsible for maintaining border security. Trump specifically names illegal immigration across the southern border as the cause of this strain. In line with one of President Trump's most notable campaign promises, this executive order begins the process of constructing a wall on America's border with Mexico.\r\n\r\nThe action's most notable component is the process to \"secure the southern border of the United States through the immediate construction of a physical wall on the southern border, monitored and supported by adequate personnel so as to prevent illegal immigration, drug and human trafficking, and acts of terrorism.\"\r\n\r\nThe order also pushes government agencies to speed up the process of determining the eligibility of a person detained on suspicion of violating US immigration policy.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/27\/executive-order-protecting-nation-foreign-terrorist-entry-united-states\">Restriction on Immigration\/Travel:<\/a><\/strong>\r\n\r\nOn Jan. 27, Trump passed an executive order which implements a \"Suspension of Issuance of Visas and Other Immigration Benefits to Nationals of Countries of Particular Concern.\" These countries include Iraq, Iran, Syria, Yemen, Sudan, Somalia and Libya.\r\n\r\nTrump also ordered that for a 90 day period, \"immigrant and nonimmigrant entry into the United States of aliens\" from these 7 countries will be restricted. Foreign nationals traveling on certain diplomatic visas will be exempt from this restriction.\r\n\r\nTravelers who are detained are subject to vetting and investigation. Once they have been evaluated, the travelers will be either be permitted access to the country or denied it, depending on whether or not they can be confirmed as peaceful.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/28\/executive-order-ethics-commitments-executive-branch-appointees\">Ethics Pledge:<\/a><\/strong>\r\n\r\nThe president issued yet another executive order on Jan. 28, consisting of nine major ethical commitments which the members of his executive branch must uphold. These commitments range from preventing members of his cabinet from participating in certain lobbying activities, to keeping members of his cabinet from being influenced by lobbyists during their service.\r\n\r\nThe order also mandates that the members of his cabinet carefully read and then sign the document.\r\n\r\n<strong><a href=\"https:\/\/www.whitehouse.gov\/the-press-office\/2017\/01\/27\/executive-order-protecting-nation-foreign-terrorist-entry-united-states\">Government Regulation of Business:<\/a><\/strong>\r\n\r\nOn Jan. 28, the president passed an executive order impacting federal regulation of business. This executive order requires a minimum of two previously existing governmental regulations of business to be proposed for elimination whenever a new policy is implemented. It is in line with his \"one in two out\" campaign promise.\r\n\r\nTrump declared that that it \"is important that for every one new regulation issued, at least two prior regulations be identified for elimination, and that the cost of planned regulations be prudently managed and controlled through a budgeting process.\"\r\n\r\nThis executive order specifically affects the \"fiscal year 2017, which is in progress\". This statement restricts the longevity of the order to the end of this fiscal year.\r\n\r\nThe order also mandates that \"the total incremental cost\" of  all new regulations, including repealed regulations, finalized in 2017 cannot exceed zero, unless otherwise required by law or if advised by the Director of the Office of Management and Budget (Director).\r\n\r\nTrump has had a very busy first week, and this will not be the end of his actions as president. Check back with The Paly Voice for future breakdowns of the Trump administration's actions.","excerpt":"The 45th president of the United States had a very busy first week in which he issued several executive orders reflective of his major campaign promises. Below is a list of some of the most noteworthy actions taken by President Donald J. Trump during his first week in the Oval Office.","date":"2017-02-01 21:30:18","author":"William Sallomi","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_46311.jpg","categories":["Election 2016","News","Spotlight"],"tags":["Donald Trump","election 2016","Executive Orders","first week","inauguration","law","Politics"]}]