[{"id":128444,"title":"Paint fumes trigger fire alarm","permalink":"http:\/\/palyvoice.com\/2017\/01\/25\/paint-fumes-trigger-fire-alarm\/","content":"<p style=\"text-align: left;\">Paint fumes from an ongoing construction site set off a Palo Alto High School fire alarm at the beginning of 5th period today.<\/p>\n<p style=\"text-align: left;\">The alarm sounded around 12:15 p.m. According to Assistant Principal Jerry Berkson, the painters working in&nbsp;300B opened a door, sending paint fumes into the open space between the 200 and 300 buildings, setting off the alarm.<\/p>\n<p style=\"text-align: left;\">\"They were painting in there [room 300B], and when they opened the door, the paint fumes set off the detector,\" Berkson said. \"They just have one wall left [to paint], so as long as they keep the door closed, there shouldn't be any more problems.\"<\/p>\nSenior Andrew Vargha says that the fire alarm was a distraction from planned activities and classes.\n\n\"I was getting ready to enjoy my prep, and the fire alarm went off, so that was a good 30-minute distraction,\" Vargha said. \"I know a lot of people have tests today, and some people were about to go take quizzes, so now they're going to have less time for their tests and might have to stay in after class or come after school to finish their tests. It's not good how many issues the fire alarm caused.\"\n\nDespite the delays and problems that the fire alarm causes, the problem is on its way to being fixed, according to Berkson.\n\n\"Maintenance will just deactivate the detector, so that should be done soon,\" Berkson said.","excerpt":"Paint fumes from an ongoing construction site set off a Palo Alto High School fire alarm at the beginning of 5th period today.","date":"2017-01-25 14:44:08","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_3849.jpg","categories":["News"],"tags":["Berkson","detector","fire","fire alarms","fire drill","football","palo alto","palo alto high school","paly","Vargha"]},{"id":128228,"title":"Independent Study Physical Education program requires modification","permalink":"http:\/\/palyvoice.com\/2017\/01\/23\/independent-study-physical-education-program-requires-modification\/","content":"To ensure students have enough time to balance rest, schoolwork, and sports, the Independent Study Physical Education program at Palo Alto High School should be remedied and offered for all sports, not just for sports not offered at Paly.\r\n\r\nBy making it easier to apply for the program and offering it for all sports, students would be healthier both mentally and physically. Students would also have a better-balanced life.\r\n\r\nAlong with the qualification that a student must play a sport not offered at Paly, he or she must have played the sport for three years prior to applying for Independent Study PE. The student must train year-round for a minimum of 15 hours a week, five to six days a week.\r\n\r\n<span style=\"font-weight: 400;\">However, simply meeting all these standards is not enough to get an Independent Study prep. One must also go through a rigorous application process. This process needs to be easier for all students to apply in order to prevent any student from being deterred from applying. Sophomore Kat Merk has been riding horses since she was seven years old. She trains with her coach three to four hours a day, six to seven days a week. For her, the process of applying for Independent Study PE was long and difficult.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I was very surprised at how lengthy [the Independent Study PE application process] was because I feel like a signature from the coach would be enough,\" Merk said. \"I had to prove that I had been working with her for a certain amount of time, I had to pull out paperwork of contracts, I had to prove that I had been to competitions. It was a little bit too much.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Students in tenth grade at Palo Alto Unified School District schools that have successfully completed ninth grade Physical Education have the option of applying for Independent Study Physical Education, according to the Paly course catalog. A student in Independent Study PE is given a prep period for the entire year instead of taking a PE class. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly offers cross country, water polo, football, golf, girls' volleyball, basketball, soccer, wrestling, baseball, lacrosse, swimming and diving, badminton, softball, track as well as cheer and dance. Therefore, students participating in any of these sports are not eligible for Independent Study.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to PE teacher and Independent Study program head Peter Diepenbrock, there is a specific reason students in Paly sports are not eligible for an Independent Study PE prep.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> “[The purpose of Independent Study PE] is to give students that have been involved in a sport for many years and have dedicated a good portion of their lives to their sport, an opportunity to continue that sport. <\/span><span style=\"font-weight: 400;\">Students [playing a Paly sport cannot get a prep] because if you play a Paly sport, you already have an opportunity to get a prep for it.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Some may argue that this makes sense. However, sports seasons are only a few months long at most. Students that are dedicated to their sport devote hours of their time in the off-season to training. Anyone playing a sport at a high level has hours of practice a day and trains almost every day of the week. Students spend all this time to improve at their sport so that when they go back to their Paly team, the Paly team is stronger.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to PE teacher David Duran, the purpose of PE is to get exercise and socialize with peers. PE helps maintain physical health through exercise and mental health with socialization.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our philosophy is [that] we want you to come and learn a skill, learn some social skills, burn some calories,\" Duran said. \"PE, for the most part, is a very social class, so there is a lot of interaction, unlike some other classes. And for the long range, [our hope] is that you actually value exercise, and 50 years from now you are still active and exercising because there are benefits both for your body and mind to be physically fit,” Duran said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Though I agree with the goals and intents of PE as outlined by Duran, students who already play sports do not need PE to achieve those goals. A student who does over 15 hours of exercise a week clearly understands the value of exercise. While practicing a sport, they learn new skills, socialize, and burn calories. If they are already fulfilling these PE goals, they gain no benefit from taking part in PE.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to the Paly PE syllabus, the three standards for PE are to:<\/span>\r\n<ul>\r\n\t<li><span style=\"font-weight: 400;\">“Demonstrate knowledge and competency in motor skills, movement patterns, and strategies needed to perform a variety of physical activities.\"<\/span><\/li>\r\n\t<li><span style=\"font-weight: 400;\">\"Achieve a level of physical fitness for health and performance while demonstrating knowledge of fitness concepts, principles, and strategies.\"<\/span><\/li>\r\n\t<li><span style=\"font-weight: 400;\">\"Demonstrate knowledge of psychological and sociological concepts, principles, and strategies as they apply to learning and performance of physical activity.”<\/span><\/li>\r\n<\/ul>\r\n<span style=\"font-weight: 400;\">Through playing any sport, a student automatically engages in all of these standards. Playing a sport with the dedication of 15 hours a week means that a student has competent motor skills and movement abilities. They are physically fit and understand fitness concepts as they apply to their specific sport, but also athletics in general. Through coaching, they learn how psychological and sociological concepts affect their sport. It is unfair to assume that a student participating in a non-Paly sport automatically fulfills these criteria if they fulfill the ones required for an Independent Study prep, but a student playing a Paly sport doesn’t. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">A critical reason why students should be given an Independent Study prep for any sport that takes 15 hours per week is because students need the time to work on homework and study. Students agree that this prep is vital to their ability to succeed in schoolwork. Students such as Merk agree.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“[An Independent Study prep] gives you more time to focus on your academics and doesn’t take away from your physical education because you’re doing plenty after school,” said Merk.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Playing a sport is a time-consuming activity. One must factor in not only the length of practice and competitions, but also time for activities such as transport and showering. While students who play 15 hours of sports a week already struggle to fit all of this into their schedule, students without a prep find it even more difficult. Without time during their prep to meet with teachers, work on homework, or study, students may fall behind in their classes. In order to combat this, students have to stay up later at night to work on schoolwork. According to a <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/25028798\">study<\/a> conducted at the <\/span><span style=\"font-weight: 400;\">Harvard-Westlake <\/span><span style=\"font-weight: 400;\">School, getting less than eight hours of sleep a night is the biggest predictor of injury for high school athletes and a quarter of athletes who are injured miss at least a week of playing time.<\/span>\r\n\r\n[caption id=\"attachment_128278\" align=\"alignnone\" width=\"511\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-21-at-9.06.26-PM.png\"><img class=\" wp-image-128278\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-21-at-9.06.26-PM.png\" alt=\"From a study conducted at the Harvard-Westlake school.\" width=\"511\" height=\"161\" \/><\/a> From a <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/25028798\">study<\/a> conducted at the Harvard-Westlake school.[\/caption]\r\n\r\nIndependent Study preps are essential to Paly students because it is unhealthy to constantly demand so much from these already over-achieving student athletes. A student's health should be their primary concern, and they should not have to sacrifice it to play a sport and do well in school.\r\n\r\nSophomore Sydney Liu is an avid softball player. Getting sleep and rest is the main reason she wants an Independent Study prep; however, because she plays softball, she cannot get one.\r\n\r\n\"People always say that students should get a minimum of eight hours of sleep,\" Liu said. \"It's kind of hard to do that when I spend a total of four hours almost every day traveling and practicing for [my] sport. Getting that extra hour and a half to do homework during school hours would really help me prevent going to bed at 12 every night.\"\r\n\r\nConsequently, while PE is a necessary class to keep students in shape, students who already do 15 hours of a sport outside of school should not be required to partake in it and should be given the option to easily apply for an Independent Study prep. This prep would keep help maintain both the physical and mental health of students. Additionally, because all sports are physically demanding and time-consuming, there should be no restriction on which sport a student must play in order to qualify for Independent Study PE.","excerpt":"In order to qualify for Independent Study Physical Education, a student must play a sport that is not offered at Palo Alto High School. \r\n","date":"2017-01-23 17:30:39","author":"Soumya Jhaveri","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-21-at-8.42.27-PM-11.png","categories":["Opinion","Spotlight"],"tags":["diepenbrock","duran","independent study","kat merk","opinion","paly sports","pe","prep","sports"]},{"id":128280,"title":"Slideshow: Local demonstrators make a statement on Inauguration Day","permalink":"http:\/\/palyvoice.com\/2017\/01\/23\/slideshow-local-demonstrators-make-a-statement-on-inauguration-day\/","content":"On Friday, demonstrators lined up on a stretch of El Camino, many just a few feet away from Palo Alto High School; some protested the inauguration of Donald Trump as the 45th President of the United States while others attended for different reasons. The demonstration was part of a larger <a href=\"https:\/\/ecrprotest.blogspot.com\/\">Inauguration Day Sidewalk Protest<\/a> on parts of El Camino throughout the peninsula. Click through the slideshow to see why the protestors decided to make a statement.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1h8TEqnf8nH-RUlUDfIvr473IjbDwM2aO2a83F1w8CWo\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"665\" height=\"472\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"On Friday, demonstrators lined up on a stretch of El Camino, many just a few feet away from Palo Alto High School; some protested the inauguration of Donald Trump as the 45th President of the United States while others attended for different reasons.","date":"2017-01-23 09:46:54","author":"Dhara Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_3755.jpg","categories":["Multimedia","Spotlight"],"tags":["2016 election","Donald Trump","el camino","inauguration","palo alto","protest"]},{"id":128321,"title":"Ping pong contest to come to MAC","permalink":"http:\/\/palyvoice.com\/2017\/01\/22\/ping-pong-contest-to-come-to-mac\/","content":"Throughout lunch next week, the Palo Alto High School’s Media Arts Center will be filled with the sounds of ping pong balls ricocheting back and forth. The Associated Student Body is holding a ping pong tournament for students and teachers during lunch from Jan. 23 to Jan. 27.\r\n\r\nCompeting in teams of two, players will battle each other with the winners advancing in the bracket to ultimately play in the finals.\r\n\r\n“We decided to do ping pong to reach a different crowd,” Junior Class President Jaiveer Sandhu said. “ASB had the job of serving all students and we believe by hosting a ping pong tournament we could reach more of the Paly population.”\r\n\r\nTeachers will also be competing with students for a chance to win the tournament.\r\n\r\n“The tournament will be a lot of fun and will provide an opportunity for students to showcase their skills,” Sandhu said.\r\n\r\nSome are excited play against fellow classmates in a friendly match, while others look to win the tournament.\r\n\r\n“[I am] looking forward to a little friendly competition,” junior Matan Ziv said. “I believe [that my] team will make ping pong great again and win it all.”\r\n\r\n“There is a zero percent chance that my partner, Jaiveer Sandhu, and I lose this tournament,” junior Will Schmutz said.\r\n\r\nSignups to participate in the tournament closed last Thursday. ASB will be setting up the ping pong tables tomorrow during 3rd and 4th period, said Sandhu.","excerpt":"Throughout lunch next week, the Palo Alto High School’s Media Arts Center will be filled with the sounds of ping pong balls ricocheting back and forth. The Associated Student Body is holding a ping pong tournament for students and teachers during lunch from Jan. 23 to Jan. 27.","date":"2017-01-22 18:54:07","author":"Julia Qiao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-22-at-4.19.33-PM.png","categories":["News"],"tags":["ASB","Associated Student Body","atan ziv","jaiveer sandhum","paly","ping pong","ping pong tournament","will schmutz"]},{"id":128158,"title":"Proposed calendar changes prompt delays","permalink":"http:\/\/palyvoice.com\/2017\/01\/21\/proposed-calendar-changes-prompt-delays\/","content":"<span style=\"font-weight: 400;\">Palo Alto Unified School District students and staff are currently unable to solidify their mid-year vacation plans for the 2017-18 school year due to delays caused by unforeseen adjustments to next school year's calendar. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to PAUSD Superintendent of Human Resources Scott Bowers, the calendar, which is determined at the district level, is behind schedule, as many proposed schedule changes are slowing down the committee's process. The school year start and end dates, as well as various local holidays, have not yet been finalized.<\/span>\r\n\r\n\"We fully expect the student start dates for 2017-2018 to be similar to 2016-2017 (that is, Monday 8\/14\/17 for HS and Tuesday, 8\/15\/17 for K-8),\" the PAUSD <a href=\"https:\/\/www.pausd.org\/teaching-learning\/school-year-calendars\">website reads<\/a>.\r\n\r\n<span style=\"font-weight: 400;\">The calendar committee consists of teachers and administration who gather to discuss potential calendar schedules and submit a recommendation to the Board of Education. Typically, the committee discusses the calendar schedule in three-year increments, then presents the proposal to the board.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The committee's recommendation usually goes back to the bargaining teams for review and final agreement before it is presented to the board,” Bowers said. “The committee has done its work and now the negotiating teams are talking about the proposals.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Bowers, the calendar will be finalized at the upcoming school board meeting.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the calendar will be confirmed later than usual, students are unable to plan their vacations for next school year without the possibility of missing school.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“For people who take vacations and especially for people who are trying to plan their summers now, it’s hard because you don’t know when you are going to be back and whether you need to miss school,” junior Sarah Brodbeck said. “I don’t think I’ll necessarily be affected, but I know friends that definitely would be if they didn’t know what days they had to be at school.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly staff are also experiencing issues in planning their yearly schedules.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It is a little frustrating to not know what is going to happen next year this late in the school year,” librarian Rachel Kellerman said. “I hope they [the committee] are taking the input from past calendars to put together a really good calendar. I’m hoping the product will be worth the wait.\"<\/span>","excerpt":"Palo Alto Unified School District students and staff are currently unable to solidify their mid-year vacation plans for the 2017-18 school year due to delays caused by unforeseen adjustments to next school year's calendar. ","date":"2017-01-21 22:44:00","author":"Aidan Maese-Czeropski","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screenshot-2017-01-20-at-10.50.58-PM.png","categories":["News","Spotlight"],"tags":["calendar","Committee","delay","palo alto","PAUSD","schedule"]},{"id":128120,"title":"Game Preview: Boys&#8217; basketball set to continue rampage in league play","permalink":"http:\/\/palyvoice.com\/2017\/01\/19\/game-preview-boys-basketball-set-to-continue-rampage-in-league-play\/","content":"Last year's first-round Central Coast Section (CCS) playoff loss to the Cupertino High School Pioneers (11-6, 3-2) will be fresh in the mind of the Palo Alto High School (12-2, 4-0) boys' basketball squad when the Vikings have a chance to avenge their season-ending loss to the Pioneers at 7:45 p.m. on Friday at Gunn High School.\r\n\r\nAccording to head coach Peter Diepenbrock, the image of the Pioneers celebrating on the court last year has fueled the Vikings' anticipation for the rematch.\r\n\r\n\"It seems like the guys are very excited to play Cupertino after such a tough loss last season,\" Diepenbrock said. \"They know it's going to be a great challenge because Cupertino is so well coached and has some very good players.\"\r\n\r\n[caption id=\"attachment_127882\" align=\"alignright\" width=\"441\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_4927-1.jpg\"><img class=\" wp-image-127882\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_4927-1.jpg\" alt=\"Junior forward Max Dorward drives past a Los Altos High School defender. Dorward has carried the Vikings to a strong, 4-0 start, in De Anza League play. Photo: Benner Mullin. \" width=\"441\" height=\"394\" \/><\/a> Junior forward Max Dorward drives past a Los Altos High School defender. Dorward has carried the Vikings to a strong, 4-0 start, in De Anza League play. Photo: Benner Mullin.[\/caption]\r\n\r\nThe Vikings fell in a close battle to the Pioneers last February, 54-50, but Diepenbrock believes Paly have the necessary talent on its roster to take home a victory Friday evening.\r\n\r\n\"I think this year's [Paly] team is a much more experienced team and much more composed team,\" Diepenbrock said.\r\n\r\nJunior forward and one of Paly's leading scorers, Max Dorward, said the team has been preparing for Cupertino's specific defensive style.\r\n\r\n\"We've been working on our ball security to cut down on turnovers,\" Dorward said. \"Especially our passing because Cupertino plays [a zone defense].\"\r\n\r\nA balanced and deep roster has proved to be one of the characteristics that has made the team so successful this year. Contributions from players off the bench have been instrumental in the teams' results on the court.\r\n\r\nAccording to junior point guard Will Schmutz, who has served as a viable backup for senior starting point guard Miles Tention, one of the keys to the game for the Vikings will be controlling the tempo.\r\n\r\n\"We hope that our press can speed them up because they like to play slow,\" Schmutz said. \"We hope to take them out of rhythm.\"\r\n\r\nPaly has dominated in league play thus far, winning all its league games by 13 or more points, and hopes Friday's matchup will be no different.\r\n\r\nThe Vikings will round out the first half of league play next week against the Los Gatos Wildcats (11-5, 1-3) on Tuesday, Jan. 24.\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"Last year's first-round Central Coast Section (CCS) playoff  loss to the Cupertino High School Pioneers (11-6, 3-2) will be fresh in the mind of the Palo Alto High School (12-2, 4-0) boys' basketball squad when the Vikings have a chance to avenge their season-ending loss to the Pioneers at 7:45 p.m. on Friday at Gunn High School.\r\n\r\n","date":"2017-01-19 23:27:48","author":"Benner Mullin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/paul-bruh.jpg","categories":["Basketball","Sports","Uncategorized"],"tags":["basketball","CCS","cupertino","diepenbrock","dorward","max dorward","Peter Diepenbrock","pioneers","vikings","will schmutz"]},{"id":128196,"title":"Girls&#8217; soccer plays out an unexpected tie against Los Gatos","permalink":"http:\/\/palyvoice.com\/2017\/01\/19\/girls-soccer-plays-out-an-unexpected-tie-against-los-gatos\/","content":"[caption id=\"attachment_128198\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8862.jpg\"><img class=\"wp-image-128198 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8862.jpg\" alt=\"Freshman Chloe Japić narrowly avoids a Los Gatos player's attack. Photo: Emma van der Veen.\" width=\"600\" height=\"400\" \/><\/a> Freshman midfielder Chloe Japić narrowly avoids a Los Gatos High School (8-3-1, 2-1-1) player's attack during the second half of the match on Thursday. Japić sat out part of the first half of the game due to a temporary head injury, according to head coach Kurt Devlin. Photo: Emma van der Veen.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">With seconds left on the clock, Palo Alto High School girls' soccer team member senior defender Talia Malchin attempted one last desperate shot on goal off of a corner kick in an effort to break the tie with the Los Gatos Wildcats (8-3-1, 2-1-1), but the ball hit the crossbar of the goal.<\/span><b> <\/b>Despite high pressure from the Paly team's (8-0-3, 2-0-3) offense, the team was unable to capitalize on key moments in its scoreless draw, 0-0, against the Wildcats on Thursday at Paly.\r\n\r\nPaly remains undefeated in its De Anza league and overall season, a notable feat for the Vikings, but tonight's performance did not showcase a composed, dominant team.\r\n\r\n<span style=\"font-weight: 400;\">The Vikings and the Wildcats fought for possession of the ball throughout the game. Paly players continued to pressure the Los Gatos offense with notable efforts from senior defenders Malchin and Lauola Amanoni and junior midfielder Emily Tomz.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In the second half, Paly had several shots on goal, with a few that even hit the crossbar. With ten minutes left in the game, a shot on goal by Paly fell into the hands of the Wildcats’ goalkeeper. Two close shots by Malchin and freshman midfielder Chloe Japić followed right behind.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">With victories against Los Gatos in recent years, tying the Wildcats was not a favorable outcome, according to senior captain and midfielder Natalie Maloney.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We were definitely expecting to win this one [game], especially with all of the shots that we had,” Maloney said. “I’m actually surprised that none of them went in, but Talia is cursed by the crossbar now.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Maloney, the Vikings need to focus on getting shots on frame and capitalizing on scoring opportunities. Settling the ball down, connecting to one another on the field and simply putting balls in the net are essential to the Vikings’ success in coming games. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have hit the crossbar and shot it [the ball] wide way too many times,” Maloney said. “We get really frantic when we don’t score in the first half because it doesn’t feel like we have a ton of time. We really need to calm the game down.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According head coach Kurt Devlin, the team’s performance was “lackluster.”<\/span>\r\n\r\n“It hurts because we weren’t able to score, and we had so many chances,” Devlin said. “That definitely would have changed the complexion of the match.”\r\n\r\nAccording to Devlin, Malchin and Japić were sidelined for the latter part of the first half after suffering from a cramp and a “blow to the head,” respectively. Both players returned to the game in the second half.\r\n\r\n<span style=\"font-weight: 400;\">Up next, the Vikings are set to take on Fremont High School (5-6-2, 0-4-0) at 3:30 p.m. next Tuesday in Fremont.<\/span>","excerpt":"With seconds left on the clock, Palo Alto High School girls' soccer team member senior defender Talia Malchin attempted one last desperate shot on goal off of a corner kick in an effort to break the tie with the Los Gatos Wildcats (8-3-1, 2-1-1), but the ball hit the crossbar of the goal. Despite high pressure from the Paly team's (8-0-3, 2-0-3) offense, the team was unable to capitalize on key moments in its scoreless draw, 0-0, against the Wildcats on Thursday at Paly.","date":"2017-01-19 22:13:41","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8606.jpg","categories":["Sports"],"tags":["devlin","girls soccer","japic","kurt","los gatos","malchin","maloney","palo alto high school","palo alto high school girls soccer","Soccer","sports","tomz","vikings"]},{"id":128173,"title":"Girls&#8217; basketball to face Homestead for the first time in recent history","permalink":"http:\/\/palyvoice.com\/2017\/01\/19\/girls-basketball-to-face-homestead-for-the-first-time-in-recent-history\/","content":"<span style=\"font-weight: 400;\">For the first time in recent history Palo Alto High School girls' basketball (11-3, 4-0) will be taking on the Homestead High School Mustangs (8-7, 1-3) — a recently added De Anza League contender — at 6:15 p.m. tomorrow at Gunn High School.<\/span>\r\n\r\nWith an impressive De Anza league start, the Vikings are currently ranked first in leagues and are well-positioned to make it deep into the Central Coast Section Playoffs and California Interscholastic Federation state playoffs.\r\n\r\nThe Vikings have only dropped three non-league games throughout their current season, all to high-ranked schools like St. Mary’s High School (11-3, 0-0) out of Stockton, California who are currently ranked fifth in the state, and 13th in the nation. Along with this loss, Paly lost nail-biting games to Pinewood High School (13-2, 2-0) and Castro Valley High School (13-3, 3-0), by two points and five points, respectively.\r\n\r\nRigorous games like these have prepared the Vikings for upcoming league matchups, according to senior forward Skylar Burris.\r\n\r\n\"Playing against teams that are as good as Saint Mary's and Pinewood forces us to recognize how hard we have to work to get to that level,\" Burris said. \"We can't drop to the level of the competition, and by playing against great teams it forces us to play great as well, setting a standard for even our least competitive game.\"\r\n\r\nHomestead is new to the De Anza League this year, as the team moved up from the El Camino League after demolishing their competition with a 12-0 league record last season. The Mustangs replaced the Los Altos High School Eagles (6-9, 2-2), who went 2-10 in the De Anza League last year.\r\n\r\nThe Viking offense will again be led by Burris and junior guard Carly Leong, who have made a name for themselves by consistently draining shots from beyond the arc. According to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/palo-alto-vikings-(palo-alto,ca)\/girls-basketball\/home.htm\" target=\"_blank\">maxpreps<\/a>, Paly ranks 4th in California and 28th nationally for most 3-point shots made.\r\n\r\nAccording to Leong, one of the keys to the game for Paly is controlling the tempo and staying disciplined.\r\n\r\n“We cannot play down to their level, because if we do they would have a good chance of winning,” Leong said. “We just have to play our game and keep shooting and shoot transition shots even if we are up by a lot, and focus on defense.”\r\n\r\nHomestead is coming off a, 58-56 league win against Gunn High School (9-8, 3-2) whom the Vikings beat with a score of 72-63 on Jan. 6.\r\n\r\nFollowing the game against the Mustangs, Paly will have seven more league games before heading into the playoffs.","excerpt":"For the first time in recent history Palo Alto High School girls' basketball (11-3, 4-0) will be taking on the Homestead High School Mustangs (8-7, 1-3) — a recently added De Anza League contender — at 6:15 p.m. tomorrow at Gunn High School.\r\n\r\n","date":"2017-01-19 22:12:48","author":"Isabella Marcus","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_00321.jpg","categories":["Sports"],"tags":["basketball","carly leong","girls basketball","homestead","paly","skylar burris","vikings"]},{"id":128122,"title":"Students and staff to face off in winter rally","permalink":"http:\/\/palyvoice.com\/2017\/01\/19\/students-and-staff-to-face-off-in-winter-rally\/","content":"[caption id=\"attachment_114584\" align=\"alignnone\" width=\"614\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed.jpg\"><img class=\"wp-image-114584 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/01\/unnamed.jpg\" alt=\"unnamed\" width=\"614\" height=\"287\" \/><\/a> Participants in last year's rally line up for a photo. Photo: Emilia Diaz-Magaloni[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Students will be looking for revenge in the winter rally next Thursday after losing to the teachers in last year's student vs. staff soccer game.<\/span>\r\n\r\nDue to gym construction, Associate Student Body will once again host the rally on the football field and will include a student vs. staff soccer game in lieu of the traditional basketball game. <span style=\"font-weight: 400;\">The 40-minute rally is scheduled for 9:50 a.m. and will be followed by a 10-minute break before 4th period classes begin. Because of this alternate schedule, there will be no Advisory on the day of the rally and school will end at 2:25 p.m.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“For the student vs. staff, it’s for seniors only, just to guarantee they have a spot since it’s their last year and it’s kind of been a tradition,” said Senior Class Vice President Natalie Maloney.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Seniors can sign up <a href=\"https:\/\/docs.google.com\/forms\/d\/e\/1FAIpQLSeoMJRjniA0aooEjHGp-n4y9nqU80zUgZHHn1cP-dG4BIFWvA\/viewform?c=0&amp;w=1\" target=\"_blank\">online<\/a> until midnight tomorrow. According to Maloney, ASB will take gender into account when selecting players and coaches for the soccer game.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The players are selected based on a gender ratio, for example if the ratio of sign ups is two:one boys to girls then for every two boys selected, one girl will be selected,” Maloney said. “The selections are random. On the survey there was also an option for ‘other’ under gender; we haven’t gotten any responses for that but if we do, we will alter our selection method.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While varsity soccer players cannot actually play in the game, they may sign up to be a coach. Senior varsity soccer captain Derek Schoenberger hopes to be selected to coach the student soccer team. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I've always wanted to be a part of the soccer rally ever since we could no longer do the basketball rally as a result of the gym being under construction,” Schoenberger said. “The rivalry between students and staff has always been exciting and I really want to have a more significant role in helping the students defeat the Paly staff.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition, this year’s Prom location will be revealed at the event. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’m looking forward to the prom location and people’s reactions, because the venue is going to be sweet,” Maloney said.<\/span>","excerpt":"Students will be looking for revenge in the winter rally next Thursday after losing to the teachers in last year's student vs. staff soccer game.","date":"2017-01-19 15:43:57","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16145278_595442037309420_241543337_o.jpg","categories":["News","Spotlight"],"tags":["ASB","prom","Soccer","Staff","student","winter rally"]},{"id":128088,"title":"Slideshow: Girls&#8217; soccer pulls off hard-fought win","permalink":"http:\/\/palyvoice.com\/2017\/01\/17\/slideshow-girls-soccer-pulls-off-hard-fought-win\/","content":"The Palo Alto High School girls' soccer team (8-0-1, 2-0-1) continues its undefeated streak winning 2-0 versus Homestead High School (7-3-2, 1-2) despite a weak showing.\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1sZuAYQEZFVPlILDo9-11IMBSAtsTSrH6ig7pyUp-lu0\/embed?start=true&amp;loop=true&amp;delayms=3000\" width=\"700\" height=\"550\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School girls soccer team (8-0-1, 2-0-1) continues its undefeated streak winning 2-0 versus Homestead High School (7-3-2, 1-2) despite a weak showing.","date":"2017-01-17 19:44:35","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8245.jpg","categories":["Sports","Spotlight"],"tags":["girls","homestead","Soccer","undefeated","win"]}]