[{"id":129590,"title":"Moving &#8216;Manchester by the Sea&#8217;","permalink":"http:\/\/palyvoice.com\/2017\/02\/16\/moving-manchester-by-the-sea\/","content":"[caption id=\"attachment_129676\" align=\"aligncenter\" width=\"617\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/manchester-lead.jpg\"><img class=\"wp-image-129676\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/manchester-lead.jpg\" alt=\"manchester-lead\" width=\"617\" height=\"411\" \/><\/a> Lee (Casey Affleck) stands on the port of his hometown looking out into the water. Photo: Manchester by the sea website[\/caption]\r\n\r\n&nbsp;\r\n\r\n<span style=\"font-weight: 400;\">\"Manchester by the Sea\" is a heartbreaking tale of loss, love and mistakes that leave wounds ingrained so deep that try as we might, they will never truly heal. This film is not Hollywood, or heartwarming, or sunny skies and perfect endings. Instead, it is meant to be ingested slowly, as it pulls you in gently like a gasp of cold winter air, until it leaves you breathless.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The film follows Lee (Casey Affleck), a janitor from Boston whose apathy is a mask for the inextinguishable rage he feels towards the world and himself. After the death of his brother Joe (Kyle Chandler), Lee returns to his hometown astonished to find that he is now the legal guardian of his brother's teenage son (Lucas Hedges). <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Manchester by the Sea has managed to pull back the curtain. It tells the story of life lived in the real world, full of loose ends, unlearned lessons and pains that will never leave you. To watch it is like witnessing a conversation through a window, or maybe the lack of conversation — mundane interchanges saturated in all things left unsaid, that will never be said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The movie is masterfully set in Manchester-by-the-sea, Massachusetts. Jazz interludes play throughout scenes of water rippling docked boats and snow gently layering on rooftops, serving to orchestrate a beautiful portrait of this port town during the passing of seasons. However, as the movie progresses we begin to feel the stagnation, the feeling of time being stopped, paralleling perfectly with Lee’s emotions. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Massachusetts hometown of the title looms oppressively over Lee, and it is slowly drowning him. <\/span><span style=\"font-weight: 400;\">Lee, we begin to understand, bears the burden of a terrible tragedy, which caused his exile not only from his hometown but from life. To return to Manchester is to reopen a wound that Lee never healed, because he couldn't. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The music in the film is calm and playful, seeming to reflect the town's peaceful exterior but in stark contrast to the raging emotions that Lee hides behind closed expressions. The climax of the movie is paralleled with a stunning crescendo of strings and woodwinds that play deafeningly throughout an entire scene without dialogue, revealing the unbearable truth in Lee’s past. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Affleck's expressions are pulsing with compressed rage, emotions so tightly wound that throughout the first half of the movie you want to scream at him. His performance is raw and harrowing, and through a series of flashbacks that jab at Lee’s mind we finally understand that underneath his rage there is a deep and consuming sadness. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Hedges as Patrick, Lee’s teenage nephew, is perfectly vulnerable, angry and compassionate. The bond that forms between the two main characters through humorous and tentative exchanges is beautiful, heartbreaking and frustrating as it layered in things that can never be really dealt with or spoken out loud. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Manchester by the Sea is heartbreaking and sorrowful. It paints a portrait of life as it really is, where things are often left broken. It is masterfully subtle and delicate, yet at the same time harrowingly deafening.<\/span>\r\n\r\nManchester by the sea is nominated for 6 Oscars including Best Motion Picture of the Year, Best Performance by an Actor in a Leading Role, Best Performance by an Actor in a Leading Role, Best Performance by an Actress in a Supporting Role, Best Achievement in Directing, and Best Writing Original Screenplay.  The film previously won a Golden Globes for Best Performance by an Actor in a Motion Picture as well as several other awards\r\n\r\n<strong>“Manchester by the Sea”<\/strong>\r\n\r\n2 hours, 17 minutes\r\n\r\nRated R for some language\r\n\r\nDirected by Kenneth Lonergan\r\n\r\nStarring Casey Affleck, Michelle Williams, Lucas Hedges\r\n\r\nOscar Nominations: Best Motion Picture of the Year, Best Performance by an Actor in a Leading Role (Casey Affleck), Best Performance by an Actress in a Supporting Role (Michelle Williams), Best Achievement in Directing, and Best Writing Original Screenplay.","excerpt":"&nbsp; &#8220;Manchester by the Sea&#8221; is a heartbreaking tale of loss, love and mistakes that leave wounds ingrained so deep that try as we might, <a href=\"http:\/\/palyvoice.com\/2017\/02\/16\/moving-manchester-by-the-sea\/#more-'\" class=\"more-link\">more &raquo;<\/a>","date":"2017-02-16 23:30:37","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/manchester-lead.jpg","categories":["Entertainment","Oscars 2017","Uncategorized"],"tags":[]},{"id":129706,"title":"Undefeated girls&#8217; soccer heads into CCS after shutout win against Fremont","permalink":"http:\/\/palyvoice.com\/2017\/02\/16\/undefeated-girls-soccer-heads-into-ccs-after-shutout-win-against-fremont\/","content":"[caption id=\"attachment_129710\" align=\"alignnone\" width=\"499\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_0933.jpg\"><img class=\"wp-image-129710 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_0933.jpg\" alt=\"IMG_0933\" width=\"499\" height=\"432\" \/><\/a> Junior midfielder Darrow Hornik takes a shot at the Fremont goalkeeper in Palo Alto High School's 5-0 victory on Tuesday. Photo: Jackson Doerr.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Not many teams at Palo Alto High School can boast an undefeated record. Some teams are unable to boast about having a winning record. The Paly girls’ soccer team can proudly boast both of those things as they shut out Fremont High School (0-11-0) 5-0, in the last game of the regular season on Tuesday. <\/span>\r\n\r\nThis is the fifth year in a row that the girls’ soccer team has ended its regular season with a winning record. In those five years, the most games the team has lost in a season was two. With the regular season coming to a close, the focus is turning towards the postseason and the Central Coast Section playoffs. This will be the team's fourth season in a row to return to CCS and for the team’s seniors, it is their last chance at winning a championship. The Vikes came close in 2015, but were defeated in the championship game by Mountain View High School.\r\n\r\nWith the regular season now over, senior captain and midfielder Natalie Maloney reflects back on her time with the team. “Just thinking about it all makes me realize how much fun I’ve had and how much I love the girls,” Maloney said. “It seems like I was a freshman just last week.  It’s kinda surreal that time has gone by so fast.”\r\n\r\nMaloney played a key role in the game on Tuesday, scoring two out of the five goals and frequently setting up her fellow teammates. The Viking's victory was not perfect, despite keeping possesion of the ball for almost the entire game, Paly was unable to follow up on several goal opportunities. Moving forward into CCS this is something the team needs to work on. These issues were something senior defender Lauola Amanoni noticed.\r\n\r\n\"[It was] definitely not our best [game], but a good one to remember,\" Amanoni said. \"[It] wasn't the most difficult, but wasn't an easy win.\"\r\n\r\nPaly is currently first in the De Anza league with a record of (8-0-4) but that could change as several teams still have not played their final games, including Mountain View High School, currently in second place with a record of (8-1-2). Mountain View's game against Los Gatos High School could bump Paly from their first place position.\r\n\r\nThe Vikings' next game has yet to be decided, official CCS match ups will be announced in a week.\r\n\r\n&nbsp;","excerpt":"Not many teams at Palo Alto High School can boast an undefeated record. Some teams are unable to even boast about having a winning record. The Paly girls’ soccer team, can proudly boast both of those things as they shut out Fremont High School (0-11-0) 5-0, in the last game of the regular season.","date":"2017-02-16 17:38:07","author":"Jackson Doerr","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_0952.jpg","categories":["Sports","Sports Recap"],"tags":["2017","CCS","girls soccer","natalie maloney"]},{"id":125499,"title":"What is blended learning, and how did it begin at PAUSD?","permalink":"http:\/\/palyvoice.com\/2017\/02\/15\/what-is-blended-learning-and-how-did-it-begin-at-pausd\/","content":"Just like chefs, teachers of <a href=\"https:\/\/www.pausd.org\/high-school-education-9-12\/blended-learning\">blended learning<\/a> classes are handed a basic recipe for success, and then given the opportunity to add their own unique twist to the process.\r\n\r\nWith Palo Alto High School offering a record number of new blended classes (15) next year, The Paly Voice sought to learn more about the phenomenon.\r\n\r\nMichael Horn, one of the biggest names in the push for disruptive innovation in education, defines blended learning as “a formal education program in which students learn at least in part through online learning, with some element of student control over time, place, path and pace.” For most blended classes, this concept manifests in having one “flex” period a week, where students are not mandated to go to class. (Flex, in this case, is not the same as the Flex period listed on Paly's Tuesday afternoon schedule, which was formerly referred to as Tutorial.)\r\n\r\nFormer Palo Alto High School Teacher on Special Assignment and the current Coordinator for Educational Technology and Libraries at the district level, Emily Garrison, explains that blended learning is a push for moving education into the 21st century.\r\n\r\n“We now know that in the 21st century, living in the information age, learning doesn’t happen like it used to in the past. You have a phone in your pocket that has access to the entirety of humanity’s knowledge,\" Garrison said. \"That 19th century model of the teacher being the center of knowledge just doesn’t make sense anymore. Does learning have to be confined to third period? No, absolutely not. You all can go do your school work in many places and at a time that works best for you. Or, you can stay on campus and work more closely with your teacher in a small group.”\r\n\r\nAccording to Garrison, the concept of blended learning is approximately a decade old, but only reached Palo Alto Unified School District in 2009, when Gunn High school history teacher Brian Tuomy decided to experiment with a new type of class. This first class, now referred to as a “Twilight blended class,” met every Wednesday evenings for two and a half to three hours, giving the participating students a prep period during the school day. Garrison explains that when the students were not in class, “they used Schoology to do work at their own path, place and location, for however long it took them to complete the work.”\r\n\r\nGarrison explains that Tuomy then became the first blended learning TOSA, and decided to start a training program.\r\n\r\n“In 2011, he got together the first cohort of Gunn and Paly teachers, all of whom volunteered to be a part of an intense 60-hour certification program,” Garrison said. “They completed something called ‘The Leading Edge Certification Program,' which is basically a training program for teachers that want to start teaching in more of an online modality.”\r\n\r\nThe second cohort, which ran in fall 2013, switched training programs in order to get a better understanding of how to use Schoology for the purpose of blended learning.\r\n\r\n“Unlike the first cohort that was composed of mostly Gunn teachers, this second cohort was pretty evenly mixed,” Garrison said. “This time we decided to complete another training program with an outside instructor, but we did everything through Schoology. This was so powerful because teachers were essentially students on Schoology, so we could experience what it would be like for our students.”\r\n\r\nRight after Garrison became the blended learning TOSA, she decided with Tuomy that they would be creating their own certification program.\r\n\r\n“Brian Tuomy and I used our experience in blended learning in Palo Alto and we created our own Schoology training course,” Garrison said. “It still exists today, and it keeps getting better every year.”\r\n\r\nAccording to Garrison, Tuomy stepped down as the Gunn TOSA before the fifth cohort and was replaced with Gunn's Chris Bell, a math and computer science teacher.\r\n\r\n“Mr. Bell and I have now worked with approximately 65 teachers that are trained in blended learning in the district,” Garrison said. “In the spring we have a ‘Blended Learning Symposium,’ where all the teachers come together and learn from one another’s experiences.”\r\n\r\nAccording to Garrison, not all teachers who complete the training program end up running blended classes.\r\n\r\n“We have found that it works really well if we run this training program in the spring, and then over the course of the entire following year, the teachers that participated can experiment with different levels of blended learning in their classroom,” Garrison said. “When that year is over, teachers can decide if they want to informally continue to use blended learning concepts, or if they want their following year’s class to be a formal blended course, otherwise known as a ‘full-release’ course. To be listed as a full-release course, the only requirement is that online coursework does not to exceed 49 percent of the course time.”\r\n\r\nAt the end of the day, whether or not a blended learning class runs is completely up to the students.\r\n\r\n\"There have been teachers that have wanted to teach blended classes, who have prepared for them, and then it just doesn't work out,\" Garrison said. \"For a blended course to run, it has to be published in the course catalog, and just like any other class, it has to have enough students register.\"","excerpt":"Just like chefs, teachers of blended learning classes are handed a basic recipe for success, and then given the opportunity to add their own unique twist to the process.","date":"2017-02-15 22:50:29","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/10\/Blended-learning.jpg","categories":["Features","Spotlight"],"tags":["21st century learning","blended learning","brian tui","chris bell","cohort","emily garrison","PAUSD","twilight classes"]},{"id":129565,"title":"Fifteen blended courses to be offered next year","permalink":"http:\/\/palyvoice.com\/2017\/02\/15\/fifteen-blended-courses-to-be-offered-next-year\/","content":"<span style=\"font-weight: 400;\">According to Assistant Principal Victoria Kim, Paly will be offering 15 <a href=\"http:\/\/paly.io\/v\/125499\">blended classes<\/a> next year. Explore the interactive map below to learn more about each one.<\/span>\r\n\r\n<img class=\"alwaysThinglink aligncenter\" style=\"max-width: 100%;\" src=\"\/\/cdn.thinglink.me\/api\/image\/888135799764156417\/1024\/10\/scaletowidth#tl-888135799764156417;1043138249'\" alt=\"\" \/><script src=\"\/\/cdn.thinglink.me\/jse\/embed.js\" async=\"\" charset=\"utf-8\"><\/script>\r\n\r\nTo find out more information about each blended class, take a look at the <a href=\"http:\/\/paly.net\/course-catalog\">2017-2018 Course Catalog<\/a>.\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"According to Assistant Principal Victoria Kim, Paly will be offering 15 blended classes next year. Explore an interactive map to learn more about each one.","date":"2017-02-15 22:46:25","author":"Daniella Maydan","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/02\/blendedlearning.jpg","categories":["Features"],"tags":["2017","2018","ap biology","ap music theory","ap psychology","blended","blended learning","classes","getting into the game","introduction to analysis and calculus","learning","paly journalism","positive psychology","shakespeare\/chaucer","sports nutrition","world literature 12"]},{"id":128380,"title":"Column: NHL&#8217;s Centennial Celebration","permalink":"http:\/\/palyvoice.com\/2017\/02\/15\/column-nhls-centennial-celebration\/","content":"[caption id=\"attachment_128571\" align=\"alignnone\" width=\"455\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_6732.jpg\"><img class=\" wp-image-128571\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_6732.jpg\" alt=\"Junior Bradley Smith poses in front of the one and only Lord Stanley's Cup, given to the champion of the NHL\" width=\"455\" height=\"341\" \/><\/a> Voice staff writer Bradley Smith poses in front of the one and only Lord Stanley's Cup; given to the champion of the National Hockey League Photo: NHL Network Photography.[\/caption]\r\n<p dir=\"ltr\">As some of you may know, I am a huge hockey fan. You may have seen me around campus with a San Jose Sharks beanie or jersey on because that's what most of my apparel consists of. Hockey is interesting to me because of the history and tradition that is connected with it. Last month I had the wonderful opportunity to attend a centennial celebration of the National Hockey League at the SAP Center, home of the Sharks.<\/p>\r\n<p dir=\"ltr\">The year 2017 marks the NHL’s 100th year of existence. To celebrate this event, the NHL organized Centennial Fan Arenas in NHL cities in both the United States and Canada. The tour lasts from January through December.<\/p>\r\n<p dir=\"ltr\">The San Jose Sharks are the first NHL team to participate in this touring tribute. Our local celebration was a favorite for hockey fans and also a great way to introduce hockey to those who don’t know much about the game and its history. The celebration included responsive games and multiple free giveaways with appearances from Sharkie, the Sharks mascot, and the team's cheerleaders.<\/p>\r\n<p dir=\"ltr\">The main attraction was a 53-foot museum truck with an innovative interior featuring more than 1,000 square feet of interactive digital displays, videos, historical memorabilia and unique photo opportunities. A high-tech feature of the tour was the Clear The Ice Zamboni VR Experience. This never-before-seen VR experience allowed fans to compete against each other in a race to resurface the ice. Fans could also take a seat in a mini-Zamboni ice resurfacer, feel cool air on their skin and rumble in their seats as they attempted to make a perfect sheet of ice — in virtual reality. All fans were allowed to race, were timed and shared on a leaderboard for everyone to see.<\/p>\r\n<p dir=\"ltr\">The most memorable feature of the event was the appearance of the Stanley Cup: one of the oldest and most revered trophies in professionals sports. The trophy was displayed at the Centennial Fan Arena where visitors took photos with it. Standing next to the cup, seeing the names of all the players and teams who won it, had a profound effect on me. The greatest players ever to play the game had raised this same trophy.<\/p>\r\n<p dir=\"ltr\">According to the <a href=\"http:\/\/www.quanthockey.com\/nhl\/us-state\/active-nhl-players-born-in-california-career-stats.html\">Quanth Hockey website<\/a>, which provides hockey statistics on NHL records and locations of every player's birth cities and states. It shows that relative to other sports in the area, hockey is not as popular a sport in California, based on the number of players drafted into the NHL from the state. Hockey fans are primarily located on the East Coast and throughout Canada because of their snowy winters.<\/p>\r\n<p dir=\"ltr\">On the other hand, because of the success of the Sharks, Anaheim Ducks and Los Angeles Kings, fans around the world are starting to recognize the hockey fandom in California and the passion that many Californians feel about the game and their teams. Because of these teams, younger hockey players from California will have certain players they look up to and could eventually make it to NHL themselves.<\/p>\r\n<p dir=\"ltr\">Last year, the Sharks went on their best run in franchise history, with their fans behind them the whole way, and after making it to the NHL Stanley Cup Finals, were within reach of the cup. The Sharks were ultimately stopped short of their dream by the Pittsburgh Penguins, who defeated them in six games in the best-of-seven series. Winning the trophy continues to be on the Sharks' mind and winning it in the 100th anniversary of the NHL would be a very memorable one.<\/p>\r\n<p dir=\"ltr\">The SAP event was an example of the potential of hockey in California. Ambassadors of the sport are reaching out to Californians by teaching them about the tradition and history of the game. This interest will not change overnight, and tomorrow most Californians won't be worried about the next hockey game they will attend; however, this historic event is a sign that hockey in California is trending upward.<\/p>","excerpt":"The year 2017 marks the NHL’s 100th year of existence. To celebrate this event, the NHL organized Centennial Fan Arenas in NHL cities, from both the United States and Canada.","date":"2017-02-15 22:33:05","author":"Bradley Smith","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_6732.jpg","categories":["Opinion"],"tags":[]},{"id":129431,"title":"Alex Beaudry: The most single man on campus","permalink":"http:\/\/palyvoice.com\/2017\/02\/15\/alex-beaudry-the-most-single-man-on-campus\/","content":"<span style=\"font-weight: 400;\">Season 21 of the ABC television show The Bachelor has had its fair share of drama, from the Corinne and Taylor rivalry, to Nick’s sudden doubts in the process.<\/span>\r\n\r\n[caption id=\"attachment_129635\" align=\"alignright\" width=\"253\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/14712746_1809201422684690_9197953693524697988_o.jpg\"><img class=\" wp-image-129635\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/14712746_1809201422684690_9197953693524697988_o.jpg\" alt=\"Palo Alto High School senior Alex Beaudry will be the first Paly Bachelor in the school's history. \" width=\"253\" height=\"382\" \/><\/a> Palo Alto High School senior Alex Beaudry will be the first Paly Bachelor in the school's history.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School InFocus is debuting its first season The Paly Bachelor, starring senior Alex Beaudry.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In its first season, the Paly Bachelor is expected to be filled surprises. Even the bachelor himself is unsure of what is to come.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I've never actually seen the show so I'm not sure what to expect,” Beaudry said. “I'm gonna just try and be myself and see what happens.\"<\/span>\r\n\r\nAlthough he is new to the process, Beaudry has enjoyed his experience thus far.\r\n\r\n\"In all honesty it's pretty great,\" Beaudry said. \"It's a little weird getting recognized by everybody on campus, but I'm used to it now that I've been an anchor for so long. And it's pretty funny getting asked by random people if they can get a date with me. I feel like I've become a minor celebrity and I love it!\"\r\n\r\n<span style=\"font-weight: 400;\">Beaudry is excited to see the turnout of Paly students.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I'm looking forward to see who signs up for this,” Beaudry said. “In all honesty I'm half expecting half of the sign ups to be boys, which I think would be hilarious.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Beaudry, the live interview is expected to air tomorrow, but the date segment will not come out until next week.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Beaudry hopes to make the Paly Bachelor a new Paly tradition.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I'm not sure yet, but you might be able to look forward to more Paly Bachelor segments in the future,\" Beaudry said. \"I'm just trying to brighten people's day and bring a smile to people's faces, so I hope people enjoy this.”<\/span>\r\n\r\nUnfortunately, the process has not been so positive for all participants. Freshman Sam Hirschman applied to vie for Beaudry's heart, but did not make the cut.\r\n\r\n\"I got rejected in Spanish class,\" Hirschman said. \"I cried. It sounds like they're uncomfortable with gay relations, and that's no bueno.\"\r\n\r\nWhile Hirschman may not be looking forward to the show's premier, sophomore Henry Saul is especially excited.\r\n\r\n\"I love Alex Beaudry, and I love the bachelor,\" Saul said. \"I am very excited to see him with some of his favorite ladies.\"","excerpt":"This year, Palo Alto High School InFocus is debuting The Paly Bachelor, starring senior Alex Beaudry.","date":"2017-02-15 10:01:59","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/Screen-Shot-2017-02-14-at-8.45.20-AM.png","categories":["Uncategorized"],"tags":["Alex","bachelor","beaudry","infocus","valentine's day"]},{"id":129106,"title":"&#8216;Metamorphosis: Junior Year&#8217; to premiere in film festival","permalink":"http:\/\/palyvoice.com\/2017\/02\/14\/metamorphosis-junior-year-to-premiere-in-film-festival\/","content":"<span style=\"font-weight: 400;\">The student-produced film, \"<\/span><span style=\"font-weight: 400;\">Metamorphosis: Junior Year,\"<\/span><i><span style=\"font-weight: 400;\"> <\/span><\/i><span style=\"font-weight: 400;\">is set to premiere at 10:45 a.m. on March 4 at the Century 20 theater in Redwood City.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The film was <a href=\"http:\/\/palyvoice.com\/2015\/09\/13\/james-franco-teaches-first-film-workshop\/\" target=\"_blank\">produced<\/a> in part by Palo Alto High School students along with actor and artist James Franco as a mentor. Others who were involved include the director of photography of \"<\/span><span style=\"font-weight: 400;\">127 Hours\" and<\/span><i><span style=\"font-weight: 400;\"> <\/span><\/i><span style=\"font-weight: 400;\">the producer of \"<\/span><span style=\"font-weight: 400;\">Rise of the Planet of the Apes,\" <\/span><span style=\"font-weight: 400;\">according to co-director senior Alec Cohen-Schisler. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Based on Betsy Franco’s book, \"<\/span><span style=\"font-weight: 400;\">Metamorphosis: Junior Year\"<\/span><span style=\"font-weight: 400;\"> is about interconnected high schoolers and their struggles through their junior year. The film allows high school students to relate and sends a strong message about how they can get through these difficult four years and how they can help others, according to Cohen-Schisler.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Think about it like a '<\/span><span style=\"font-weight: 400;\">Love Actually'<\/span><span style=\"font-weight: 400;\"> meets Palo Alto,” Cohen-Schisler said. “The message is to take care of one another and always check in to make sure your friends and peers are okay during this stressful period.”<\/span>\r\n\r\n[caption id=\"attachment_121920\" align=\"alignright\" width=\"380\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/james-franco1.jpeg\"><img class=\" wp-image-121920\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/james-franco1.jpeg\" alt=\"Students began meeting every month in November 2015 to learn about film and create one of their own. Photo by Dhara Yu.\" width=\"380\" height=\"285\" \/><\/a> Franco helps students review film techniques and create a film based on their own ideas.  Students began meeting every month in November 2015. Photo: Dhara Yu.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The production of the film began in November 2015 through monthly film workshops. For the first three months, students met and worked on editing and adapting the script.  The actual filming began in February and lasted through March, according to Cohen-Schisler.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We all invested dozens of hours as well as our homes and other locations,” Cohen-Schisler said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Students began editing the footage in March and worked on animation throughout the whole summer. Since August, the group has been in post-production, according to Cohen-Schisler.  <\/span>\r\n\r\n“Some students dedicated hundreds of hours to this project and it’s truly the first of its kind,” Cohen-Schisler said.\r\n\r\n<span style=\"font-weight: 400;\">The Francos helped lead the production of the film and the monthly workshops. According to Cohen-Schisler, Betsy Franco helped add in many of her original visions to the film but the students also added in fresh ideas of their own.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“James has already seen a close to final version but we’re hoping he comes in March,” Cohen-Schisler said. <\/span>","excerpt":"The student led film, 'Metamorphosis Junior Year', is set to premiere on March 4. at 10:45 a.m. at the Century 20 theater in Redwood City.","date":"2017-02-14 09:04:17","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/james-franco1.jpeg","categories":["News","Spotlight"],"tags":["film","james franco","Metamorphosis Junior Year","palo alto high school","paly","premiere","student film"]},{"id":129535,"title":"Jared Wulbrun: Boys&#8217; basketball&#8217;s newest weapon","permalink":"http:\/\/palyvoice.com\/2017\/02\/14\/jared-wulbrun-boys-basketballs-newest-weapon\/","content":"A good number of the students attending Palo Alto High School have lived in or around the city of Palo Alto for most of, if not all, their lives. For those who haven't, they know that transitioning to a new home can be tough. Having new teachers, making new friends, being in a new environment, and getting involved in new sports teams and school organizations can be a difficult transition. Boys' basketball welcomed one of these Palo Alto newcomers.\r\n\r\n[caption id=\"attachment_129554\" align=\"alignright\" width=\"399\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/jared-1.jpg\"><img class=\" wp-image-129554\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/jared-1.jpg\" alt=\"Wulbrun elevates over Gunn High School senior forward David Clarke to knock down a three-point shot during a league match against Gunn. Photo: David Hickey \" width=\"399\" height=\"265\" \/><\/a> Wulbrun elevates over Gunn High School senior forward David Clarke to knock down a three-point shot during a league match against Gunn. Photo by: David Hickey[\/caption]\r\n\r\nDuring the 2016 off-season, the Paly boys' basketball team (19-3, 10-0) acquired five-foot-10-inch junior shooting guard Jared Wulbrun, who had just moved from Birmingham, Alabama. Wulbrun scored 24 points in his first regular season game as a Viking, hitting six of seven three-point shots and six of seven shots from the free-throw line. Wulbrun's sharpshooting along with his court vision and high basketball IQ, will be essential as the Vikings finish out league play this week.\r\n\r\nThe Wulbrun family ventured to the west coast because Jared's father, Jeff Wulbrun, accepted a job offer at Stanford University as the head assistant coach for the men's basketball team.\r\n\r\nBasketball has been a passion for Jared Wulbrun for as long as he can remember. Moving to Palo Alto, he had mixed emotions about having to assimilate to his current team.\r\n\r\n\"My first impressions were varied coming from a team that won a state title last year. I wasn't sure what the season would be like, honestly,\" Wulbrun said. \"It's always a hard thing to come into a new school, a new team, and expect everything to go smoothly. I was playing for a starting job which means you're going against others on the team for one or two spots, which can cause problems. For the most part there were no issues or hard feelings between any of us, which did nothing but help the team chemistry grow.\"\r\n\r\nDuring the preseason, Wulbrun first played with the team in an out-of-state tournament and quickly realized the strength that the team possesses.\r\n\r\n\"I soon figured out that we had something special with our group,\" Wulbrun said. \"I came [to Palo Alto] this summer and was able to play with the team in their summer tournaments and in our second tournament in Reno, Nevada. I saw what we had the potential to accomplish this year.\"\r\n\r\nWulbrun credits senior captain and point-guard Miles Tention for making his transition smoother than he expected.\r\n\r\n[caption id=\"attachment_129555\" align=\"alignleft\" width=\"394\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/jared-3.jpg\"><img class=\" wp-image-129555\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/jared-3.jpg\" alt=\"Wulbrun launches a three-point shot against Oak Grove High School. Photo: David Hickey\" width=\"394\" height=\"262\" \/><\/a> Wulbrun launches a three-point shot against Oak Grove High School. Photo by: David Hickey[\/caption]\r\n\r\n\"I always give credit to Miles [Tention] for how he immediately looked for me in games and treated me like we had played together for years, even though it had only been a few weeks,\" Wulbrun said. \"That made me feel comfortable right away, making the transition easy.\"\r\n\r\nWulbrun made an immediate impact on the team, aiding the Vikings' championship in their first regular season tournament in Burlingame, which he believes set the mindset for the rest of the season.\r\n\r\n\"After [the Burlingame tournament], we all got the feeling like we could do some big things this year and so far we have, going 20-3,\" Wulbrun said. \"Everything gelled perfectly and we were playing at a very high level. My thought was that 'We could only go up from here.'\"\r\n\r\nAccording to junior forward William Schlemmer, Wulbrun has had an impact on the team as a knock-down three-point shooter as well as a great friend.\r\n\r\n\"He's pretty much become family since I met him because he moved here over the summer and got a chance to get familiar with everyone else on the team and he's a great person to have around on and off the court,\" junior forward Will Schlemmer said. \"He's a good shooter and hustler so he's willing to do the little things to get the job done.\"\r\n\r\nHaving clinched the top seed in the De Anza League, the team looks to continue their dominance against its toughest and most anticipated league opponent of the season, the Los Gatos High School Wildcats (16-6, 6-4), who currently sit in second place in the league, at 7 p.m. on Tuesday at Gunn High School. The two teams met earlier in the season, with the Vikings dismissing their arch-rivals in an intense, 66-57, victory.\r\n\r\nDuring the his first taste of the Paly-Los Gatos feud, Wulbrun poured in 17-points, 12 of which came from beyond the arch. According to Wulbrun, he felt the intensity of the matchup and is keen to bring the heat on Tuesday.\r\n\r\n\"I've heard that at Paly, most people aren't very fond of [Los] Gatos,\" Wulbrun said. \"The first game showed that. We need to come out on Tuesday with the same mindset that we did at their place a few weeks ago. It's also senior night, and I know we all want to send our four seniors out the right way: at home with a huge [win] over a rival.\"\r\n\r\nTuesday's game is Paly's annual basketball \"Senior night,\" where seniors<span style=\"font-weight: 400;\">, Tention, Jack Simison, Ethan Stern and Eelis Copeland will be honored.<\/span>\r\n\r\nFor Paly, the key to stopping the strong Los Gatos squad is limiting the play of Wildcat six-foot-six-inch junior forward Dylan Belquist. Belquist was named to the De Anza League first team last year as a sophomore and dunked over six-foot-five-inch tall Schlemmer for two of his 20 points the last time the two teams met.\r\n\r\n\"We just need to play our game and make sure to not give them second chances on the offensive glass,\" Schlemmer said. \"As for Dylan we just want to play as a team and have someone besides him beat us. These next two [league] games are extremely important. One of our goals this year is to go undefeated in league and we are close to achieving that goal.\"","excerpt":"A good amount of the students attending Palo Alto High School have lived in or around the city of Palo Alto for most of, if not all, their lives. For those who haven't, they know that transitioning to a new home can be tough. Having new teachers, making new friends, being in a new environment, and getting involved in new sports teams and school organizations can be a very difficult transition. Boys' basketball (19-3, 10-0) hosts one of these Palo Alto newcomers.","date":"2017-02-14 09:01:34","author":"Isabella Marcus","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/jared-2.jpg","categories":["Features","Sports","Uncategorized"],"tags":["basketball","gatos","jared wulbrun","los gatos","miles tention","palo alto","paly","paly basketball","schlemmer","Senior Night","wildcats","will schlemmer","wulbrun"]},{"id":128312,"title":"Coffee Chats: Economics teacher Katie Smiley","permalink":"http:\/\/palyvoice.com\/2017\/02\/13\/coffee-chats-economics-teacher-katie-smiley\/","content":"[caption id=\"attachment_128413\" align=\"alignnone\" width=\"317\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16237573_613586045492637_309238746_n.jpg\"><img class=\"wp-image-128413\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16237573_613586045492637_309238746_n.jpg\" alt=\"16237573_613586045492637_309238746_n\" width=\"317\" height=\"422\" \/><\/a> Economics teacher Katie Smiley sits in her classroom to discuss her past travels and teaching career. Photo by Morgan Keller.[\/caption]\r\n\r\n<i><span style=\"font-weight: 400;\">This is the eighth installment of Coffee Chats, where The Paly Voice gets to know staff members over a cup of coffee.<\/span><\/i>\r\n\r\nThe Paly Voice sat down with Palo Alto High School Social Science teacher in training Katie Smiley to discuss her passions outside of the classroom, as well as her current busy schedule between teaching and her own education.\r\n\r\nAlthough she has traveled and lived across the country and the world including China and Germany, Smiley grew up in Palo Alto.\r\n\r\n“I am a Palo Alto native,” Smiley said.  “I even went to Gunn High School.”\r\n\r\nThis is Smiley’s first year teaching at Paly and is currently the teacher for a senior Economics class, as well as working alongside history teacher Eric Bloom to teach sociology for the Social Justice Pathway.\r\n\r\nSmiley really enjoys how collaborative the staff is at Paly within the departments. She also says she appreciates how many resources and opportunities are offered to students.\r\n\r\n“Everyone seems to be encouraged to do more than just STEM, so there seems to be a lot of cross-studying which is good for [students],” Smiley said.\r\n\r\nBefore joining Paly’s staff this year, Smiley taught for a year in China with her fellowship program in college and then began more one-on-one teaching, according to Smiley.\r\n\r\nSmiley didn’t always know she wanted to be a teacher until she studied abroad in Germany through Wellesley College.\r\n\r\n“As I was there, I helped some other students in the classes and discovered that I really enjoy teaching,” Smiley said. “When I got back, I took an [education] course on a whim and figured out this is something I really want to do.”\r\n\r\nNow, Smiley balances working at Paly while also earning her graduate degree at Stanford University.\r\n\r\n“I come to Paly and I'm here all day until about 2:45,” Smiley said. “Then I go to Stanford and I have classes from about 3p.m. to 6p.m. and I go home.”\r\n\r\nOutside of the classroom classrooms, Smiley enjoys playing video games, hiking and walking the Dish, according to Smiley.\r\n\r\nBefore choosing to become a teacher, Smiley was doing research focusing on lifespan psychology in Germany and hopes to teach a Psychology class in the future.","excerpt":"The Paly Voice sat down with Palo Alto High School Social Science teacher in training Katie Smiley and discussed her passions outside of the classroom, as well as her current busy schedule between teaching and her own education.","date":"2017-02-13 09:53:32","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/16237573_613586045492637_309238746_n.jpg","categories":["Coffee chats","Lifestyle","Spotlight"],"tags":["coffee chats","economics","psychology","Smiley","social justice","stanford","Teaching","Wellesley College"]},{"id":129462,"title":"Students to unleash their inner artists at Teen Creativity Party","permalink":"http:\/\/palyvoice.com\/2017\/02\/09\/students-to-unleash-their-inner-artist-at-teen-creativity-party\/","content":"The Palo Alto Art Center will host its second Takeover Teen Creativity Party from 6 p.m. to 9 p.m. tomorrow at the Palo Alto Art Center.\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School junior event co-runner Anna Fuller is organizing the party, which she says is a way to bring teens together.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We created this [party] to bring Palo Alto teens together and integrate art into the Palo Alto community,” Fuller said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to the Takeover Teen Creativity Party flyer, the event will include art making, music, games and a photo booth. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Fuller encourages all teens to come and enjoy the various activities, including henna. <\/span>\r\n\r\n“There are going to be henna artists there who can decorate your arms with beautiful designs,” Fuller said.\r\n\r\n<span style=\"font-weight: 400;\">According to Fuller, it is important for teens to unleash their creative side through art.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think it’s important for teens to do art because I feel like at an early age students learn more science and math skills and it isn’t really promoted in school to do artistic things,\" Fuller said. \"Letting teens do art and creative things is good for promoting creativity and brings a community of teens together.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Fuller, the event is free and snacks will be provided. <\/span>\r\n\r\nJunior Mele Mahe is excited to be creative and have fun.\r\n\r\n<span style=\"font-weight: 400;\">“[I] can’t wait to see pretty art and find out what the party’s all about,” Mahe said. <\/span>\r\n\r\nCreated by teens for teens, RSVP on the teen arts Facebook page <a href=\"https:\/\/www.facebook.com\/events\/393813334288990\/\" target=\"_blank\">Takeover: Teen Creativity Party!<\/a>","excerpt":"The Palo Alto Art Center will host its second Takeover Teen Creativity Party from 6 p.m. to 9 p.m. this Friday at the Palo Alto Art Center.","date":"2017-02-09 22:10:45","author":"Leila Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/takeover-photo-1-11.jpg","categories":["News"],"tags":["art","palo alto art center","palo alto high school","paly","Party"]}]