[{"id":127505,"title":"Preview: Vikings shoot for revenge against Titans","permalink":"http:\/\/palyvoice.com\/2017\/01\/05\/preview-vikings-shoot-for-revenge-against-titans\/","content":"\"Cut off baseline! Help middle!\" Palo Alto High School boys' basketball (9-2,1-0) head coach Peter Diepenbrock says as he commands the Vikings in the heat of play against league opponent Milpitas. Diepenbrock's fiery demeanor on the sideline exemplifies the energy the Vikings intend to carry over to the game on Friday.\r\n\r\nComing off a 58-43 victory against Milpitas High School (4-9,0-1) on Tuesday, the Vikings are looking to play to their strengths against the Gunn High School Titans (9-3, 0-1) at 7:45 p.m. on Friday at the Gunn gym for \"Quad Night\". Paly hopes to continue to rely on junior starters forward Max Dorward and guard Jared Wulbrun, along with consistent ball movement on the court.\r\n\r\nJunior center William Schlemmer said the team didn't showcase its full potential during its first league game, despite receiving the win, and hopes that the team will come ready to play against its cross-town rivals.\r\n\r\n\"I think my teammates and I are looking to perform much better on Friday,\" Schlemmer said.  \"However, we should treat the Gunn game just like every other game because it shouldn't have to take a rivalry game to make us play our hardest.\"\r\n\r\n[caption id=\"attachment_127658\" align=\"alignright\" width=\"454\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/schlemmer.jpg\"><img class=\" wp-image-127658\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/schlemmer.jpg\" alt=\"Junior center William Schlemmer sinks a free-throw late in the Vikings' first home league game vs. Milpitas High School on Tuesday. Paly went on to defeat Milpitas with a final score of 58-43. Photo by Noah Yuen.\" width=\"454\" height=\"303\" \/><\/a> Junior center William Schlemmer sinks a free-throw late in the Vikings' first home league game vs. Milpitas High School on Tuesday. Paly went on to defeat Milpitas with a final score of 58-43. Photo by Noah Yuen.[\/caption]\r\n\r\nSome may remember the Titans giving Paly a run for their money during the 2015-16 season, beating the Vikings on Quad Night. However, Gunn lost its superstar, graduated senior Alex Gil-Fernandez, as well as senior Jonathan Davis,  a key role player on the team's starting lineup. Paly, on the other hand, lost sole senior forward Justin Hull, whose role was quickly filled by junior sharp shooter Jared Wulbrun.\r\n\r\nDiepenbrock said he hopes the team will play its own style of ball and keep Gunn's star player, 6'6\" senior forward Jeffrey Lee-Heidenreich, off the boards.\r\n\r\n\"The team is looking strong when [it is] able to play [its] style, which is pressing defensively full court and being aggressive in offensive transition,\" Diepenbrock said. \"Gunn has a very good player, [Lee-Heidenreich]. We have to contain him and not let him get lots of offensive rebounds.\"\r\n\r\nSenior captain point-guard Miles Tention will once again assume his role as ball handler for the Vikings with support from fellow starters Schlemmer, Dorward, Wulbrun and junior guard Spencer Rojahn.\r\n\r\nDorward, who has displayed himself as the team's most valuable player throughout the preseason and the first De Anza League game, hopes to avenge last year's loss and ensure that the Vikings finish at the top of the league.\r\n\r\n\"This is a huge game because they are our cross-town rivals and we are looking for revenge from last year's loss,\" Dorward said. \"I'm really excited for the opportunity to get another win and put ourselves in a good position to finish [at the] top of our league.\r\n\r\nThe Paly Sixth Man Club instructs senior students to wear camouflage and remaining students to wear all green to showcase school spirit in the stands.\r\n\r\nNext up for the Vikings is a home game against the Los Altos Eagles this coming Tuesday, January 10th, and away against the Wilcox Chargers next Friday, January 13th.","excerpt":"Coming off a 58-43 victory against Milpitas High School (4-9,0-1) on Tuesday, the Vikings are looking to play to their strengths against the Gunn High School Titans (9-3, 0-1) at 7:45 p.m. on Friday at the Gunn gym for \"Quad Night\". Paly hopes to continue to rely on junior starters forward Max Dorward and guard Jared Wulbrun, along with consistent ball movement on the court.","date":"2017-01-05 21:34:10","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/schlemmer.jpg","categories":["Basketball","Sports","Spotlight"],"tags":["dorward","gunn","milpitas","palo alto","paly","Rojahn","schlemmer","tention","titans","vikings","wulbrun"]},{"id":127646,"title":"Girls&#8217; basketball dominates Saratoga in league opener","permalink":"http:\/\/palyvoice.com\/2017\/01\/05\/girls-basketball-dominates-saratoga-in-league-opener\/","content":"[caption id=\"attachment_127670\" align=\"alignright\" width=\"385\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_00262.jpg\"><img class=\" wp-image-127670\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_00262.jpg\" alt=\"Senior forward Skylar Burris shoots a three in the second quarter of the game. &quot;From the beginning we knew we wanted to get shots up quick in transition and I think we were able to do that well&quot;, Burris said, as the Vikings went on to win 81-46 over the Saratoga Falcons. Photo by Benner Mullin\" width=\"385\" height=\"311\" \/><\/a> Senior forward Skylar Burris shoots a three in the second quarter of the game. \"From the beginning we knew we wanted to get shots up quick in transition and I think we were able to do that well,\" Burris said. Photo by: Isabella Marcus[\/caption]\r\n\r\nThe Palo Alto High School girls' basketball team (7-2, 1-0) triumphed over the Saratoga High School Falcons (9-4, 0-1) in its De Anza League opener with a score of 81-46.\r\n\r\nThe Vikings came out trigger happy, going on a 12-4 run in the first quarter, fueled by three-point shots from senior point guard Julie Chandler and senior guard Skylar Burris.\r\n\r\n\"From the beginning, we knew we wanted to get shots up quick in transition, and I think we were able to do that well,\" Burris said.\r\n\r\nPaly built its point advantage early in the first quarter, giving it an 8-point lead heading into the second quarter.\r\n\r\nThe Vikings continued to attack from the three point line, with sophomore shooting guard Ellie Jefferies and senior point guard Lauren Koyama both contributing to the continuous barrage from a distance.\r\n\r\nKoyama put the exclamation point on the lead, as she drilled a step back three point shot to end the half, sending the Vikings into the locker room with a 41-23 lead.\r\n\r\n\"During a timeout, we decided to step up the intensity, and started hitting our shots, helping on defense more, and just getting our energy up,\" Koyama said.\r\n\r\nJunior guard Carly Leong carried the team in both the third and fourth quarters, scoring from all over the court.\r\n\r\n\"Always shoot your shot especially when you are open,\" Leong said. \"I was glad Ellie [Jefferies] had a bunch of threes in the first quarter. Hopefully that gained [helped her gain] more confidence so she shoots more because she is a great shooter.\"\r\n\r\nLeong's strong second half performance allowed the Vikings to coast to their first league victory of the season and head coach Scott Peter's 200th victory.\r\n\r\n\"This win is going to set a precedent for the rest of the year; we need to go into every game with the same energy and the same grind mentality,\" Burris said. \"Going into the game against Gunn, it'll be good to have this win under our belt. We are already super excited to play Gunn. It just adds to the building momentum.\"\r\n\r\nThe Vikings will face off against cross-town rivals, the Gunn Titans (7-5, 1-0), at 6:15 p.m. on Friday at the Gunn gym for the infamous \"Quad Night.\"","excerpt":"The Palo Alto High School girls' basketball team (7-2, 1-0) triumphed over the Saratoga High School Falcons (9-4, 0-1) in its De Anza League opener with a score of 81-46. ","date":"2017-01-05 21:21:09","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_00321.jpg","categories":["Sports","Uncategorized"],"tags":["2016","basketball","carly leong","ellie jefferies","girls","girls basketball","lauren koyama","palo alto","palo alto high school","paly","recap","skylar burris","sports","student","vikings"]},{"id":127554,"title":"Liveblog: Girls basketball takes on Saratoga","permalink":"http:\/\/palyvoice.com\/2017\/01\/04\/liveblog-girls-basketball-takes-on-saratoga\/","content":"Thank you for joining us on this fine evening as the Palo Alto High School girls' basketball takes on Saratoga.\r\n\r\n[liveblog]","excerpt":"Thank you for joining us on this fine evening as the Palo Alto High School girls&#8217; basketball takes on Saratoga.","date":"2017-01-04 19:03:05","author":"Isabella Marcus","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_00262.jpg\nPhoto by Benner Mullin\" \/>","categories":["Uncategorized"],"tags":[]},{"id":122937,"title":"Campus security cameras raise ethical questions","permalink":"http:\/\/palyvoice.com\/2016\/12\/15\/campus-security-cameras-raise-ethical-questions\/","content":"[caption id=\"attachment_123545\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_0087.jpg\"><img class=\"wp-image-123545\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/IMG_0087.jpg\" alt=\"\" width=\"600\" height=\"400\" \/><\/a> A camera overlooks the senior deck from the wall of room 109. Administrators installed 10 new surveillance cameras throughout Palo Alto High School over the summer break. Placed in  locations around major buildings and bike racks, the additional security is intended to reduce theft and vandalism, according to school administration. Photo by Sid Sharma.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Assistant Principal Jerry Berkson makes it part of his relatively new routine to check security camera footage whenever bike thefts are reported. Berkson, who until recently had limited tools to effectively catch perpetrators at Palo Alto High School, has proven to be considerably successful at identifying theft incidents on campus with the aid of ten new surveillance cameras. The footage has been visited five times as of October, and has helped successfully identify the perpetrators in three of the incidents, Berkson said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> Despite their proven merit at catching thieves and school vandals, the use of these monitor devices brings up the question: Is what some see as the act of recording over 2,000 students and over 200 faculty members without clear student or board consent justified by the benefit of being able to prevent crime on campus?<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Berkson, the new cameras were originally installed to deter bike theft. The cameras were installed either near bike racks, to record the theft, or around a number of the campus's access points where the footage would show thieves entering or exiting the scene of the crime. According to Berkson, between the original conception of the idea to install cameras and the actual installation, the purpose of the cameras seemed to have changed. As several incidents of vandalism and campus streaking occurred with the new year, the devices proved to have other helpful purposes besides catching bike thieves.<\/span>\r\n\r\n<a href=\"http:\/\/iframewidth=800height=618src=\/\/www.thinglink.com\/card\/835716532049805314type=text\/htmlframeborder=0webkitallowfullscreenmozallowfullscreenallowfullscreenscrolling=no\/iframe\"><iframe src=\"\/\/www.thinglink.com\/card\/835716532049805314\" width=\"800\" height=\"618\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/a><i>This map illustrates the location of the newly installed security cameras on campus. These do not include the cameras in the Media Arts Center <\/i>\r\n\r\n<span style=\"font-weight: 400;\">The Paly Voice counted that four of the 10 newly installed cameras are pointed at bike racks. The other six are generally pointed at popular student areas or outside the range of the bike racks, including in the Quad, and the large tree adjacent to the math building. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Not all bike racks have coverage either. The uncovered areas include the football field bike racks and the science building racks.<\/span>\r\n\r\nAccording to campus supervisor Scott Reese, who has served the school for over 20 years, most bike thefts occur after school. A good thief may be equipped with an arsenal of advanced tools from bolt cutters to freon gas, a refrigerant used in air conditioning which freezes a sprayed-on surface in a matter of seconds, making frozen locks extremely brittle. For the best of these sinister specialists, it only takes 90 seconds or less to steal a bike, according to Reese.\r\n\r\n<span style=\"font-weight: 400;\">When The Paly Voice got access to some of the footage, courtesy of Berkson, as viewed at midnight, much of the it was simply impossible to comprehend, some was very visible, but some was occasionally too obscured by light glare to identify the perpetrator. “It's not the greatest quality of footage,\" Berkson said, explaining how the nighttime nature of most of these crimes creates one of the chief obstacles for the administration.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to School Board member Heidi Emberling, the next-most-recent round of school board-approved cameras was installed a few years ago with the specific purpose of catching locker thieves . <\/span>\r\n\r\nSchool Board member Camille Townsend was not necessarily supportive of the newly added cameras.\r\n\r\n<span style=\"font-weight: 400;\">“We weren’t made aware of that [the cameras], \" Townsend said. \"For me, I’m not in support of surveillance unless there is a very specific purpose like, for example, straight on the lockers to dissuade locker theft.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Ken Dauber, another school board member, said the cameras were well within the administration’s rights.<\/span>\r\n\r\n\"I think they [the surveillance cameras] fall into the scope of what the principal is allowed to decide,\" Dauber said. \"I don't think the principal should have to come to the school board for approval.\"\r\n\r\nEthics experts generally encourage schools to follow a set of guidelines when camera installation is involved. Attorney of school law Amy M. Steketee has written a number of ethical guidelines for District Administration Magazine.\r\n\r\n\"Develop policies that set out the purpose for using surveillance cameras and outline the parameters for use,\" Skeketee stated in one of her articles. \"Notify the school community-by including statements in student handbooks and posting signs-that surveillance cameras are located throughout school buildings and that anyone on school property may be videotaped.\"\r\n\r\nIn line with this recommendation, the Paly administration has framed several notices throughout the school, informing passersby that cameras are watching them.\r\n\r\n[caption id=\"attachment_127414\" align=\"alignnone\" width=\"800\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_8394.jpg\"><img class=\"wp-image-127414\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_8394.jpg\" alt=\"IMG_8394\" width=\"800\" height=\"533\" \/><\/a> \"All Activities Monitored By Video Camera\" reads one of 7 notice signs, placed on a pillar near the auto shop bike racks, in approximate distance to one of the ten cameras. These signs were added after the cameras went online, to abide by ethical regulations as per suggestion of the District Administration Magazine.[\/caption]\r\n\r\nSurrounding school districts also abide by these same sets of rules.\r\n\r\nFor example, Mountain View High School publishes signs on the campus and a warning in its student handbook. The handbook reads: \"Surveillance cameras are in place in numerous areas on school property. Their purpose is for the protection of students, staff and property. Information obtained from camera recordings may be used in the investigation of school rule violations or criminal activity.\"\r\n\r\nAs for Steketee's suggestion to include statements in the school handbook, there is no mention of the cameras in the 86-page Paly student handbook this year, and no parent or student consent, nor board approval, was received for the devices at the time of installation according to Emberling and Townsend.\r\n\r\n<span style=\"font-weight: 400;\">The footage that is not filmed in the MAC is easily accessible by administrators on their laptops, phones, or tablets through the Alibi interface. The MAC footage is stored on the DVR in the control room of the MAC. <\/span>\r\n\r\nAccording to students on the robotics team, last year, students were able to get access to the wood shop camera footage because the administration linked a live stream of the camera footage on one of the district's public websites. The link has since been removed.\r\n\r\n\"Some people I know found a way to access a camera around the wood shop online,\" senior Gregory Jerian said. They were able to take snapshots of what was going on around the bike cages in front of the science building.\"\r\n\r\nThe installation of the cameras did not affect the insurance rate of the school, according to Berkson. Often insurance companies will offer lower rates if their client installs cameras. The rationale is that fewer things will be stolen, meaning the insurance company will have to pay less in possible damages.\r\n\r\n<span style=\"font-weight: 400;\">The installation is indicative of a larger trend of increased surveillance in schools. A 2008-9 Justice Department report found that use of security cameras in public schools was nearly 50 percent nationwide, while according to a report by the National Center for Education Statistics camera surveillance in public schools rose to 89 percent by the 2013-2014 school year. <\/span>\r\n\r\nThe Fourth Amendment, which usually protects people from unlawful search and seizure, does not uniformly apply to students at school. Courts have upheld surveillance in public areas and suspicion-less searches such as drug tests constitutional.\r\n\r\nAfter several months of being in active use, the cameras have been proven effective at catching bike theft and vandalism incidents. Yet according to Reese, the number of thefts this year has stayed consistent with last year when cameras were not installed.\r\n\r\n&nbsp;","excerpt":"Several new small, inconspicuous cameras have come online in the past few weeks to help the Palo Alto High School administration patrol the campus.\r\n\r\n","date":"2016-12-15 18:34:46","author":"Donnesh Farmanfarmaian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_0062.jpg","categories":["News"],"tags":["administration","cameras","campus","media arts center","palo alto high school","school safety","security","student"]},{"id":127406,"title":"Stage tech: The unseen side of theater","permalink":"http:\/\/palyvoice.com\/2016\/12\/14\/stage-tech-the-unseen-side-of-theater\/","content":"<span style=\"font-weight: 400;\">The bright lights, dazzling costumes and vivid sets, part of every theater production, are essential in transporting audiences to other worlds in which dramatic stories, played out by Palo Alto High School’s talented actors and actresses, can seem life-like. But, behind the scenes, students dressed in all black are busy making the whole production possible, and without them, the show would not go on.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">These students are members of Paly’s stage tech program, which handles everything from lighting to costumes to sets, according to senior Edward Park.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“What stage tech, or stage crew, does in the shows is anything that isn’t just the actors on stage,” Park said. “All the audio things [...], all the props, that’s stuff that our class puts together to supplement the actors doing their show.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While this is Park’s fourth year working with stage tech at Paly, he has been working behind the scenes for much longer.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I started doing tech in 6th grade with Ms. Gray at Jordan,” Park said. “And then as time went on I came to Paly and I did tech here, and I’ve also been working productions outside of school at community theaters in the Bay Area.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Once Park came to Paly, he joined the eighth period stage tech class. The majority of students involved in Paly stage tech are also a part of this once-per-week class.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It [the class] is Mondays after school for two hours, and that’s the only time we meet,” Park said. “The only real requirement in it is that you work at least 75 hours a semester, which is easy enough if you run a show, come to every class, and come to a couple of the work days.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Once a part of the program, a student is faced with the many fields of stage tech, including sound, light, set building, props, hair, makeup, costumes and more. With so many options to chose from, many try multiple fields until they find their main focus, while others know from the beginning.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There are definitely people like me who focus on one thing; I’ve been focusing on sound since I was a freshman,” Park said. “There are some people who work in multiple fields, like there are a couple of sophomores and freshmen who work in sound and lights and set, and a couple of people do hair, makeup and costuming as well as some sound work or some crew work here and there.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After a couple years of getting a feel for the vast variety offered by stage tech, students are encouraged to hone in one skill.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We do recommend that eventually, by junior year, you do choose one thing to focus on, so that you can get proficient at it and start teaching the incoming class of underclassmen,” Park said. “But overall, if you really want to be a jack of all trades, that’s entirely fine.”<\/span>\r\n\r\nPark has focused on sound since his freshman year, and is currently the head of the sound group.\r\n\r\n“What I do in stage tech right now is I supervise the microphone and the audio work of every actor and stage technician that there is,” Park said.\r\n\r\n<span style=\"font-weight: 400;\">According to Park, his favorite part of the stage tech program is the close-knit bond between the stage crew and the actors.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I never did any of the sports programs, I’m a part of the music program,” Park said. “But the community I get from stage tech is great because not only am I working with the crew, I’m working with the actors.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">While Park prioritizes audio work, junior Gail Hildebrand has focused on props since her sophomore year.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I became props master when the previous props master, Charlotte Moffat [...] was a senior my sophomore year, I took over for her for a couple of the shows,” Hildebrand said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Hildebrand acquires props for a show by borrowing, renting or even reusing old props, but she prefers creating the props herself.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I would probably choose to be ‘props designer’ more than ‘props master’, because that’s more the creation of things,” Hildebrand said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Hildebrand looks forward to the production of \"Beauty and the Beast\", because she will have the chance to get creative and incorporate elements of props that she enjoys.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’m hoping I’ll be able to help with a lot of the props for that \"Beauty and the Beast\" because they’ll be more old-timey themed and that’s the stuff that I like,” Hildebrand said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Hildebrand, her favorite part of working on props is seeing the final product on stage at a show. “It’s really cool to see everyone’s creative ideas and how they all come together,” Hildebrand said. “Everyone has their own, unique ideas, but when you put them all together it makes a consistent, really cool show.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition to props, Hildebrand does set building. While her experiences in the two fields have been different, they complement each other other well. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Build is really nice because it’s very informal,” Hildebrand said. “At least to me, you just sort of show up, and they just hand you tools and explain how to use them. I went into it not even knowing how to use a drill, and now I feel confident using jigsaws. That is definitely an improvement for me, and I think it helps with props as well, because I know how to build stuff, if I need to.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Hildebrand has found that the transition from the Haymarket theater to the newly constructed Performing Arts Center has caused some changes in set building.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Now that we have the new theater, we have to have [to build] much larger sets,” Hildebrand said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After working in the Haymarket theater for three years, Park has also had to readjust to the different equipment in the PAC. <\/span>According to Park, the biggest difference between the Haymarket and the PAC is the new state of the art equipment.\r\n\r\n<span style=\"font-weight: 400;\">“There are a lot of issues at the Haymarket that come just from age,” Park said. “A lot of cabling as well as the hardware that we have is so old that we’re gonna have problems no matter what we try and fix it. And of course we try and fix it, like all the white noise and all the stage issues that we had. We have always tried to fix that. That isn’t an issue with this theater and all the hardware that we have. What we’re working with is new, so we know there aren’t any developmental faults with it. And we’ve learned how to use it better.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Park encourages those interested to join the program and participate in the unique experience that stage tech has to offer. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The Paly stage tech program, or the Paly theater program as a whole, is probably one of the most professional high school programs that you can come and work with. [...]” Park said.  “That being said, that does mean that we’re a slightly more serious environment than some other high school programs and I can see how that might be a bit frightening to some people who’ve never experienced or done this kind of thing before. But regardless of how intense we are, we’re always inclusive of new people and if you’re coming in ready to learn, that’s all we need.”<\/span>","excerpt":"The bright lights, dazzling costumes, and vivid sets part of every theater production are essential in transporting captivated audiences to other worlds in which dramatic stories, played out by Palo Alto High School’s talented actors and actresses, can seem life-like. But behind the scenes, students dressed in all black are busy making the whole production possible, and without them, the show would not go on.","date":"2016-12-14 18:44:02","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15536932_1185958024821559_1498807022_o.jpg","categories":["Features"],"tags":["paly theater","stage tech","theater"]},{"id":127417,"title":"Boys&#8217; soccer dominates Sequoia in final minutes","permalink":"http:\/\/palyvoice.com\/2016\/12\/13\/boys-soccer-dominates-sequoia-in-final-minutes\/","content":"[caption id=\"attachment_127471\" align=\"aligncenter\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15328184_1268811829857234_1042461844_n.jpg\"><img class=\"wp-image-127471 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15328184_1268811829857234_1042461844_n.jpg\" alt=\"15328184_1268811829857234_1042461844_n\" width=\"600\" height=\"400\" \/><\/a> Palo Alto High School senior Michel Ange Siaba fights a Carlmont High School soccer player during a preseason match on Nov. 30. The Vikings won their third preseason game, 2-1. Photo: Emma van der Veen.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">With 30 minutes left on the clock, neither the Palo Alto High School <\/span><span style=\"font-weight: 400;\">(7-1-0) <\/span><span style=\"font-weight: 400;\">nor Sequoia High School <\/span><span style=\"font-weight: 400;\">(1-2) boys’<\/span><span style=\"font-weight: 400;\"> soccer teams had scored on one another. <\/span><span style=\"font-weight: 400;\">But in the span of three minutes, the Vikings scored two goals to defeat Sequoia 2-0 yesterday at Paly. <\/span>\r\n<p style=\"text-align: left;\">After a devastating loss against Burlingame High School last Thursday, where the Vikings fell 0-1, the Vikings proved their dominance on the field with a resounding win.<\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">The first of the Vikings' goals broke a 0-0 tie in the 50th minute. All eyes were on Viking sophomore left forward Isaiah Schoenberger, who drove the ball through two Sequoia defenders working off a clean cut pass from senior forward and keeper Michel Ange Siaba.<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">As Schoenberger scored the first goal of the game, senior fan Andrew Vargha cheered from the stands louder than the crowd of parents present. <\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">What followed was another goal by senior defender Thomas Crouch, who worked off a pass from senior captain Neil Verwillow. With Paly’s sudden 2-0 lead, the Cherokee's  play became more aggressive. In a sudden turnaround, Sequoia regained possession and drove the ball back towards the Paly goal. Four Sequoia players positioned themselves near the Paly goal as Paly defenders sprinted into action. Sequoia took shot towards the upper left of the goal, but  junior keeper Kiran Misner jumped and punched the ball. The ball shot high up and for a few seconds it looked as though it would fly back into the Paly goal, but Misner's block pushed the ball far enough that it landed behind the goal net. Safe. <\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Misner recalls the shift in dynamic following the two goals and the close save.<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">“Our team definitely came alive in the second half and I think that was partly due to some of the tactical changes we made going into the second [half] and also because our team kept on pushing for that first and then second goal,” Misner said. “As for the save, I didn’t really think too much <\/span><span style=\"font-weight: 400;\">about it and relied on my reflexes to get a hand on it.\"<\/span><\/p>\r\n<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">Players look forward to their final preseason game, which will be an alumni game at 3:30 p.m. on Dec. 29, at home, before entering the regular season.<\/span><\/p>\r\n<p style=\"text-align: center;\"><\/p>","excerpt":"With 30 minutes left on the clock, neither the Palo Alto High School (7-1-0) nor Sequoia High School's (1-2) boys’ soccer team had scored on one another.  But in the span of three minutes, the Vikings scored two goals to defeat Sequoia 2-0 yesterday at Paly.","date":"2016-12-13 23:02:51","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15328184_1268811829857234_1042461844_n.jpg","categories":["Sports","Spotlight"],"tags":["boys soccer","isaiah schoenberger","kiran misner","michel-ange siaba","Thomas Crouch","varsity"]},{"id":127252,"title":"Students halfway to qualifying for &#8216;Tournament of Champions&#8217; debate","permalink":"http:\/\/palyvoice.com\/2016\/12\/13\/students-halfway-to-qualifying-for-tournament-of-champions-debate\/","content":"[caption id=\"attachment_127253\" align=\"alignright\" width=\"472\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15357047_366005343744604_1546132945_n.jpg\"><img class=\" wp-image-127253\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15357047_366005343744604_1546132945_n.jpg\" alt=\"Senior debater Colin Fee (left) and junior debater Barry He (right) passionately discuss their debate successes and excitement for their bright futures. \" width=\"472\" height=\"354\" \/><\/a> Senior debater Colin Fee (left) and junior debater Barry He (right) passionately discuss their debate successes and excitement for their bright futures.[\/caption]\r\n\r\nTwo Palo Alto High School students have qualified for what is known as the “World Cup” of high school debate: the Tournament of Champions.  Junior debater Barry He and senior debater Colin Fee each received one of the two necessary bids to qualify for the tournament on December 2 at the Alta silver and black invitational in Salt Lake City, Utah.\r\n\r\n<span style=\"font-weight: 400;\">He and Fee compete in the National Circuit, under the administration of the University of Kentucky, which requires them to travel around the country to various tournaments. This recently brought them to the Alta tournament in Utah, where both students received “bids” that bring them one step closer to a coveted spot in the TOC, a tournament that, according to He, only roughly 100 student debaters participate in. Students receive bids based on their performances in previous tournaments, many of which are out of the area and even out of state. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Both students performed exceptionally well in their previous tournament, which Fee credits to their personal connection to their topics.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“This debate tournament went pretty well, since we both went pretty far,” Fee said. “But more importantly was both of us writing about ourselves. Barry talked about the myth of the model minority and I dealt with the death of Ronald Armstrong, a disabled man who was killed in police brutality. That’s where I think the power of debate is, in becoming a self-advocate and finding yourself.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">He and Fee compete in progressive debate, which is a national fast-paced debate format. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The national circuit has a steep learning curve, since we do progressive debate, we don’t debate persuasively in front of parents,” He said. “It’s very common to see people at up to 450 words per minute on the circuit and reading obscure philosophy and critical theories while using a lot of debate jargon.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">To keep up with the high level of competition, practice is a must for He and Fee. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I wasted three years of my life abandoning a social life,” Fee said. “It felt like a lot of hard work to finally reach this benchmark.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">As their place in the TOC is not yet confirmed, He and Fee will be preparing  to earn a second bid at their upcoming tournaments. They will be debating  on Dec. 17 and 18 in the College Prep Invitational in Oakland, as well as on Jan. 6 at the University of Puget Sound in Tacoma, Washington. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It just makes me hungry to do more and work harder so that I can go even further,” Fee said. <\/span>\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"This exclusive competition is just as prestigious, if not more, as it sounds. ","date":"2016-12-13 17:25:42","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15357047_366005343744604_1546132945_n.jpg","categories":["News","Uncategorized"],"tags":["Barry","colin","debate","Fee","He","Tournament of Champions"]},{"id":127164,"title":"&#8216;Moana&#8217; will flow its way into your heart","permalink":"http:\/\/palyvoice.com\/2016\/12\/13\/moana-will-flow-its-way-into-your-heart\/","content":"&nbsp;\r\n\r\n[caption id=\"attachment_127165\" align=\"alignright\" width=\"441\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/Screen-Shot-2016-12-08-at-9.12.17-PM.png\"><img class=\"wp-image-127165\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/Screen-Shot-2016-12-08-at-9.12.17-PM.png\" alt=\"Screen Shot 2016-12-08 at 9.12.17 PM\" width=\"441\" height=\"315\" \/><\/a> \"Moana\" is about an empowered young woman who embarks on a journey to save her family and her island. Photo: Walt Disney animations.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The scene opens with the wide eyes of a small girl as she tumbles through the sand and is playfully teased by a waving tide. It is instantly noticeable, in the warm toned lyrical opening musical number, that Disney has invited us back to its magical world. Like a tide curling back into the sea, we are once again swept up in the world of adventure, friendship and magic. The eyes of the children in the audience grow as wide as baby Moana's, devouring this spectacle of color and sound. The eyes of the adults with them reflect a familiar nostalgia, as new worlds are made familiar through the swish of that magic wand. However, Disney's “Moana” also offers something new: a development in the new age of Disney princesses brought to us in movies like “Princess and the Frog, “Brave” and “Frozen.” Moana, a Polynesian princess, but also soon-to-be leader of her people, offers a new image to what a hero is meant to be. Through this young protagonist's will and powerful spirit, the movie develops a message of finding power within and believing in yourself unquestionably.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The movie follows Moana as she embarks on a journey to save the dying island she calls home.  Throughout her childhood, she is sheltered by her parents and community from “exploring beyond the reef.”  However, she soon finds out that the sea chose her to return a treasured stone that had been stolen from the motherland by the demigod Maui thousands of years ago to save her island.  Moana has to journey past the reef and into the dangers of the deep sea to return the stone.  Along the way, she encounters and defeats many challenges, proving to herself she is worthy of her destiny, as her grandmother told her countless times. She discovers she can do anything she sets out to do no matter what other people say about her.  “Moana” emphasizes the importance of friendships, nature and community.  The film also proudly embraces Polynesian culture and traditions. <\/span>\r\n\r\n<strong>The Music<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Lin-Manuel Miranda, creator of the Broadway musical “Hamilton,” elevates the movie with an incredible soundtrack, full of his classic literary rhythm and hip hop flair. Miranda’s influence is strongly reflected in the character-performed musical numbers, including standouts “How Far I’ll Go” and “You're Welcome.” Miranda, along with<\/span><span style=\"font-weight: 400;\"> Opetaia Foa'i, the lead singer of the South Pacific fusion band Te Vaka, and Disney composer-arranger Mark Mancina gives Moana a unique sound unlike that of earlier movies. The soundtrack drives the plot and enhances the films ambient surroundings. <\/span>\r\n\r\n[caption id=\"attachment_127166\" align=\"alignright\" width=\"375\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/moana-disney-movie.jpg\"><img class=\"wp-image-127166\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/moana-disney-movie.jpg\" alt=\"moana disney movie\" width=\"375\" height=\"281\" \/><\/a> The character Moana smiles into the sunset. Throughout the movie, Moana follows her heart and embraces her adventurous nature in order to save her family. Photo: Walt Disney animations.[\/caption]\r\n\r\n<strong>The Girl <\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Through Moana’s character, the message of female empowerment and courage comes through as well as the importance of following one's heart. Moana follows her heart and embraces her adventurous nature to save her family. She is courageous and unwilling to compromise what she believes for others. Her goal is to save her island and her people, not to marry a prince. At the end of the movie Moana does not end up with a man and instead saves the island and returns to her family. This is refreshing because it sends a message that Moana did not need a man to validate her victory and that there is more to life than meeting and falling in love with a prince. This powerful female lead is voiced by a 16-year-old <\/span><span style=\"font-weight: 400;\">Mililani, Hawaii native, Auli’i Cravalho. Cravalho was discovered by Disney while singing at a charity event in Oahu, Hawaii. Additionally, Moana does not look like princesses from the past. Moana is different in that she has a more realistic body type. She<\/span><span style=\"font-weight: 400;\"> is also physically active throughout the movie, showing off her strength and ability to face dangers. Through Moana’s physical ability, courage, body type and unwillingness to settle for anything less than what she believes in, the movie goes against societal norms of what a woman should be. <\/span>\r\n\r\n<strong>The Characters<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Many of the characters in “Moana” are voiced by famous actors such as former WWE fighter Dwayne \"The Rock\" Johnson, Jemaine Clement and Nicole Scherzinger, most of whom have roots in the Pacific Islands. According to<a href=\"http:\/\/www.vanityfair.com\/hollywood\/2016\/11\/moana-oceanic-trust-disney-controversy-pacific-islanders-polynesia\"> Vanity Fair<\/a>, the cast, with help of the screenwriter was able to subtly add their experience of Pacific culture into their characters. The voice of Moana herself, <\/span><span style=\"font-weight: 400;\">Carvalho, shines throughout the film with natural talent in acting and music. The way that she played Moana made her a relatable character for the audience. Johnson is also a star in the movie. Although Johnson is known for usually acting as tough men in movies, he plays a character who has a soft interior and even breaks into a catchy song in the film. <\/span>\r\n\r\n<strong>The Animation<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">The graphics and animation in this film are hypnotizing. Immediately from the first second of the film, to the very last, the scenes were filled with bright, vibrant scenes of nature and culture. The characters are incredibly realistic and relatable and the way they were portrayed led to laughter and tears from the audience. Because of the film is set in the Polynesian islands, \"Moana\" also required many technological upgrades regarding the animation of water and even hair in order to make it more expressive.  A lot of research went into developing an authentic cultural atmosphere in the film. According to V<a href=\"http:\/\/www.vanityfair.com\/hollywood\/2016\/11\/moana-oceanic-trust-disney-controversy-pacific-islanders-polynesia\">anity Fair<\/a>, creators John Musker and Ron Clements went on various trips to the Polynesian islands before starting on Moana. For all authentic details, they consulted the <a href=\"http:\/\/www.vanityfair.com\/hollywood\/2016\/11\/moana-oceanic-trust-disney-controversy-pacific-islanders-polynesia\">Ocean Trust<\/a>, a group of specialists from the islands, integral in shaping the culturally accurate fine details, such as Maui's hair and accurate lyrics. These advances were extremely effective as the graphics looked incredibly realistic and natural throughout the entire film.<\/span>\r\n\r\nOverall, Moana was a refreshing wave in the Disney princess collection, with endearing characters, an incredible music soundtrack and an empowered female led. It's a movie you won't want to miss.\r\n\r\n&nbsp;","excerpt":"Walt Disney Animation Studios, famously known for its animated princess movies such as “The Princess in the Frog,” “Cinderella,” and “Brave,” recently came out with yet another inspiring princess movie titled “Moana.” With a beautiful message about female empowerment and cultural appreciation, Disney finally perfected an inspiring princess movie for not only young girls but people of all ages and cultures.","date":"2016-12-13 16:49:56","author":"Emilia Diaz-Magaloni","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/Screen-Shot-2016-12-08-at-9.12.17-PM.png","categories":["Entertainment","Reviews","Spotlight"],"tags":["Auli'i Cravalho","disney","Lin Manuel Miranda","Moana","movie","review","voice"]},{"id":127245,"title":"Dear admin: Reduce stress, extend review days","permalink":"http:\/\/palyvoice.com\/2016\/12\/12\/dear-admin-reduce-stress-extend-review-days\/","content":"Dear Palo Alto High School Administration,\r\n\r\n<span style=\"font-weight: 400;\">This weekend, libraries, coffee shops and cafés were flooded with sleep-deprived high school students, their heaps of study materials and empty coffee cups engulfing tables and countertops. This is the universal indicator that it is that time of year yet again: first semester final exams. It is no secret that the stress of finals places a heavy burden on the already overloaded shoulders of Paly students. Fortunately, you provided us with a precious 140 minutes of review per class on the Friday, Monday and Tuesday before finals. While we appreciate your efforts to reduce the stress on our strained student body, we are running into the same problem that we have with many of your endeavors — it is simply not enough.<\/span>\r\n\r\n[caption id=\"attachment_127319\" align=\"alignright\" width=\"366\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15388804_571942243011801_1270580781_o.jpg\"><img class=\" wp-image-127319\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15388804_571942243011801_1270580781_o.jpg\" alt=\"Junior Chloe Iglehart studies diligently at a local Starbucks. Photo by Maya Reuven.\" width=\"366\" height=\"274\" \/><\/a> Junior Chloe Iglehart studies diligently at a local Starbucks. Photo by Maya Reuven.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">During these three days of review, teachers are instructed to not assign or collect any assignments, theoretically allowing students to have the time to review their seemingly endless pile of notes from the past semester. This is a daunting task, even with the extra time. However, this period is not nearly long enough for a student to study seven classes' worth of semester long material.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As any Paly student has realized, their finals studying must begin far before the school’s allotted review days. Maybe this would be possible if the remainder of the week leading up to finals was treated as a normal work week, as one may expect it to be. Instead, however, teachers use this time to wrap up all of their major assignments from the semester, leaving many students with an even more rigorous work load than any given week during the past four months. As a student, it’s hard to worry about your math final in the same week that you have two tests, three projects and two presentations. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">So, what is the solution? <\/span>\r\n\r\n<span style=\"font-weight: 400;\">We propose that next semester, you extend our review period two extra block periods in total. This would give students that crucial study time necessary to excel in their finals, while only taking away a single class period from teachers, still allowing plenty of time to conclude their semester’s material.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">These extra two days of review would significantly decrease the stress of reviewing an entire semester of information in a period of three days. As expected, at the end of the semester, students are swamped with last unit tests, projects and presentations that cause an unimaginable amount of stress as it is. Take our friend Marissa Ludwig for example, who had three tests in her hardest classes this week. \"Not only is that the first time I’ve had more than two tests back to back, but it also prohibited me from being able to start studying for finals because I was worried about the unit tests,\" she told us, with exhaustion apparent in her tired eyes.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">It is unreasonable to expect that during this time students can begin reviewing independently. Instead, it exponentially increases the pressure on them, as they take on the arduous task of cramming 18 weeks' worth of material into a measly few days. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">We do want to acknowledge the hard work of our teachers to schedule lessons for an immense amount of material in such a short span of time. This is why we believe that expanding our review period a mere even — and — odd block day is the best solution, and the most effective way to ensure that the needs of our student body are being met without shifting that pressure onto our staff. Teachers can certainly find a way to spread out that missing 90 minutes of instructional period throughout the semester. This minor adjustment on their part could make a major difference in our student body wellness, an issue that Paly has struggled with for years.<\/span>\r\n\r\nA second problem presents itself for classes that do not have final exams. For these teachers, extending the review period creates an array of difficulties, especially when it comes to keeping students engaged. For such classes, we are more than willing to compromise. Those teachers whose classes do not have a final exam of some sort may continue to assign classwork and homework as per usual, because if there is no special circumstance towards the end of the semester for their course, we see no reason why it should not continue normally. However, we urge these instructors to bear in mind the work load that students are faced with in other courses, and make adjustments to their curriculum accordingly. The student body would be placing a large amount of trust in these instructors to be flexible, which is critical to the success of this arrangement.\r\n\r\n<span style=\"font-weight: 400;\">We asked Kathleen Laurence, assistant principal of innovation and learning, why this extension has not already been put into play. Her response ultimately came down to a matter of time. \"<\/span>The first semester is shorter than the second semester, so I think it would be difficult to extend it [the review days],\" she told us.<span style=\"font-weight: 400;\"> However, again, we feel that two days is a minor concession, and we believe that many students would be willing to give up a day or two of their summer vacation if it meant having this major stress reliever come winter time. Laurence told us herself, \"That doesn’t mean it can’t be opened up for discussion. It just isn’t currently on the [administration's] radar.\" Our hope is that this letter begins the process of opening the discussion, and sheds a light on an issue that students have been faced with for years.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">We know that you have done a lot to help decrease the stress of the students, from keeping the library open late, to giving students free dinners, to bringing in therapy dogs and we sincerely appreciate it all. However, when it comes down to it, our peers would reap the most benefits from an extra day of review in each class. This issue may not be one that is currently on the administration's radar, but something that causes a profound amount of stress certainly should be. We hope that you will take our concerns into consideration, and turn Paly's review period into one in which students can truly review. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Respectfully yours,<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Maya and Maya<\/span>\r\n\r\n&nbsp;","excerpt":"While we appreciate your efforts to reduce the stress on our strained community, we are running into the same problem as we have with all of your endeavors - it is simply not enough.\r\n","date":"2016-12-12 19:33:35","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/15388804_571942243011801_1270580781_o.jpg","categories":["Opinion","Spotlight"],"tags":["finals","School","Stress","study","tests","winter"]},{"id":127353,"title":"Slideshow: girls&#8217; soccer dominates El Camino","permalink":"http:\/\/palyvoice.com\/2016\/12\/11\/slideshow-girls-soccer-dominates-el-camino\/","content":"<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1K3UOMsmY4v3kEbxUZXXiU58CIXT-UUGaOKe-xIp8D-Y\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"700\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"","date":"2016-12-11 22:54:49","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7891.jpg","categories":["Sports","Uncategorized"],"tags":[]}]