[{"id":128088,"title":"Slideshow: Girls&#8217; soccer pulls off hard-fought win","permalink":"http:\/\/palyvoice.com\/2017\/01\/17\/slideshow-girls-soccer-pulls-off-hard-fought-win\/","content":"The Palo Alto High School girls' soccer team (8-0-1, 2-0-1) continues its undefeated streak winning 2-0 versus Homestead High School (7-3-2, 1-2) despite a weak showing.\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1sZuAYQEZFVPlILDo9-11IMBSAtsTSrH6ig7pyUp-lu0\/embed?start=true&amp;loop=true&amp;delayms=3000\" width=\"700\" height=\"550\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School girls soccer team (8-0-1, 2-0-1) continues its undefeated streak winning 2-0 versus Homestead High School (7-3-2, 1-2) despite a weak showing.","date":"2017-01-17 19:44:35","author":"Ethan Kao","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8245.jpg","categories":["Sports","Spotlight"],"tags":["girls","homestead","Soccer","undefeated","win"]},{"id":128105,"title":"Girls&#8217; soccer optimistic to keep winning streak alive against Santa Clara","permalink":"http:\/\/palyvoice.com\/2017\/01\/17\/girls-soccer-optimistic-to-keep-winning-streak-alive-against-santa-clara\/","content":"[caption id=\"attachment_128107\" align=\"aligncenter\" width=\"652\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8217.jpg\"><img class=\" wp-image-128107\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8217.jpg\" alt=\"Sophomore Leena Srinivasan passes the ball in the second half. Srinivasan was dominant in the midfield tracking down loose balls and blocking the passing lanes. Photo by Ethan Kao.\" width=\"652\" height=\"481\" \/><\/a> Sophomore Leena Srinivasan passes the ball in the second half. Srinivasan was dominant in the midfield tracking down loose balls and blocking the passing lanes. Photo by Ethan Kao.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Aside from one tie, the Palo Alto girls’ soccer team (8-0-1, 2-0-1) is on a blazing path of victories this season. The Vikings aim to further their hot streak when they face the Santa Clara High School Bruins (5-1-2, 2-0) at 6 p.m. tonight at the Bruins’ homefield. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Bruins are one of the more skilled teams the Vikings play during the regular season, according to senior defender Lauola Amanoni. To secure a win in the upcoming game, the Vikings have prepared during practice by working on their weaknesses: defense and ball movement.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Santa Clara is a pretty good team so this game will surely be a competitive one especially since it's a Santa Clara home game,” Amanoni said. “Since we struggled last game with a couple of defensive style plays, we worked on that. We were able to practice yesterday to fix passes and find more productive ways to get the ball forward.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">After a hard fought loss versus Homestead High School last Thursday, senior forward Tess Preising stresses the importance of practicing the little things.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We need to make the simple plays,” Preising said. “Last game [versus Homestead] we were sloppy with our possessions and were constantly dribbling into trouble. If we make the simple passes and plays, we would be in a better position to score.”<\/span>\r\n\r\nThe Vikings are also conscious of their undefeated streak, and hope to extend the clean record, according to Preising.\r\n\r\n\"I am looking forward to keeping our undefeated streak and obviously scoring a lot of goals this game, but scoring them creatively,\" Preising said. \"Maybe by implementing the plays we've been working on in practice or getting some off a good counter attack.\"\r\n\r\n<span style=\"font-weight: 400;\">Amanoni expressed a mild concern for the game against Santa Clara regarding its under groomed soccer field.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Santa Clara has poor playing field conditions that over the years made it difficult to get good results,” Amanoni said. “Playing every team, we notice that we can never look at a game as an easy win; it ends up making us always play our worst. However, Santa Clara will for sure be a good match.”<\/span>\r\n\r\nPreising revealed a similar view on preparing for the game.\r\n\r\n\"I think this game will be neither easy nor hard, since we've done well against Santa Clara before but I don't think we should have any expectations of what the game could be like,\" Preising said. \"It's a new year and they (Bruins) have new players, we have new players, so it really all comes down to whether we will show a good performance on the field or not today.\"","excerpt":"Aside from one tie, the Palo Alto girls’ soccer team (8-0-1, 2-0-1) is on a blazing path of victories this season. The Vikings aim to further their hot streak when they face the Santa Clara High School Bruins (5-1-2, 2-0) at 6 p.m. tomorrow at the Bruins’ homefield.","date":"2017-01-17 15:01:51","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_8217.jpg","categories":["Sports","Spotlight"],"tags":["bruins","girls","Lauola Amonani","paly","passing","santa clara","season","Soccer","Tess Preising","vikings","winning"]},{"id":128068,"title":"Thursday, Jan. 19 is the last day to add a class","permalink":"http:\/\/palyvoice.com\/2017\/01\/17\/thursday-jan-19-is-the-last-day-to-add-a-class\/","content":"","excerpt":"","date":"2017-01-17 08:51:27","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":128063,"title":"Advisory this week is for all freshmen and sophomores","permalink":"http:\/\/palyvoice.com\/2017\/01\/17\/advisory-this-week-is-for-all-freshmen-and-sophomores-3\/","content":"","excerpt":"","date":"2017-01-17 08:49:36","author":"Chirag Akella","categories":["Ticker"],"tags":[]},{"id":127819,"title":"ASB premieres Throwback Dance","permalink":"http:\/\/palyvoice.com\/2017\/01\/16\/asb-premieres-throwback-dance\/","content":"<span style=\"font-weight: 400;\">Students will soon gather to hear the songs of their middle school days such as Beyoncé’s “Halo” and Taio Cruz’s “Dynamite” at the second Palo Alto High School dance of the 2016-17 school year. Associated Student Body is putting on a “throwback”-themed dance from 7 to 10 p.m. on Friday, Feb. 24 at the Mitchell Park Community Center.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to <\/span>Social Commissioner senior Isabel Black, the “throwback” theme will be focused on middle school music and trends.\r\n\r\n<span style=\"font-weight: 400;\">“We [ASB officers] decided it would be super fun to throw it back to our middle school days,” Black said. “We got the idea for a throwback dance when we were reminiscing on middle school dances and how good the music was.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Students should dress as they might have in middle school, according to Black.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Dress is casual, so feel free to bring out your Abercrombie and silly bands,” Black said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> Sophomore Vivian Feng says the throwback dance is appealing for underclassmen.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“It's a great idea to have another dance,” Feng said. “Since homecoming was with Gunn [High School] and the only other dance is prom, I really support and appreciate that ASB decided to plan another dance. I think that it'll be particularly popular among underclassmen since we can't attend prom.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior Christian Rider hopes to bring back his middle school dance moves in February at the throwback dance.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">\"I remember back at the JLS [Jane Lathrop Stanford Middle School] dances I use to cut a little rug because of the great song selection, so I'll be happy to be able to do that again,” Rider said.<\/span>\r\n\r\nStudents can request any song they would like played at the dance here: <a href=\"https:\/\/docs.google.com\/a\/pausd.us\/forms\/d\/e\/1FAIpQLSelN5wcHHmAHsYfPbk7lCWzx15TCMhMsevdmv6hQByJIfZZTA\/viewform\">https:\/\/docs.google.com\/a\/pausd.us\/forms\/d\/e\/1FAIpQLSelN5wcHHmAHsYfPbk7lCWzx15TCMhMsevdmv6hQByJIfZZTA\/viewform<\/a>.","excerpt":"Students will soon gather to hear the songs of their middle school days such as Béyonce’s “Halo” and Taio Cruz’s “Dynamite” at the second Palo Alto High School dance of the school year. Paly Associated Student Body is putting on a “throwback”-themed dance from 7 to 10 p.m. on Friday, February 24th at the Mitchell Park Community Center.","date":"2017-01-16 15:07:46","author":"Soumya Jhaveri","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-16-at-2.56.04-PM.jpg","categories":["News","Spotlight"],"tags":["ASB","christian rider","dance","Isabel Black","jls","palo alto high school","paly","prom","Throwback","throwbackdance","vivian feng"]},{"id":128025,"title":"Board supports immigrant students, promotes district as sanctuary","permalink":"http:\/\/palyvoice.com\/2017\/01\/15\/board-supports-immigrant-students-promotes-district-as-sanctuary\/","content":"The Palo Alto school board is pursuing a new policy approved with a unanimous vote. During a school board meeting on Tuesday, the board approved a <a href=\"https:\/\/drive.google.com\/file\/d\/0B_Ha6_cxoBV_NThkemhiV19WR0k\/view\">resolution<\/a> that affirms PAUSD's support of immigrant students and families, and states PAUSD should be a sanctuary for students.\r\n\r\n<span style=\"font-weight: 400;\">The new resolution is in line with the ideas of a bill by California Democratic Sen. Kevin de León. According to Patrick McGreevy of the Los Angeles Times, the<\/span><span style=\"font-weight: 400;\"> <a href=\"http:\/\/www.latimes.com\/politics\/essential\/la-pol-ca-essential-politics-updates-senate-leader-proposes-safe-zones-at-1481144070-htmlstory.html\">new bill by de León<\/a> <\/span><span style=\"font-weight: 400;\">will outline the implementation of \"safe zones\" for immigrants in locations like public schools, medical facilities and places of worship, which will prohibit immigration enforcement on such locations. <\/span>\r\n\r\nUnder this proposed bill, immigrant students would be offered a sort of political protection, according to McGreevy. For de León, this is a result of concerns raised following statements made about mass-deportation during the 2016 election cycle.\r\n\r\n<span style=\"font-weight: 400;\">“To the millions of undocumented residents pursuing and contributing to the California dream, the state of California will be your wall of justice should the incoming administration adopt an inhumane and over-reaching mass-deportation policy,” de León said in reference to the <a href=\"http:\/\/leginfo.legislature.ca.gov\/faces\/billNavClient.xhtml?bill_id=201720180SB54\">California Values Act<\/a>.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">PAUSD’s own resolution outlines the board’s policy on providing high-quality public education to both children of legal citizens and to those of undocumented residents. It was developed and revised by the board members themselves.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">This document ensures the safety of all students in PAUSD, according to Supt. Max McGee, who says he “is proud of the education PAUSD serves to every student.” In a <a href=\"https:\/\/www.pausd.org\/explore-pausd\/news\/superintendents-message-boe-resolution-support-immigrant-students\">statement<\/a> released on Thursday, McGee emphasized that PAUSD does not tolerate discrimination based on race, gender, sexual orientation, religion or national origin. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“A<\/span><span style=\"font-weight: 400;\">s educators, we know that students cannot learn when they do not feel welcomed and safe at school,” McGee said in the statement. “For that reason, we work very hard to create and maintain safe learning environments where teachers, students and other staff members can safely learn and work together.\"<\/span>\r\n\r\nSchools are among a relatively short list of locations deemed as “sensitive areas” by the United States Department of Immigration and Custom Enforcement. Sensitive areas are locations in which government enforcement action is taken with an air of caution in order to maintain an environment of safety and tranquility, particularly in places of worship, education, ceremonial practices and medical facilities. The Immigration and Custom Enforcement policy also discourages enforcement actions at schools, except in cases of imminent danger.\r\n\r\nThe resolution states that PAUSD officials will not cooperate with immigration enforcement actions unless specifically required to do so by law, but will not interfere with necessary action carried out by law enforcement. For instance, district staff must respond to questions about students from immigration officers, but will refer them first to the Supt. or his designee, “unless there is an immediate threat to public safety.” Additionally, the resolution states that “PAUSD will not disclose personally identifiable information in a student's ‘educational records’ to outside agencies without written parental consent, judicial order, or lawfully-issued subpoena.”\r\n\r\n<span style=\"font-weight: 400;\">With the passing of this resolution, the Board of Education and Paly administration will be working together to ensure that PAUSD is a “sanctuar[y] for students to the fullest extent allowed by law,” McGee said.<\/span>","excerpt":"During a school board meeting on Tuesday, the board approved a resolution that affirms PAUSD's support of immigrant students and families, and states PAUSD should be a sanctuary for students.","date":"2017-01-15 18:14:01","author":"Bianca Al-Shamari","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/05\/schoolboard051016.jpg","categories":["News","Spotlight"],"tags":["Board of Education","california valuea act","immigrants","Kevin de Leon","McGee","PAUSD","resolution","senate leader","Trump"]},{"id":127942,"title":"Slideshow: Paly girls dominate Mountain View","permalink":"http:\/\/palyvoice.com\/2017\/01\/14\/slideshow-paly-girls-dominate-mountain-view\/","content":"The Palo Alto High School girls' basketball team (9-3, 3-0) continued their undefeated season in league play, defeating the Mountain View Spartans 61-47.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/143ywtI4gQtX54hGMda6xvVbcNKNSIRIVwgrcAcNDaAA\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"650\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"The Palo Alto High School girls' basketball team (9-3, 3-0) continued their undefeated season in league play, defeating the Mountain View Spartans 61-47.\r\n\r\n","date":"2017-01-14 10:53:16","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_85731.jpg","categories":["Slideshow","Sports"],"tags":["2016","basketball","carly leong","CCS","girls","gunn","juniors","new","palo alto","palo alto high school","paly","review","School","seniors","skylar burris","slideshow","sports","student","vikings"]},{"id":127849,"title":"Girls&#8217; soccer hopes to stay undefeated against Homestead","permalink":"http:\/\/palyvoice.com\/2017\/01\/12\/girls-soccer-hopes-to-stay-undefeated-against-homestead\/","content":"[caption id=\"attachment_127359\" align=\"alignnone\" width=\"596\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7891.jpg\"><img class=\" wp-image-127359\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7891.jpg\" alt=\"Senior midfielder Talia Malchin passes the ball upfield against Gunn in December. Photo by Rachel Code.\" width=\"596\" height=\"438\" \/><\/a> Senior midfielder Talia Malchin passes the ball upfield against Gunn in December. Photo by Rachel Code.[\/caption]\r\n\r\nThe Palo Alto High School Girls’ soccer team (7-0-1, 1-0) looks to continue its dominant start by defeating Homestead High School (4-3, 4-2) at 3:30 p.m. on Thursday at Paly.\r\n\r\n<span style=\"font-weight: 400;\">With the Vikes undefeated this season thus far, the team is focusing on the details, according to junior midfield Emily Tomz. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have been focusing on dynamic runs forward and making all opportunities count,” Tomz said. “We have to be confident and beat them with our speed and technical skill.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Senior forward Tess Preising stressed the need to stay steady in the team's style of play.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“This season so far we are undefeated, and we have managed to stay pretty consistent in our play,” Preising said, “We need to continue to stay hungry to score and not give up easily even when we are ahead.”<\/span>\r\n\r\nThe Vikings are playing well, but there is still much to work on, according to Preising.\r\n\r\n<span style=\"font-weight: 400;\">“Although we have been getting better and building chemistry, we need to play more as a team and work together as a unit rather than just individuals,” Preising said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">As the team looks to prepare for CCS, Tomz believes the team should simply enjoy the game.<\/span>\r\n\r\n“When we are out there staying focused but also having fun, we play our best soccer,” Tomz said.","excerpt":"The Palo Alto High School Girls’ soccer team (7-0, 1-0) looks to continue its dominant start by defeating Homestead High School (4-3, 4-2) at 3:30 p.m. on Thursday at Paly.","date":"2017-01-12 11:41:51","author":"Sam Lee","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/12\/IMG_7891.jpg","categories":["Sports"],"tags":["emily tomz","girls","homestead","paly","preview","Soccer","sports","Tess Preising","vikings"]},{"id":127957,"title":"Fallen tree disrupts morning traffic","permalink":"http:\/\/palyvoice.com\/2017\/01\/12\/fallen-tree-disrupts-morning-traffic\/","content":"[caption id=\"attachment_127964\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0010.jpg\"><img class=\"size-full wp-image-127964\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0010.jpg\" alt=\"A California Live Oak tree lays on the ground in front of the Palo Alto High School bell tower on Thursday morning. The tree blocked off part of the El Camino parking lot, causing increased traffic. Photo: Rachel Code.\" width=\"600\" height=\"400\" \/><\/a> A California Live Oak tree lays on the ground in front of the Palo Alto High School bell tower on Thursday morning. The tree blocked off part of the El Camino parking lot, causing increased traffic, according to campus supervisor Carl Hubenthal. Photo: Rachel Code.[\/caption]\r\n\r\nThe Palo Alto High School administration is waiting on landscape clearing personnel to remove a large California Live Oak tree that fell into the El Camino parking lot next to the tower building this morning.\r\n\r\nThe tree fell between 6 a.m. and 7 a.m., according to landscape worker José Guzman. This disturbance also affected parking traffic, according to campus supervisor Carl Hubenthal.\r\n\r\n\"Traffic was a lot slower than normal,\" Hubenthal said. \"We still got pretty much everybody cleared by about 8:20 [a.m.], but usually we clear people by 8:15 [a.m.]. We had to stay out here [in the parking lot] and the cones are still up so that people still take it slow. We had to block off one of the turns because the tree is totally in the way.\"\r\n\r\nHubenthal says that administration is waiting on landscape clearing company workers to come cut up and clear the tree, but that district-wide demand due to recent stormy weather is slowing the process.\r\n\r\n\"It should be [cleared] a couple of hours from now,\" Hubenthal said. \"The district is having a lot of trees that are down, so they are having to do this [clear trees] on all of the campuses. Hopefully it will be in the next hour [8:30 to 9:30 a.m.], but it might not be until lunch.\"\r\n\r\nAccording to Hubenthal, the tree's fall can attributed to the effects of the California drought and recent weather.\r\n\r\n\"After a long period of drought where the roots [of a large tree] are very dry, air pockets form in the roots of the tree and the roots shrink,\" Hubenthal said. \"Then, when you get a heavy downpour or a long, steady rain after that, just the weight of the tree will pop it right out of the ground.\"\r\n\r\nCampus workers will be checking other similar trees at Paly to confirm that students and staff are safe on campus, according to Hubenthal.","excerpt":"The Palo Alto High School administration is waiting on landscape clearing personnel to clear a large California Live Oak tree that fell into the El Camino parking lot this morning.","date":"2017-01-12 09:56:13","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DJI_0011-1.jpg","categories":["News","Spotlight"],"tags":["admin","administration","california live oak","el camino","Fall","fallen tree","guzman","hubenthal","landscape","palo alto high school","parking","traffic","tree"]},{"id":127878,"title":"Teen Arts Council movie night to feature &#8216;The Princess Bride&#8217; Friday","permalink":"http:\/\/palyvoice.com\/2017\/01\/12\/teen-arts-council-movie-night-to-feature-the-princess-bride-friday\/","content":"<p style=\"text-align: left;\">The Teen Arts Council will host a movie night as its first event of the year at 7 p.m. on Friday at the Mitchell Park Teen Center.<\/p>\r\n\r\n\r\n[caption id=\"attachment_127880\" align=\"alignleft\" width=\"247\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/15978742_697806837053851_1936034819_n1.jpg\"><img class=\"wp-image-127880\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/15978742_697806837053851_1936034819_n1.jpg\" alt=\"15978742_697806837053851_1936034819_n\" width=\"247\" height=\"357\" \/><\/a> The official poster for the event, designed by Paly senior Claire Eberhart.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The featured film for this year’s annual movie event will be \"The Princess Bride<\/span><span style=\"font-weight: 400;\">.\"<\/span><i><span style=\"font-weight: 400;\"> <\/span><\/i><span style=\"font-weight: 400;\">Admission is free, but concessions will be sold at the event as a fundraiser for the TAC.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">While there is no official theme this year, the infamous date of Friday the 13th will play a role in the evening’s decor. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Movie night does fall on Friday the 13th,” movie night event co-organizer and Palo Alto High School junior Alexandra Dinu said. “The place will be set up to sort of reflect the eerie and suspenseful mood that is so well known with that date.”<\/span>\r\n\r\n\"The Princess Bride,\" told from the perspective of a grandfather reading a fairytale to his grandson, details the story of Buttercup, a former farm girl who has been chosen by Prince Humperdinck to be his bride. However, Buttercup is still in love with a man named Wesley, who was lost at sea. Pirates, thieves, giants, royalty and a kidnapping all come together in this classic romantic comedy.\r\n\r\n<span style=\"font-weight: 400;\">According to junior Publicity Coordinator Nandini Relan, the TAC is comprised of a group of teenagers from the Palo Alto area who have a passion for art and wish to share that enthusiasm with the student population. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We plan all sorts of events throughout the year, [such as] recurring open mics and poetry slams,” Relan said. “All of these events are run almost entirely by high school students.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition to its focus on the arts, the TAC wishes to provide a place for students to decompress through events such as this upcoming movie night. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We provide a safe space for teens to come and de-stress,” Relan said. “It's a super happy environment to be in.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The event was originally planned for finals week, but was moved to this weekend to improve student attendance. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We decided this year that it may be easier to just do it [this Friday] when everyone can just relax more fully and seniors are mostly done with applications,” Dinu said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The TAC encourages students of all backgrounds and interests to come.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“A lot of the time, people think it's just us in Teen Arts Council or just our close group of friends,” Dinu said. “But a huge reason why we have this event [movie night] is to bring people from different backgrounds together to meet and just relax together and have a fun evening.”<\/span>\r\n\r\nFor those who can't make it to this Friday's event, the TAC will also be hosting a poetry slam on Jan. 27, and an open mic night on Feb. 10, according to Relan.","excerpt":"The Teen Arts Council will host a movie night as its first event of the year at 7 p.m. on Friday, at the Mitchell Park Center.","date":"2017-01-12 09:27:27","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2014\/09\/IMG_0783.jpg","categories":["Uncategorized"],"tags":["friday","friday the 13th","movie night","tac","the princess bride"]}]