[{"id":128356,"title":"Girls&#8217; basketball aids Quad Night sweep with destruction of Gunn","permalink":"http:\/\/palyvoice.com\/2017\/01\/28\/girls-basketball-aids-quad-night-sweep-with-destruction-of-gunn\/","content":"[caption id=\"attachment_128755\" align=\"alignright\" width=\"365\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/012717-Girls-Varsity-BB-vs-Gunn_DH-8069.jpg\"><img class=\" wp-image-128755\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/012717-Girls-Varsity-BB-vs-Gunn_DH-8069.jpg\" alt=\"skylar\" width=\"365\" height=\"243\" \/><\/a> Senior forward Skylar Burris lunges for a layup in the third quarter against the cross-town rival Gunn High School Titans. Burris led all scorers with a game-high 31 points, as the Vikings cruised to a, 61-45, win. Photo by David Hickey.[\/caption]\r\n\r\nSenior forward Skylar Burris grabs the rebound and sprints down the court and the Palo Alto High School student section quickly rises to its feet, excited to see what she will do next. Burris attacks the hoop and finishes off her layup, scoring two of her game-high 31 points, and the student section erupts into cheer as the Paly girls' basketball team (14-3, 7-0) continues the onslaught of the Gunn High School Titans (9-10, 3-4). Led by Burris and a strong defensive performance in the second and third quarter, the Vikings were able to steamroll the Titans, 61-45.\r\n\r\nBurris led the Vikings to a dominant victory, leading the team in scoring, whilst grabbing six rebounds, two assists and a steal.\r\n<div class=\"_1t_p clearfix\">\r\n<div class=\"_41ud\">\r\n<div class=\"clearfix _o46 _3erg _29_7 direction_ltr text_align_ltr\">\r\n<div id=\"js_41\" class=\"_3058 _ui9 _hh7 _s1- _52mr _3oh-\" data-tooltip-content=\"1:18pm\" data-hover=\"tooltip\" data-tooltip-position=\"right\">\r\n\r\n<span class=\"_3oh- _58nk\">\"My team needed me to score this game, so I knew I had to step up to do so,\" Burris said. \"I was sent to the free throw line a lot last night, so a lot of my baskets were easy points.\"<\/span>\r\n\r\nJunior Carly Leong filled up the stat-sheet, scoring 10 points, collecting five rebounds and dishing five assists. Leong also had a massive impact on the defensive side of the ball, with a block and a steal.\r\n\r\n[caption id=\"attachment_128754\" align=\"alignleft\" width=\"370\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/012717-Girls-Varsity-BB-vs-Gunn_DH-5026.jpg\"><img class=\" wp-image-128754\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/012717-Girls-Varsity-BB-vs-Gunn_DH-5026.jpg\" alt=\"carly\" width=\"370\" height=\"246\" \/><\/a> Leong attacks the hoop against the Titans. Leong has been a force on the offensive side of the team this season, leading the Vikings in scoring, according to Maxpreps. Photo by: David Hickey[\/caption]\r\n\r\nLeong and the Vikings capitalized on their dominant second quarter, where their defensive intensity limited the Titans to only five points in the quarter, and helped the Vikings take an eight point lead into halftime.\r\n\r\nIn the second half, the Vikings hoped to prevent second chance points for the Titans by rebounding well, according to senior Maya Lathi.\r\n<div class=\"_1t_p clearfix\">\r\n<div class=\"_41ud\">\r\n<div class=\"clearfix _o46 _3erg _29_7 direction_ltr text_align_ltr\">\r\n<div id=\"js_2p\" class=\"_3058 _ui9 _hh7 _s1- _52mr _3oh-\" data-tooltip-content=\"1:42pm\" data-hover=\"tooltip\" data-tooltip-position=\"right\">\r\n\r\n<span class=\"_3oh- _58nk\">\"We knew that if we wanted to win we would have to keep them off the boards,\" Lathi said. \"I think we executed our defense and passed the ball really well.\"<\/span>\r\n\r\nIn a dominant third quarter where the Vikings outscored the Titans 20-11, Burris' hot shooting meant secured the nail in the coffin for the Titans.\r\n\r\nFollowing the win, Burris reflected on her final \"Quad Night\" as a member of the Paly girls' basketball team.\r\n<div class=\"_1t_p clearfix\">\r\n<div class=\"_41ud\">\r\n<div class=\"clearfix _o46 _3erg _29_7 direction_ltr text_align_ltr\">\r\n<div class=\"_3058 _ui9 _hh7 _s1- _52mr _3oh-\" data-tooltip-content=\"1:20pm\" data-hover=\"tooltip\" data-tooltip-position=\"right\">\r\n\r\n<span class=\"_3oh- _58nk\">\"It's weird for sure,\" Burris said. \"I thought it was going to be a lot more emotional for me, but we still have the rest of league to get ready for so besides the fans, it's just another game. Compared to the past three years [of games against Gunn], this was one of the most fun. As a team we played great basketball and moved the ball well — it's just an added bonus that so many people came out to support us.\"<\/span>\r\n\r\nBurris had some takeaways after the game on both sides of the ball.\r\n<div class=\"clearfix _o46 _3erg _29_7 direction_ltr text_align_ltr\">\r\n<div id=\"js_40\" class=\"_3058 _ui9 _hh7 _s1- _52mr _3oh-\" data-tooltip-content=\"1:21pm\" data-hover=\"tooltip\" data-tooltip-position=\"right\">\r\n\r\n<span class=\"_3oh- _58nk\">\"We didn't hit our shots like we usually do, and there were definitely some mistakes on the offensive end,\" Burris said. \"However, it proves to us that we can shut down a team on defense and work hard to convert those extra possessions to baskets.\"<\/span>\r\n<div class=\"clearfix _o46 _3erg _29_7 direction_ltr text_align_ltr\">\r\n\r\nThe girls play their next game Wednesday at Mountain View High School (12-6, 4-3), who the Vikings easily dispatched, 61-47, in their previous match up.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"The Vikings bested the Gunn High School Titans (9-10, 3-4) on Friday, 61-45, maintaining the girls' perfect season.","date":"2017-01-28 21:23:18","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16402186_646460092225639_17926382_n.jpg","categories":["Basketball","Sports","Spotlight"],"tags":["basketball","girls","gunn","juniors","maya lathi","new","palo alto","palo alto high school","paly","Quad Night","recap","review","School","seniors","skylar burris","sports","student","vikings"]},{"id":128682,"title":"Vikings gain early lead, annihilate Titans","permalink":"http:\/\/palyvoice.com\/2017\/01\/28\/vikings-gain-early-lead-annihilate-titans\/","content":"Junior shooting guard Spencer Rojahn serves as what is known as a \"role player\"— a team member who specializes in a particular skill set. Rojahn's job? Shoot three-pointers— lots of them. Playing in his second consecutive season on the Palo Alto High School boys' basketball team (16-2, 7-0), Rojahn and fellow three-point juggernaut junior guard Jared Wulbrun, have become the \"splash brothers\" of the Paly team. Rojahn provided the spark to the Vikings' domination of the Gunn High School Titans' basketball team (11-7, 2-5) on Friday, 79-36, hitting a couple three-pointers in the opening minutes, electrifying the crowd and setting the tone for the rest of the night. With half of the regular season in the books, the Vikings remain the top dogs in the De Anza League.\r\n\r\n[caption id=\"attachment_128729\" align=\"alignright\" width=\"475\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/spencer-celebrating.jpg\"><img class=\" wp-image-128729\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/spencer-celebrating.jpg\" alt=\"Junior guard Spencer Rojahn gets pumped up by fellow junior guard Brey Johnson pregame. Rojahn hit two early three-pointers on Friday against Gunn High School. Photo: Rachel Code\" width=\"475\" height=\"298\" \/><\/a> Junior guard Spencer Rojahn gets pumped up by fellow junior guard Brey Johnson pregame. Rojahn hit two early three-pointers on Friday against Gunn High School. Photo: Rachel Code[\/caption]\r\n\r\nOver the course of play, Paly's swarming defense proved to be too much to handle for the Titans. Midway through the second quarter, Paly scored on three consecutive stolen passes and did not allow the Gunn offense to pass the half-court line during those three possessions. A combination of the Viking starting lineups' average height of just under six foot three inches and a strong press defense enabled Paly to play at its desired game tempo and forced countless Titan turnovers.\r\n\r\nTo accompany the exceptional play of the starting lineup,  junior point guard Will Schmutz subbed in for senior starting point guard and team captain Miles Tention in the second half and excited the crowd with 11 points of his own. \"MVP\" chants erupted from the Paly sections following each of Schmutz's baskets. Also off the bench, junior guard Brey Johnson, junior center Bryant Jefferson, senior point guard Ethan Stern and senior guard Jack Simison added to the insurmountable Viking lead with a combined 25 points off the bench. Johnson added the exclamation point on the blowout win with a huge block on a Gunn guard during the closing minutes of the game.\r\n\r\nThe Titans struggled to find their groove on offense, ending the game without a double-digit scorer. Gunn senior forward Jeffery Lee-Heidenreich led the Titans with nine points, and senior guard Josh Radin poured in six of his own.\r\n\r\nPaly head coach Peter Diepenbrock said the Vikings' continued dominance has played a large factor in the team's mindset moving forward.\r\n\r\n\"We've won eight games in a row and we keep improving so it's huge,\" Diepenbrock said. \"This win reconfirms what we're trying to do and it shows that we're going in the right direction.\"\r\n\r\nDespite the lengthy winning streak, Diepenbrock has seen this story before and said the team needs to remain grounded after its successes. Last season, the Vikings headed into the Central Coast Section playoffs having won the majority of the match-ups leading up the first round of CCS but were defeated in the first round.\r\n\r\n\"That's the challenge,\" Diepenbrock said. \"We have to be a much more mature team. Last year we couldn't handle this so hopefully we will keep practicing hard and keep our focus because we have bigger goals than just to win the league.\"\r\n\r\nJunior forward William Schlemmer said the team needs to remain grounded despite the big win and understand that the Vikings will need to continue to improve in order to compete with some of their tougher opponents.\r\n\r\n\"We need to tower on half-court offense because the games we have difficulty in are those where the pace is slower and we can't get buckets in transition,\" Schlemmer said. \"This game shows that we need to be able to play with the intensity of [the Gunn game] every game even though we might not be as excited because if we play as intensely as we do against Gunn, we are hard to stop.\"\r\n\r\nThe Vikings outscored the Titans 21-2 in just under six minutes of play and continued to add to their lead, heading into the half with a sizable 38-18 advantage. Paly would go on to obliterate Gunn for the second and final time this year by a score of 79-36, beating the Titans by 14 more points that the matchup earlier this season. Diepenbrock encourages the Paly community to bring the same roaring energy to the Vikings' next big match-up on Saturday at Menlo-Atherton High School.\r\n\r\n\"Get it done. How much fun could that be?\" Depenbrock said. \"Going into an opposing gym and having the [expletive] place covered. Go to [Menlo-Atherton].\"\r\n\r\nUp next for the Vikings are league rematches against teams the boys already defeated handily. On Tuesday, the Vikings face the Los Altos High School Eagles (10-9, 2-5) at Los Altos and on Friday, Paly faces off against the Wilcox High School Chargers (9-9, 4-3).\r\n\r\n&nbsp;\r\n\r\n&nbsp;\r\n\r\n&nbsp;","excerpt":"The Vikings' dominated the Gunn High School Titans' basketball team (11-7, 2-5) on Friday, 79-36. With half of the regular season in the books, the Vikings remain the top dogs in the De Anza League.","date":"2017-01-28 15:36:18","author":"Noah Yuen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/spencer-celebrating.jpg","categories":["Basketball","Sports","Spotlight"],"tags":["basketball","diepenbrock","gunn","paly","schmutz"]},{"id":128649,"title":"Brief: Skirmish breaks out at Town and Country","permalink":"http:\/\/palyvoice.com\/2017\/01\/27\/brief-skirmish-breaks-out-at-town-and-country\/","content":"[caption id=\"attachment_128660\" align=\"alignnone\" width=\"576\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Image-uploaded-from-iOS.jpg\"><img class=\"wp-image-128660\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Image-uploaded-from-iOS.jpg\" alt=\"Assistant Principal of Operations Jerry Berkson at the scene of the incident at Town and Country. Photo: Emily Hwang\" width=\"576\" height=\"432\" \/><\/a> Assistant Principal of Operations Jerry Berkson and Palo Alto Police Department officers investigating a conflict that occured at Town and Country during lunch yesterday. Photo: Emily Hwang[\/caption]\r\n\r\nThe Palo Alto Police Department is investigating what some call a brawl that broke out between Palo Alto High School students and individuals who do not attend Paly at lunch yesterday at Town and Country Village.\r\n\r\n<span style=\"font-weight: 400;\">\"The police happened to be close by and they were there to stop it before it became a big deal,\" Assistant Principal Jerry Berkson said. \"They [PAPD] are investigating what happened. There were some non-students involved in the fight and from what I can see it looked like they [the non-students] were arrested. I did see some drug paraphernalia and drugs in their car when it was searched, so that's probably why they were arrested.\"<\/span>\r\n\r\nAccording to Berkson, there may have been an ongoing dialogue between the two groups which came to a head yesterday.\r\n\r\n<span style=\"font-weight: 400;\">Punishments for fighting on campus can range anywhere from a warning to a suspension or even an expulsion in extreme circumstances, according to Berkson.<\/span>","excerpt":"The Palo Alto High School Police Department is investigating a brawl that broke out between Palo Alto High School students and individuals who do not attend Paly at lunch today at Town and Country Village.","date":"2017-01-27 19:24:50","author":"Aidan Maese-Czeropski","categories":["News"],"tags":[]},{"id":128354,"title":"Quad Night: Girls&#8217; basketball to take on Gunn","permalink":"http:\/\/palyvoice.com\/2017\/01\/27\/quad-night-preview-girls\/","content":"[caption id=\"attachment_127988\" align=\"alignright\" width=\"347\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16009937_637507056454276_1738670975_o.jpg\"><img class=\"wp-image-127988 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16009937_637507056454276_1738670975_o.jpg\" alt=\"Palo Alto High School students support their Vikings during &quot;Quad Night&quot;, where all four Paly basketball teams take on all four Gunn teams in a row.\" width=\"347\" height=\"231\" \/><\/a> Palo Alto High School students support their Vikings during \"Quad Night,\" where all four Paly basketball teams take on all four Gunn High School teams in a row. Photo by Maya Reuven.[\/caption]\r\n\r\nFresh from a big win over arch-rival Los Gatos High School on Wednesday, the Palo Alto High School Girls' basketball team (13-3, 6-0) is looking to maintain its undefeated season in its second and final matchup against a solid Gunn High School Titans squad on at 6 p.m. on Friday at Gunn.\r\n\r\n<span style=\"font-weight: 400;\">The last time the teams met, Paly came out victorious, defeating Gunn, 72-63. The Vikings struggled to maintain possession during the first half, they outscored the Titans, 25-14, in the second half, capitalizing on turnovers forced by playing stiff defense.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings are ranked first in the De Anza League, according to <a href=\"http:\/\/www.maxpreps.com\/high-schools\/palo-alto-vikings-(palo-alto,ca)\/girls-basketball\/home.htm\">Maxpreps<\/a>. Gunn sits in third place, tied with two other teams.<\/span>\r\n<div class=\"_4u-c _1wfr _9hq\">\r\n<div class=\"_5f0v uiScrollableArea fade contentBefore\" tabindex=\"0\">\r\n<div class=\"uiScrollableAreaWrap scrollable\">\r\n<div class=\"uiScrollableAreaBody\">\r\n<div class=\"uiScrollableAreaContent\">\r\n<div class=\"__i_\">\r\n<div id=\"js_1\">\r\n<div class=\"_1t_p clearfix\">\r\n<div class=\"_41ud\">\r\n<div class=\"clearfix _o46 _3erg _29_7 direction_ltr text_align_ltr\">\r\n<div id=\"js_fdn\" class=\"_3058 _ui9 _hh7 _s1- _52mr _3oh-\" data-tooltip-content=\"9:53pm\" data-hover=\"tooltip\" data-tooltip-position=\"right\">\r\n\r\n<span class=\"_3oh- _58nk\">\"Being ranked first in league hasn't changed our mindset that much,\" senior forward Maya Lathi said. \"We can't take any game for granted and understand that we need to continue improving if we want to continue on this trajectory.\"<\/span>\r\n<div class=\"_mh6\">\r\n\r\n<span style=\"font-weight: 400;\">The Titans are coming off a, 60-50, loss against Mountain View High School (11-6, 3-3), whom the Vikings beat handily, 61-47. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Paly students are going to be sporting white for the \"Whiteout\" theme, chosen by the Paly Sixth Man Club.<\/span>\r\n\r\n\"<span class=\"_3oh- _58nk\">It will be great to see all the Paly fans in white in the stands, especially since Gunn plans on wearing black,\"<\/span> senior David Tayeri said.\r\n\r\nThis will be the final \"Quad Night\" for seniors Lathi, Skylar Burris, Lauren Koyama, Julie Chandler and Nora Danie, who are excited to experience the electric atmosphere one last time.\r\n\r\n\"It's definitely surreal to imagine that four years on varsity have lead to my last game against Gunn\", Burris said. \"They're always the most fun games of the year and it's the best to see everyone there to support you and the team. We just have to go in and leave it all on the court. If we aren't exhausted by the end of the night, we didn't work hard enough.\"\r\n<div class=\"_4tdt _ua0\">\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","excerpt":"Carrying its momentum from a big win over arch-rival Los Gatos High School, the Palo Alto High School Girls' basketball team (13-3, 6-0 isn't fazed about its second and final matchup against a solid Gunn Titans squad on at 6 p.m. on Friday at Gunn.","date":"2017-01-27 16:24:12","author":"Kasra Orumchian","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16009937_637507056454276_1738670975_o1.jpg","categories":["Sports","Spotlight","Uncategorized"],"tags":["#palyspirit","2016","basketball","Boys","CCS","gunn","palo alto","palo alto high school","paly","preview","Quad Night","review","seniors","skylar burris","sports","student","vikings"]},{"id":128406,"title":"Students dominate Winter Rally soccer game","permalink":"http:\/\/palyvoice.com\/2017\/01\/26\/students-dominate-winter-rally-soccer-game\/","content":"\"Look at Chinmay go!\" senior, game commentator, Andrew Vargha exclaimed over the loud speaker as senior team member Chinmay Tyagi dribbled across the field. \"It makes you wonder how he didn't make the Varsity [soccer] team.\" The student spectators erupted in laughter as the senior class soccer team won the Winter Rally staff vs students competition at brunch today on the Palo Alto High School football field with a score of 4-1.\r\n\r\nThe rally consisted of the student vs teacher soccer game, performances by the cheer and dance teams and the <a href=\"http:\/\/palyvoice.com\/2017\/01\/26\/prom-location-revealed\/\">reveal of the Prom 2017 location<\/a>.\r\n\r\nAccording to senior team coach Thomas Crouch, the student team's hard work helped them find success.\r\n\r\n\"We played really well as a team,\" Crouch said. \"We had a lot of great passing and our defense was on point. At the end of the day, we were able to put the ball in the back of the net.\"\r\n\r\nThe student team struggled with passing during the first half, but managed to maintain their lead in the game, according to Crouch. Senior Chinmay Tyagi says the senior team's play was very strong.\r\n\r\n\"It was a team effort and we played really well,\" Tyagi said. \"It would have been nice to not concede that goal, but it was pretty great overall.\"\r\n\r\nThe game began with a goal from math teacher John Rowe, which was immediately followed by a retaliation goal by senior Naveen Pai for the student team. Before the end of the first half, senior Sam Lee scored another goal for the students, ending the first half with a score of 2-1.\r\n\r\nIn the second half, the students dominated with strong defensive play and maintained control of the ball, which they needed to keep their lead. Tyagi and senior Dylan Williams worked together on offense, and both scored goals for the students.\r\n\r\nClick through this slideshow to see more of what happened at the Winter Rally today.\r\n\r\n<iframe src=\"https:\/\/docs.google.com\/presentation\/d\/1vhYtfVmocotbY6tjMByotWXt2P-hfWFQwpnaFU97xZ4\/embed?start=false&amp;loop=false&amp;delayms=3000\" width=\"665\" height=\"472\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe>","excerpt":"\"Look at Chinmay go!\" senior, game commentator, Andrew Vargha exclaimed over the loud speaker as senior team member Chinmay Tyagi dribbled across the field. \"It makes you wonder how he didn't make the Varsity [soccer] team.\" The student spectators erupted in laughter as the senior class soccer team won the Winter Rally staff vs students competition at brunch today on the Palo Alto High School football field with a score of 4-1.","date":"2017-01-26 21:15:07","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0085.jpg","categories":["News","Spotlight"],"tags":["palo alto high school","paly","prom","Soccer","soccer game","Staff","students","winter rally"]},{"id":127987,"title":"Committees to enhance student experience","permalink":"http:\/\/palyvoice.com\/2017\/01\/26\/committees-to-enhance-student-experience\/","content":"[caption id=\"attachment_127989\" align=\"alignnone\" width=\"644\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16009937_637507056454276_1738670975_o1.jpg\"><img class=\"wp-image-127989 \" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16009937_637507056454276_1738670975_o1.jpg\" alt=\"16009937_637507056454276_1738670975_o\" width=\"644\" height=\"429\" \/><\/a> Fans at the annual \"Quad Night\" cheer for the boys' varsity basketball team on Jan. 6. Palo Alto High School students supported the team as well as the Athletic Advisory Council through a jersey sale fundraiser. Photo: Noah Yuen.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Classic basketball jerseys, three-point contests, mindfulness and school climate; over the past year various committees have formed to improve the student experience at Palo Alto High School.<\/span>\r\n\r\nWhile there is no one set way to form a committee, most are focused around a school or district wide goal, according to Assistant Principal Victoria Kim.\r\n\r\n\"Usually there is a faculty member who leads this processor for a particular committee,\" Kim said. \"In most cases, we want a good representation of all stakeholders staff, students and parents.  Sometimes, committee members are nominated and then invited, and other committee members are chosen through an application process.\"\r\n\r\nRead on to learn about the people behind your soon-to-be favorite Paly initiatives and traditions.\r\n\r\n&nbsp;\r\n\r\n<strong>Athletic Advisory Council: Enhancing your experience as a Vikings’ sports fan<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">Under the supervision of Athletic Director Kathi Bowers and Asst. Athletic Director Therren Willburn, 30 student-athletes have come together in hopes of improving involvement within the department.<\/span>\r\n\r\n“The purpose of the council is to give Mrs. Bowers light into what the athletes want and we work to create experiences that are more fun for the fans and players,” senior council member Peter Snodgrass said.\r\n\r\n<span style=\"font-weight: 400;\">In addition to providing insight into the daily life of a student-athlete, the council aims to encourage its peers to attend games through incentives such as raffles. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We have been planning events for boys' basketball,\" Snodgrass said. \"We were a little quiet first semester because we were gearing up and working up to events.\"<\/span>\r\n\r\nThe council is in the process of selling raffle tickets, according to Snodgrass.\r\n\r\n<span style=\"font-weight: 400;\">So far we have made money selling old basketball jerseys, and with those funds we are going to raffle off a pair of Beats [headphones] at the next Paly vs. Gunn basketball game.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Not only does the council want to continue to support Paly teams such as boys’ and girls’ basketball through three-point and half-court contests, but it also aims to encourage attendance to sports that are often overlooked.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think we’ll soon grow to have more involvement in trying to reach sports that aren’t usually recognized such as wrestling, swimming and badminton,” Snodgrass said. “We want to try and make it so that more fans will want to go.”<\/span>\r\n\r\nIn the future, the council aims to expand the athletics department. In an effort to integrate more of the student body, one of the council's goals is to provide roles to students who are not necessarily athletes.\r\n\r\n<span style=\"font-weight: 400;\">“Right now we’re hoping to get more student involvement within sports, not just athletics as in being a player on the team, but being an announcer, statistician or a team manager,” Snodgrass said.<\/span>\r\n\r\n<strong>Wellness Committee: Integrating various wellness efforts<\/strong>\r\n\r\n<span style=\"font-weight: 400;\">The seven-person School Climate and Wellness Committee works with an intention to improve the well-being of students and staff at Paly by helping students de-stress.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We focus on mental health and communication between students and teachers, the state of the relationships between administrators and students, as well as students and parents,” senior committee founder Cezanne Lane said.<\/span>\r\n\r\nThe committee also aims to help the various already existing wellness-related groups on campus work together. The point of this committee is to bring all the student efforts together and to act as a liaison among them.\r\n\r\n<span style=\"font-weight: 400;\">“There are different efforts going on in the realms of wellness,\" Lane said. \"There’s Sources of Strength, as well as teacher, administration and board wellness efforts.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">This year, the committee will be hosting Change in Our Schools Week (previously known as Not in Our Schools Week), and it is hopeful that involving several initiatives will strengthen the event. Working alongside science teacher Josh Bloom and Mental Health and Wellness Coordinator Jonathan Frecceri, co-leaders of Sources of Strength, the committee will work to dedicate one day to Sources. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Lane, the committee also works with Wellness Outreach Worker Julia Chang and Frecceri through the Wellness Center. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’ve been working really closely with them in planning and executing a lot of our events and ideas, so they’re sort of our support system,” Lane said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Recently the committee hosted a parent education night in the Media Arts Center that featured a panel of students discussing topics including interpersonal relationships, self care and post-high school plans.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Hopefully that [parent ed night] made the parent-student relationship better and we’re relieving general pressure and stress,” Lane said.<\/span>","excerpt":"Classic basketball jerseys, three-point contests, mindfulness and school climate; over the past year various committees have formed to improve the student experience at Paly. Read on to learn about the people behind your soon to be favorite Paly traditions.","date":"2017-01-26 20:41:23","author":"Zahra Muzaffar","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16009937_637507056454276_1738670975_o1.jpg","categories":["Features"],"tags":["athletic","bloom","bowers","Cezanne lane","Committee","council","director","Frecceri","lane","new","peter snodgrass","snodgrass","sources","strength","student athletes","wellness"]},{"id":128343,"title":"Teen Arts Council to host seventh Poetry Jam","permalink":"http:\/\/palyvoice.com\/2017\/01\/26\/teen-arts-council-to-host-seventh-poetry-jam\/","content":"<p style=\"text-align: left;\"><span style=\"font-weight: 400;\">The Teen Arts Council will host its seventh \"Point B\" Poetry Jam from 7:30 p.m. to 9:30 p.m. this Friday, Jan. 27 at the Palo Alto Children's Theatre.<\/span><\/p>\r\nPalo Alto High School seniors Teddie Stewart and Claire Eberhart are organizing the seventh poetry jam, which is a “nonjudgmental environment” where everyone is welcome to perform poetry, according to its <a href=\"https:\/\/www.facebook.com\/events\/1815566765217093\/\">Facebook page<\/a>.\r\n\r\nAccording to Stewart, the Poetry Jam started three years ago, when Stewart and Eberhart were sophomores.\r\n\r\n“It's Point B's second birthday,” Steward said. “We are having cake at the Poetry Jam to celebrate, so if you want cake with a side of poetry, this is the place to be.”\r\n\r\nThe Facebook page explains that the event’s title, “Point B” comes from the idea that “you are Point A and we are Point B. We will always be here for you as an open place for emotional and artistic expression.”\r\n\r\n<span style=\"font-weight: 400;\">According to Eberhart, there will also be a writing workshop held at the Lucie Stern Center from 6 p.m. to 7 p.m. on the day of the event.<\/span>\r\n\r\n“The workshop will be a writing workshop for anyone who wants to participate,” Eberhart said. “It will be run by The <a href=\"https:\/\/www.facebook.com\/stanfordspokenwordcollective\/\">Stanford Spoken Word Collective<\/a>, an award-winning and incredibly talented group of poets who will be bringing us into their whimsical world of poetry.”\r\n\r\nEberhart encourages all students to come watch and perform and is confident there will be something for everyone to enjoy at the event.\r\n\r\n“Students should come if they love stories,” Eberhart said. “In every poem, there's a story and in every person there's a history. If anyone wants to share about themselves or learn about others, they should come. Over the years, we have dedicated Point B Poetry Jam to being an inclusive place, so no matter what you believe in or what you stand for, you're welcome. The Point B community is made up of speakers and listeners and watchers and experiencers.”\r\n\r\nAccording to Eberhart, poems will also be provided at the Poetry Jam for anyone who wants to read them.\r\n\r\nAccording to the Facebook page, all students are welcome and \"if you would like to attend, simply show up.\"\r\n\r\nThe next poetry slam will be held on March 24 and will reflect the theme of nostalgia because it will be the last poetry jam run by Stewart and Eberhart, according to Eberhart.\r\n\r\n&nbsp;","excerpt":"The Teen Arts Council will host its seventh \"Point B\" Poetry Jam from 7:30 p.m. to 9:30 p.m. this Friday, Jan. 27 at the Palo Alto Children's Theatre.","date":"2017-01-26 19:01:30","author":"Aisha Chabane","categories":["Uncategorized"],"tags":["poetry jam","point b","teen arts council"]},{"id":128419,"title":"Prom location revealed","permalink":"http:\/\/palyvoice.com\/2017\/01\/26\/prom-location-revealed\/","content":"[caption id=\"attachment_128556\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0099.jpg\"><img class=\"size-full wp-image-128556\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0099.jpg\" alt=\"Senior ASB officers Natalie Maloney and Joao De-Pina hold up a banner, revealing the Prom 2017 location to the student body. Photo: Maya Akkaraju.\" width=\"600\" height=\"400\" \/><\/a> Senior ASB officers Natalie Maloney and Joao De-Piña hold up a banner, revealing the Prom 2017 location to the student body. Photo: Maya Akkaraju.[\/caption]\r\n\r\nPalo Alto High School's Prom will be at the <a href=\"https:\/\/www.exploratorium.edu\/\">Exploratorium in San Francisco<\/a>, according to an Associated Student Body announcement at brunch today on the football field at the Winter Rally.\r\n\r\nProm will be on Saturday, April 22, this year, according to senior class vice president Natalie Maloney.\r\n\r\n\"We were given a couple of choices, and we decided to go with the Exploratorium,\" Maloney said. \"Having all of the exhibits open while the dance is going on is going to be really cool because in addition to dancing and eating, they [the students] can go around the exhibits and look and play with all of the cool things that they have.\"\r\n\r\nThe Exploratorium is a \"public learning laboratory exploring the world through science, art, and human perception,\" according to its <a href=\"https:\/\/www.exploratorium.edu\/about-us\">website<\/a>.\r\n\r\nAccording to junior class president Jaiveer Sandhu, last year's junior and sophomore ASB officers chose the location in May of 2016.\r\n\r\n\"The Exploratorium has a lot of exciting things inside of the actual museum, so it's exciting to walk around,\" Sandhu said. \"There will be a lot of activities for the students to engage in.\"\r\n\r\nSenior Derek Schoenberger says that revealing the prom location was exciting, pumping students up for what will unfold.\r\n\r\n\"I'm excited that the venue is a more creative location than a formal one like City Hall and those that have happened in the past,\" Schoenberger said. \"I'm looking forward to seeing the exhibits, but mostly the beer goggles.\"","excerpt":"Palo Alto High School's Prom will be held at the Exploratorium, according to the Associated Student Body announcement at lunch today on the soccer field at the Winter Rally.","date":"2017-01-26 12:00:47","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/DSC_0099.jpg","categories":["News","Spotlight"],"tags":["#palyprom","exploratorium","maloney","palo alto high school","paly","prom","prom 2017","sandhu","winter rally"]},{"id":128444,"title":"Paint fumes trigger fire alarm","permalink":"http:\/\/palyvoice.com\/2017\/01\/25\/paint-fumes-trigger-fire-alarm\/","content":"<p style=\"text-align: left;\">Paint fumes from an ongoing construction site set off a Palo Alto High School fire alarm at the beginning of 5th period today.<\/p>\n<p style=\"text-align: left;\">The alarm sounded around 12:15 p.m. According to Assistant Principal Jerry Berkson, the painters working in&nbsp;300B opened a door, sending paint fumes into the open space between the 200 and 300 buildings, setting off the alarm.<\/p>\n<p style=\"text-align: left;\">\"They were painting in there [room 300B], and when they opened the door, the paint fumes set off the detector,\" Berkson said. \"They just have one wall left [to paint], so as long as they keep the door closed, there shouldn't be any more problems.\"<\/p>\nSenior Andrew Vargha says that the fire alarm was a distraction from planned activities and classes.\n\n\"I was getting ready to enjoy my prep, and the fire alarm went off, so that was a good 30-minute distraction,\" Vargha said. \"I know a lot of people have tests today, and some people were about to go take quizzes, so now they're going to have less time for their tests and might have to stay in after class or come after school to finish their tests. It's not good how many issues the fire alarm caused.\"\n\nDespite the delays and problems that the fire alarm causes, the problem is on its way to being fixed, according to Berkson.\n\n\"Maintenance will just deactivate the detector, so that should be done soon,\" Berkson said.","excerpt":"Paint fumes from an ongoing construction site set off a Palo Alto High School fire alarm at the beginning of 5th period today.","date":"2017-01-25 14:44:08","author":"Emma van der Veen","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/IMG_3849.jpg","categories":["News"],"tags":["Berkson","detector","fire","fire alarms","fire drill","football","palo alto","palo alto high school","paly","Vargha"]},{"id":128228,"title":"Independent Study Physical Education program requires modification","permalink":"http:\/\/palyvoice.com\/2017\/01\/23\/independent-study-physical-education-program-requires-modification\/","content":"To ensure students have enough time to balance rest, schoolwork, and sports, the Independent Study Physical Education program at Palo Alto High School should be remedied and offered for all sports, not just for sports not offered at Paly.\r\n\r\nBy making it easier to apply for the program and offering it for all sports, students would be healthier both mentally and physically. Students would also have a better-balanced life.\r\n\r\nAlong with the qualification that a student must play a sport not offered at Paly, he or she must have played the sport for three years prior to applying for Independent Study PE. The student must train year-round for a minimum of 15 hours a week, five to six days a week.\r\n\r\n<span style=\"font-weight: 400;\">However, simply meeting all these standards is not enough to get an Independent Study prep. One must also go through a rigorous application process. This process needs to be easier for all students to apply in order to prevent any student from being deterred from applying. Sophomore Kat Merk has been riding horses since she was seven years old. She trains with her coach three to four hours a day, six to seven days a week. For her, the process of applying for Independent Study PE was long and difficult.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I was very surprised at how lengthy [the Independent Study PE application process] was because I feel like a signature from the coach would be enough,\" Merk said. \"I had to prove that I had been working with her for a certain amount of time, I had to pull out paperwork of contracts, I had to prove that I had been to competitions. It was a little bit too much.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Students in tenth grade at Palo Alto Unified School District schools that have successfully completed ninth grade Physical Education have the option of applying for Independent Study Physical Education, according to the Paly course catalog. A student in Independent Study PE is given a prep period for the entire year instead of taking a PE class. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Paly offers cross country, water polo, football, golf, girls' volleyball, basketball, soccer, wrestling, baseball, lacrosse, swimming and diving, badminton, softball, track as well as cheer and dance. Therefore, students participating in any of these sports are not eligible for Independent Study.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to PE teacher and Independent Study program head Peter Diepenbrock, there is a specific reason students in Paly sports are not eligible for an Independent Study PE prep.<\/span>\r\n\r\n<span style=\"font-weight: 400;\"> “[The purpose of Independent Study PE] is to give students that have been involved in a sport for many years and have dedicated a good portion of their lives to their sport, an opportunity to continue that sport. <\/span><span style=\"font-weight: 400;\">Students [playing a Paly sport cannot get a prep] because if you play a Paly sport, you already have an opportunity to get a prep for it.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Some may argue that this makes sense. However, sports seasons are only a few months long at most. Students that are dedicated to their sport devote hours of their time in the off-season to training. Anyone playing a sport at a high level has hours of practice a day and trains almost every day of the week. Students spend all this time to improve at their sport so that when they go back to their Paly team, the Paly team is stronger.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to PE teacher David Duran, the purpose of PE is to get exercise and socialize with peers. PE helps maintain physical health through exercise and mental health with socialization.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our philosophy is [that] we want you to come and learn a skill, learn some social skills, burn some calories,\" Duran said. \"PE, for the most part, is a very social class, so there is a lot of interaction, unlike some other classes. And for the long range, [our hope] is that you actually value exercise, and 50 years from now you are still active and exercising because there are benefits both for your body and mind to be physically fit,” Duran said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Though I agree with the goals and intents of PE as outlined by Duran, students who already play sports do not need PE to achieve those goals. A student who does over 15 hours of exercise a week clearly understands the value of exercise. While practicing a sport, they learn new skills, socialize, and burn calories. If they are already fulfilling these PE goals, they gain no benefit from taking part in PE.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to the Paly PE syllabus, the three standards for PE are to:<\/span>\r\n<ul>\r\n\t<li><span style=\"font-weight: 400;\">“Demonstrate knowledge and competency in motor skills, movement patterns, and strategies needed to perform a variety of physical activities.\"<\/span><\/li>\r\n\t<li><span style=\"font-weight: 400;\">\"Achieve a level of physical fitness for health and performance while demonstrating knowledge of fitness concepts, principles, and strategies.\"<\/span><\/li>\r\n\t<li><span style=\"font-weight: 400;\">\"Demonstrate knowledge of psychological and sociological concepts, principles, and strategies as they apply to learning and performance of physical activity.”<\/span><\/li>\r\n<\/ul>\r\n<span style=\"font-weight: 400;\">Through playing any sport, a student automatically engages in all of these standards. Playing a sport with the dedication of 15 hours a week means that a student has competent motor skills and movement abilities. They are physically fit and understand fitness concepts as they apply to their specific sport, but also athletics in general. Through coaching, they learn how psychological and sociological concepts affect their sport. It is unfair to assume that a student participating in a non-Paly sport automatically fulfills these criteria if they fulfill the ones required for an Independent Study prep, but a student playing a Paly sport doesn’t. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">A critical reason why students should be given an Independent Study prep for any sport that takes 15 hours per week is because students need the time to work on homework and study. Students agree that this prep is vital to their ability to succeed in schoolwork. Students such as Merk agree.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“[An Independent Study prep] gives you more time to focus on your academics and doesn’t take away from your physical education because you’re doing plenty after school,” said Merk.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Playing a sport is a time-consuming activity. One must factor in not only the length of practice and competitions, but also time for activities such as transport and showering. While students who play 15 hours of sports a week already struggle to fit all of this into their schedule, students without a prep find it even more difficult. Without time during their prep to meet with teachers, work on homework, or study, students may fall behind in their classes. In order to combat this, students have to stay up later at night to work on schoolwork. According to a <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/25028798\">study<\/a> conducted at the <\/span><span style=\"font-weight: 400;\">Harvard-Westlake <\/span><span style=\"font-weight: 400;\">School, getting less than eight hours of sleep a night is the biggest predictor of injury for high school athletes and a quarter of athletes who are injured miss at least a week of playing time.<\/span>\r\n\r\n[caption id=\"attachment_128278\" align=\"alignnone\" width=\"511\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-21-at-9.06.26-PM.png\"><img class=\" wp-image-128278\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-21-at-9.06.26-PM.png\" alt=\"From a study conducted at the Harvard-Westlake school.\" width=\"511\" height=\"161\" \/><\/a> From a <a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pubmed\/25028798\">study<\/a> conducted at the Harvard-Westlake school.[\/caption]\r\n\r\nIndependent Study preps are essential to Paly students because it is unhealthy to constantly demand so much from these already over-achieving student athletes. A student's health should be their primary concern, and they should not have to sacrifice it to play a sport and do well in school.\r\n\r\nSophomore Sydney Liu is an avid softball player. Getting sleep and rest is the main reason she wants an Independent Study prep; however, because she plays softball, she cannot get one.\r\n\r\n\"People always say that students should get a minimum of eight hours of sleep,\" Liu said. \"It's kind of hard to do that when I spend a total of four hours almost every day traveling and practicing for [my] sport. Getting that extra hour and a half to do homework during school hours would really help me prevent going to bed at 12 every night.\"\r\n\r\nConsequently, while PE is a necessary class to keep students in shape, students who already do 15 hours of a sport outside of school should not be required to partake in it and should be given the option to easily apply for an Independent Study prep. This prep would keep help maintain both the physical and mental health of students. Additionally, because all sports are physically demanding and time-consuming, there should be no restriction on which sport a student must play in order to qualify for Independent Study PE.","excerpt":"In order to qualify for Independent Study Physical Education, a student must play a sport that is not offered at Palo Alto High School. \r\n","date":"2017-01-23 17:30:39","author":"Soumya Jhaveri","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-21-at-8.42.27-PM-11.png","categories":["Opinion","Spotlight"],"tags":["diepenbrock","duran","independent study","kat merk","opinion","paly sports","pe","prep","sports"]}]