[{"id":129106,"title":"&#8216;Metamorphosis: Junior Year&#8217; to premiere in film festival","permalink":"http:\/\/palyvoice.com\/2017\/02\/14\/metamorphosis-junior-year-to-premiere-in-film-festival\/","content":"<span style=\"font-weight: 400;\">The student-produced film, \"<\/span><span style=\"font-weight: 400;\">Metamorphosis: Junior Year,\"<\/span><i><span style=\"font-weight: 400;\"> <\/span><\/i><span style=\"font-weight: 400;\">is set to premiere at 10:45 a.m. on March 4 at the Century 20 theater in Redwood City.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The film was <a href=\"http:\/\/palyvoice.com\/2015\/09\/13\/james-franco-teaches-first-film-workshop\/\" target=\"_blank\">produced<\/a> in part by Palo Alto High School students along with actor and artist James Franco as a mentor. Others who were involved include the director of photography of \"<\/span><span style=\"font-weight: 400;\">127 Hours\" and<\/span><i><span style=\"font-weight: 400;\"> <\/span><\/i><span style=\"font-weight: 400;\">the producer of \"<\/span><span style=\"font-weight: 400;\">Rise of the Planet of the Apes,\" <\/span><span style=\"font-weight: 400;\">according to co-director senior Alec Cohen-Schisler. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Based on Betsy Franco’s book, \"<\/span><span style=\"font-weight: 400;\">Metamorphosis: Junior Year\"<\/span><span style=\"font-weight: 400;\"> is about interconnected high schoolers and their struggles through their junior year. The film allows high school students to relate and sends a strong message about how they can get through these difficult four years and how they can help others, according to Cohen-Schisler.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Think about it like a '<\/span><span style=\"font-weight: 400;\">Love Actually'<\/span><span style=\"font-weight: 400;\"> meets Palo Alto,” Cohen-Schisler said. “The message is to take care of one another and always check in to make sure your friends and peers are okay during this stressful period.”<\/span>\r\n\r\n[caption id=\"attachment_121920\" align=\"alignright\" width=\"380\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/james-franco1.jpeg\"><img class=\" wp-image-121920\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/james-franco1.jpeg\" alt=\"Students began meeting every month in November 2015 to learn about film and create one of their own. Photo by Dhara Yu.\" width=\"380\" height=\"285\" \/><\/a> Franco helps students review film techniques and create a film based on their own ideas.  Students began meeting every month in November 2015. Photo: Dhara Yu.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The production of the film began in November 2015 through monthly film workshops. For the first three months, students met and worked on editing and adapting the script.  The actual filming began in February and lasted through March, according to Cohen-Schisler.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We all invested dozens of hours as well as our homes and other locations,” Cohen-Schisler said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Students began editing the footage in March and worked on animation throughout the whole summer. Since August, the group has been in post-production, according to Cohen-Schisler.  <\/span>\r\n\r\n“Some students dedicated hundreds of hours to this project and it’s truly the first of its kind,” Cohen-Schisler said.\r\n\r\n<span style=\"font-weight: 400;\">The Francos helped lead the production of the film and the monthly workshops. According to Cohen-Schisler, Betsy Franco helped add in many of her original visions to the film but the students also added in fresh ideas of their own.  <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“James has already seen a close to final version but we’re hoping he comes in March,” Cohen-Schisler said. <\/span>","excerpt":"The student led film, 'Metamorphosis Junior Year', is set to premiere on March 4. at 10:45 a.m. at the Century 20 theater in Redwood City.","date":"2017-02-14 09:04:17","author":"Morgan Keller","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2016\/09\/james-franco1.jpeg","categories":["News","Spotlight"],"tags":["film","james franco","Metamorphosis Junior Year","palo alto high school","paly","premiere","student film"]},{"id":129535,"title":"Jared Wulbrun: Boys&#8217; basketball&#8217;s newest weapon","permalink":"http:\/\/palyvoice.com\/2017\/02\/14\/jared-wulbrun-boys-basketballs-newest-weapon\/","content":"A good number of the students attending Palo Alto High School have lived in or around the city of Palo Alto for most of, if not all, their lives. For those who haven't, they know that transitioning to a new home can be tough. Having new teachers, making new friends, being in a new environment, and getting involved in new sports teams and school organizations can be a difficult transition. Boys' basketball welcomed one of these Palo Alto newcomers.\r\n\r\n[caption id=\"attachment_129554\" align=\"alignright\" width=\"399\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/jared-1.jpg\"><img class=\" wp-image-129554\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/jared-1.jpg\" alt=\"Wulbrun elevates over Gunn High School senior forward David Clarke to knock down a three-point shot during a league match against Gunn. Photo: David Hickey \" width=\"399\" height=\"265\" \/><\/a> Wulbrun elevates over Gunn High School senior forward David Clarke to knock down a three-point shot during a league match against Gunn. Photo by: David Hickey[\/caption]\r\n\r\nDuring the 2016 off-season, the Paly boys' basketball team (19-3, 10-0) acquired five-foot-10-inch junior shooting guard Jared Wulbrun, who had just moved from Birmingham, Alabama. Wulbrun scored 24 points in his first regular season game as a Viking, hitting six of seven three-point shots and six of seven shots from the free-throw line. Wulbrun's sharpshooting along with his court vision and high basketball IQ, will be essential as the Vikings finish out league play this week.\r\n\r\nThe Wulbrun family ventured to the west coast because Jared's father, Jeff Wulbrun, accepted a job offer at Stanford University as the head assistant coach for the men's basketball team.\r\n\r\nBasketball has been a passion for Jared Wulbrun for as long as he can remember. Moving to Palo Alto, he had mixed emotions about having to assimilate to his current team.\r\n\r\n\"My first impressions were varied coming from a team that won a state title last year. I wasn't sure what the season would be like, honestly,\" Wulbrun said. \"It's always a hard thing to come into a new school, a new team, and expect everything to go smoothly. I was playing for a starting job which means you're going against others on the team for one or two spots, which can cause problems. For the most part there were no issues or hard feelings between any of us, which did nothing but help the team chemistry grow.\"\r\n\r\nDuring the preseason, Wulbrun first played with the team in an out-of-state tournament and quickly realized the strength that the team possesses.\r\n\r\n\"I soon figured out that we had something special with our group,\" Wulbrun said. \"I came [to Palo Alto] this summer and was able to play with the team in their summer tournaments and in our second tournament in Reno, Nevada. I saw what we had the potential to accomplish this year.\"\r\n\r\nWulbrun credits senior captain and point-guard Miles Tention for making his transition smoother than he expected.\r\n\r\n[caption id=\"attachment_129555\" align=\"alignleft\" width=\"394\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/jared-3.jpg\"><img class=\" wp-image-129555\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/jared-3.jpg\" alt=\"Wulbrun launches a three-point shot against Oak Grove High School. Photo: David Hickey\" width=\"394\" height=\"262\" \/><\/a> Wulbrun launches a three-point shot against Oak Grove High School. Photo by: David Hickey[\/caption]\r\n\r\n\"I always give credit to Miles [Tention] for how he immediately looked for me in games and treated me like we had played together for years, even though it had only been a few weeks,\" Wulbrun said. \"That made me feel comfortable right away, making the transition easy.\"\r\n\r\nWulbrun made an immediate impact on the team, aiding the Vikings' championship in their first regular season tournament in Burlingame, which he believes set the mindset for the rest of the season.\r\n\r\n\"After [the Burlingame tournament], we all got the feeling like we could do some big things this year and so far we have, going 20-3,\" Wulbrun said. \"Everything gelled perfectly and we were playing at a very high level. My thought was that 'We could only go up from here.'\"\r\n\r\nAccording to junior forward William Schlemmer, Wulbrun has had an impact on the team as a knock-down three-point shooter as well as a great friend.\r\n\r\n\"He's pretty much become family since I met him because he moved here over the summer and got a chance to get familiar with everyone else on the team and he's a great person to have around on and off the court,\" junior forward Will Schlemmer said. \"He's a good shooter and hustler so he's willing to do the little things to get the job done.\"\r\n\r\nHaving clinched the top seed in the De Anza League, the team looks to continue their dominance against its toughest and most anticipated league opponent of the season, the Los Gatos High School Wildcats (16-6, 6-4), who currently sit in second place in the league, at 7 p.m. on Tuesday at Gunn High School. The two teams met earlier in the season, with the Vikings dismissing their arch-rivals in an intense, 66-57, victory.\r\n\r\nDuring the his first taste of the Paly-Los Gatos feud, Wulbrun poured in 17-points, 12 of which came from beyond the arch. According to Wulbrun, he felt the intensity of the matchup and is keen to bring the heat on Tuesday.\r\n\r\n\"I've heard that at Paly, most people aren't very fond of [Los] Gatos,\" Wulbrun said. \"The first game showed that. We need to come out on Tuesday with the same mindset that we did at their place a few weeks ago. It's also senior night, and I know we all want to send our four seniors out the right way: at home with a huge [win] over a rival.\"\r\n\r\nTuesday's game is Paly's annual basketball \"Senior night,\" where seniors<span style=\"font-weight: 400;\">, Tention, Jack Simison, Ethan Stern and Eelis Copeland will be honored.<\/span>\r\n\r\nFor Paly, the key to stopping the strong Los Gatos squad is limiting the play of Wildcat six-foot-six-inch junior forward Dylan Belquist. Belquist was named to the De Anza League first team last year as a sophomore and dunked over six-foot-five-inch tall Schlemmer for two of his 20 points the last time the two teams met.\r\n\r\n\"We just need to play our game and make sure to not give them second chances on the offensive glass,\" Schlemmer said. \"As for Dylan we just want to play as a team and have someone besides him beat us. These next two [league] games are extremely important. One of our goals this year is to go undefeated in league and we are close to achieving that goal.\"","excerpt":"A good amount of the students attending Palo Alto High School have lived in or around the city of Palo Alto for most of, if not all, their lives. For those who haven't, they know that transitioning to a new home can be tough. Having new teachers, making new friends, being in a new environment, and getting involved in new sports teams and school organizations can be a very difficult transition. Boys' basketball (19-3, 10-0) hosts one of these Palo Alto newcomers.","date":"2017-02-14 09:01:34","author":"Isabella Marcus","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/jared-2.jpg","categories":["Features","Sports","Uncategorized"],"tags":["basketball","gatos","jared wulbrun","los gatos","miles tention","palo alto","paly","paly basketball","schlemmer","Senior Night","wildcats","will schlemmer","wulbrun"]},{"id":128312,"title":"Coffee Chats: Economics teacher Katie Smiley","permalink":"http:\/\/palyvoice.com\/2017\/02\/13\/coffee-chats-economics-teacher-katie-smiley\/","content":"[caption id=\"attachment_128413\" align=\"alignnone\" width=\"317\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16237573_613586045492637_309238746_n.jpg\"><img class=\"wp-image-128413\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/01\/16237573_613586045492637_309238746_n.jpg\" alt=\"16237573_613586045492637_309238746_n\" width=\"317\" height=\"422\" \/><\/a> Economics teacher Katie Smiley sits in her classroom to discuss her past travels and teaching career. Photo by Morgan Keller.[\/caption]\r\n\r\n<i><span style=\"font-weight: 400;\">This is the eighth installment of Coffee Chats, where The Paly Voice gets to know staff members over a cup of coffee.<\/span><\/i>\r\n\r\nThe Paly Voice sat down with Palo Alto High School Social Science teacher in training Katie Smiley to discuss her passions outside of the classroom, as well as her current busy schedule between teaching and her own education.\r\n\r\nAlthough she has traveled and lived across the country and the world including China and Germany, Smiley grew up in Palo Alto.\r\n\r\n“I am a Palo Alto native,” Smiley said.  “I even went to Gunn High School.”\r\n\r\nThis is Smiley’s first year teaching at Paly and is currently the teacher for a senior Economics class, as well as working alongside history teacher Eric Bloom to teach sociology for the Social Justice Pathway.\r\n\r\nSmiley really enjoys how collaborative the staff is at Paly within the departments. She also says she appreciates how many resources and opportunities are offered to students.\r\n\r\n“Everyone seems to be encouraged to do more than just STEM, so there seems to be a lot of cross-studying which is good for [students],” Smiley said.\r\n\r\nBefore joining Paly’s staff this year, Smiley taught for a year in China with her fellowship program in college and then began more one-on-one teaching, according to Smiley.\r\n\r\nSmiley didn’t always know she wanted to be a teacher until she studied abroad in Germany through Wellesley College.\r\n\r\n“As I was there, I helped some other students in the classes and discovered that I really enjoy teaching,” Smiley said. “When I got back, I took an [education] course on a whim and figured out this is something I really want to do.”\r\n\r\nNow, Smiley balances working at Paly while also earning her graduate degree at Stanford University.\r\n\r\n“I come to Paly and I'm here all day until about 2:45,” Smiley said. “Then I go to Stanford and I have classes from about 3p.m. to 6p.m. and I go home.”\r\n\r\nOutside of the classroom classrooms, Smiley enjoys playing video games, hiking and walking the Dish, according to Smiley.\r\n\r\nBefore choosing to become a teacher, Smiley was doing research focusing on lifespan psychology in Germany and hopes to teach a Psychology class in the future.","excerpt":"The Paly Voice sat down with Palo Alto High School Social Science teacher in training Katie Smiley and discussed her passions outside of the classroom, as well as her current busy schedule between teaching and her own education.","date":"2017-02-13 09:53:32","author":"Aisha Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/16237573_613586045492637_309238746_n.jpg","categories":["Coffee chats","Lifestyle","Spotlight"],"tags":["coffee chats","economics","psychology","Smiley","social justice","stanford","Teaching","Wellesley College"]},{"id":129462,"title":"Students to unleash their inner artists at Teen Creativity Party","permalink":"http:\/\/palyvoice.com\/2017\/02\/09\/students-to-unleash-their-inner-artist-at-teen-creativity-party\/","content":"The Palo Alto Art Center will host its second Takeover Teen Creativity Party from 6 p.m. to 9 p.m. tomorrow at the Palo Alto Art Center.\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto High School junior event co-runner Anna Fuller is organizing the party, which she says is a way to bring teens together.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We created this [party] to bring Palo Alto teens together and integrate art into the Palo Alto community,” Fuller said. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to the Takeover Teen Creativity Party flyer, the event will include art making, music, games and a photo booth. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">Fuller encourages all teens to come and enjoy the various activities, including henna. <\/span>\r\n\r\n“There are going to be henna artists there who can decorate your arms with beautiful designs,” Fuller said.\r\n\r\n<span style=\"font-weight: 400;\">According to Fuller, it is important for teens to unleash their creative side through art.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think it’s important for teens to do art because I feel like at an early age students learn more science and math skills and it isn’t really promoted in school to do artistic things,\" Fuller said. \"Letting teens do art and creative things is good for promoting creativity and brings a community of teens together.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Fuller, the event is free and snacks will be provided. <\/span>\r\n\r\nJunior Mele Mahe is excited to be creative and have fun.\r\n\r\n<span style=\"font-weight: 400;\">“[I] can’t wait to see pretty art and find out what the party’s all about,” Mahe said. <\/span>\r\n\r\nCreated by teens for teens, RSVP on the teen arts Facebook page <a href=\"https:\/\/www.facebook.com\/events\/393813334288990\/\" target=\"_blank\">Takeover: Teen Creativity Party!<\/a>","excerpt":"The Palo Alto Art Center will host its second Takeover Teen Creativity Party from 6 p.m. to 9 p.m. this Friday at the Palo Alto Art Center.","date":"2017-02-09 22:10:45","author":"Leila Chabane","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/takeover-photo-1-11.jpg","categories":["News"],"tags":["art","palo alto art center","palo alto high school","paly","Party"]},{"id":129465,"title":"Teen Advisory Board to host Cupcake Wars","permalink":"http:\/\/palyvoice.com\/2017\/02\/09\/teen-advisory-board-to-host-cupcake-wars\/","content":"Interested in competing in a tasty challenge tomorrow night? If so, the Palo Alto Teen Advisory Board's second annual Cupcake Wars may be the place for you.\r\n\r\n[caption id=\"attachment_129466\" align=\"alignright\" width=\"270\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/TAB-cupcake-wars.jpg\"><img class=\" wp-image-129466\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/TAB-cupcake-wars.jpg\" alt=\"The official poster for the event, designed by ________.\" width=\"270\" height=\"418\" \/><\/a> The official poster for the Cupcake Wars event. Design: TAB[\/caption]\r\n\r\nCupcake Wars will be held at the Mitchell Park Teen Center from 6:30 p.m. to 8 p.m, and admission is free.\r\n\r\nThroughout three rounds of competition, participants will be tasked with decorating cupcakes for three separate themes, one theme per round, according to Palo Alto High School junior Nikki Merkle-Raymond. Judges will then evaluate the cupcakes, and winners will take home a mystery prize. All participants get to eat their cupcakes, according to Merkle-Raymond.\r\n\r\nDespite the competitive aspect of the night, member of the Teen Advisory Board, Merkle-Raymond emphasizes an alternative motive for the event.\r\n\r\n“The goal of the event is to bring people together,” Merkle-Raymond said. “We hope people from all grades and schools in the community will come and meet people.\"\r\n\r\nWhile themes per decorating round may vary, the night will highlight a Valentine's Day motif, according to Merkle-Raymond.\r\n\r\nThere are no alternative food options for those with allergies, but Merkle-Raymond still encourages those students to come out and enjoy the competition.\r\n\r\nThe Teen Advisory Board is comprised of Palo Alto teens, who plan free, engaging local events for teens. According to its Facebook page, TAB aims to further connect the Palo Alto community by connecting teens to other community members, developing programs and encouraging teen involvement through events such as Cupcake Wars.\r\n\r\nTo find out more information or contact the board, visit the event's <a href=\"https:\/\/www.facebook.com\/events\/1809353065983655\/\">Facebook page<\/a>.","excerpt":"The Palo Alto Teen Advisory Board will be hosting its second annual Cupcake Wars from 6:30 p.m. to 8 p.m. tomorrow at the Mitchell Park Teen Center.","date":"2017-02-09 21:56:25","author":"Maya Reuven","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/Screen-Shot-2017-02-09-at-11.22.01-PM.png","categories":["Entertainment","News","Uncategorized"],"tags":["baking","Community","cupcake","mitchell park","palo alto","tab"]},{"id":129358,"title":"DeVos confirmation concerns district leaders, teachers","permalink":"http:\/\/palyvoice.com\/2017\/02\/09\/devos-confirmation-concerns-district-leaders-teachers\/","content":"[caption id=\"attachment_129405\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/SUSCO-4REAL1.jpg\"><img class=\"wp-image-129405 size-full\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/SUSCO-4REAL1.jpg\" alt=\"SUSCO 4REAL\" width=\"600\" height=\"450\" \/><\/a> Palo Alto residents protesting against the confirmation of Betsy DeVos as the United States' Secretary of Education Monday afternoon at the corner of Embarcadero and El Camino. According to former elementary school teacher Erika Papakipos, who was a part of the demonstration, the group's goal was to encourage community members to speak up against DeVos and other appointments of the Trump adminstration. \"We're trying to let people know that we're not alone and that people should get out here and fight the normalization of outrageous cabinet picks and appointments,\" Papakipos said. Photo: William Sallomi.[\/caption]\r\n\r\nThe Tuesday confirmation of Betsy DeVos as Secretary of Education unsettled the Palo Alto Unified School District superintendent, Paly teachers and the wider PAUSD community, a concern that initially sparked after her remarks during the Senate hearing.\r\n\r\n<span style=\"font-weight: 400;\">DeVos, a billionaire who hails from the Michigan elite, is widely known for her advocacy for school choice, a policy that<\/span><span style=\"font-weight: 400;\"> offers financial incentive for students to attend K-12 schools outside of the public school system.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Supporters of DeVos argue that her anti-regulation philosophy will provide students and their families with more independence and therefore better options. On the other hand, her critics assert that her exclusive work with non-public schools and narrow focus on charter and religious schools disqualify her from the position.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">PAUSD Supt. Max McGee says he is unsettled by the negative outlook on public education DeVos has expressed throughout the confirmation process.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Ms. DeVos may be very intelligent and she’s certainly very wealthy, but I think she has a lot to learn about public education and leadership,” McGee said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">DeVos has remained consistent on one of her signature policies, privatizing public schools, which has drawn criticism from public school officials nationwide. According to McGee, transferring public education funds into the private sector would prove to be a dangerous move.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Assuming that privatization is going to make a difference for our most needy and, in many cases, our most deserving students, is misinformed,” McGee said.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">One of the most memorable moments of DeVos' Senate hearing came when Sen. Tim Kaine, a Democrat from Virginia, asked DeVos if she believed all schools that receive taxpayer funding – public, public charter and private – should be equally accountable, and <\/span><span style=\"font-weight: 400;\"><a href=\"https:\/\/www.c-span.org\/video\/?c4648121\/tim-kaine-betsy-devos\">DeVos eventually replied “well, no<\/a>.\" In stark contrast, <\/span><span style=\"font-weight: 400;\">McGee said that PAUSD will strive to be a national model for accountability, and hopes others will follow suit.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think in her heart of hearts, Ms. DeVos understands the importance of accountability,” McGee said. “Certainly, business owners are accountable to their shareholders if they’re going to stay in business, so I hope some of the things we do here in Palo Alto and other lighthouse districts across the country in terms of accountability could inform federal policy.” <\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Paly social science teacher Caitlin Evans, DeVos’ ideas would undermine the current system. Diverting attention away from the struggles of public schools by providing the option of non-public schools would only worsen the current state of public schools, according to Evans.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“There will be a huge swath of the population that won’t know they have the right to choose, or they don’t have a school they can physically get to, so you end up with public schools that are underfunded,” Evans said. “That’s a concern that public school teachers have, that she [DeVos] is taking the emphasis away from public schools, and giving a buffet of options, and what that ultimately means is that those [public] schools get worse, because they lose funding, teachers and students.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Evans is not worried about the future of PAUSD, but she is worried about neighboring school districts that do not have the large amounts of funding that PAUSD has.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I’m not too concerned about that issue in Palo Alto, but I know that the Oakland School District is really concerned about it,” Evans said, referencing the school choice policy. “They have a big population. They have a lot of charter schools and private schools and they are all competing for students. It puts the public schools in a really tight spot.”<\/span>\r\n\r\nFor Duveneck Elementary School teacher Barbara Susco, DeVos severely lacks the experience to control education at the federal level.\r\n\r\n\"She's not qualified to be the Education Secretary,\" Susco said. \"She has never handled a large budget and she has no experience with public schools.\"\r\n\r\nSusco, along with other community members, attended a protest Monday afternoon on the corner of El Camino Real and Embarcadero Rd. The group's goal was to inspire others to contact Republican senators and urge them to reconsider then-nominee DeVos, according to Susco.\r\n\r\nFormer Duveneck teacher Erika Papakipos joined Susco in participating in the demonstration. According to Papakipos, DeVos is dangerous and a threat to American education.\r\n\r\n\"I am concerned that having somebody that knows nothing about education and who has sort of an antipathy to public education is going to dismantle public education and further increase income inequality and opportunity inequality in this country,\" Papakipos said. \"I'm afraid that she [DeVos] would just move us in the wrong direction.\"\r\n\r\nPapakipos said she believes that the values and opinons of people in Palo Alto are threatened by DeVos's new role in the government, and that those who don't support her should make themselves heard.\r\n\r\n<span style=\"font-weight: 400;\">Paly senior Ibby Day has enjoyed her public school education and worries that school choice may negatively impact the diversity of public schools.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I think that attending public schools has opened me up to a more diverse range of people,” Day said. “I fear that DeVos' school choice plan might take away [some] types of people that attend public schools, which will cause the student population to be less diverse.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">McGee expressed an interest in working with DeVos by providing an example of a successful public education model.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“I would love to have her join us in Palo Alto and see what a high quality education is like,” McGee said. “Maybe [we could] find ways [to] help inform policies that would have a positive impact on school districts across the country.\"<\/span>","excerpt":"The Tuesday confirmation of Betsy DeVos as Secretary of Education unsettled the Palo Alto Unified School District superintendent, Paly teachers and the wider PAUSD community, a concern that initially sparked after her remarks during the Senate hearing.","date":"2017-02-09 15:06:29","author":"Jevan Yu","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/SUSCO-4REAL1.jpg","categories":["News","Spotlight"],"tags":["Betsy","cabinet","charter schools","confirmation","devos","education","evans","ibby day","max","McGee","Palo Alto Unified School District","public school","senate","united states"]},{"id":128922,"title":"Student groups vie for PAC accessibility","permalink":"http:\/\/palyvoice.com\/2017\/02\/07\/student-groups-vie-for-pac-accessibility\/","content":"[caption id=\"attachment_129354\" align=\"alignnone\" width=\"678\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_31222.jpg\"><img class=\"wp-image-129354\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_31222.jpg\" alt=\"performing arts center\" width=\"678\" height=\"509\" \/><\/a> The Performing Arts Center towers as one of Palo Alto High School's newest additions. Photo: Adrienne Kwok.[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">The newly-built Performing Arts Center is Palo Alto High School’s newest landmark. With a grand total of 25,100 square feet that boasts a motorized orchestra pit and 582 seats, the PAC is a display of grandeur on Paly’s campus. However, as of now, the PAC remains a closed-off resource that many Paly students find difficult to utilize.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Since its <a href=\"http:\/\/palyvoice.com\/2016\/10\/04\/performing-arts-center-formally-introduced\/\">grand opening<\/a> in October 2016, the PAC has held theater, choir, band and orchestra performances. However, one group that has found difficulty in reserving the PAC is Paly's very own Team 8 Robotics group. With approximately 83 students, Paly Robotics is one of the largest student organizations found on campus.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Clubs at Paly have the option to rent out spaces such as the Media Arts Center to use for events. The<\/span><span style=\"font-weight: 400;\"> robotics team recently intended to use the PAC for their kickoff day, to mark the beginning of their 6-week “build season” during which team members build a robot for competition, and also for their awards night, according to Head Coach Christopher Kuszmaul.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The PAC is an extremely valuable educational resource,” Kuszmaul said. “It is my duty to make use of educational resources that are at my disposal. The PAC very much has my attention because I feel an obligation to the taxpayers who pay for this resource and if I don’t use it, I am neglecting my duty.\"<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Robotics students, including senior project manager Jonathan Zwiebel, expressed similar concern.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The issue isn’t that they charge money, the issue is that most students have never been in the PAC, ever,” Zwiebel said. “Most students aren’t ever allowed to go into the PAC. You shouldn’t spend money on a building then not use it because you don’t want it to get dirty. It should be like the MAC or the MRC [Math Resource Center] or the library where there are just people in there because it’s an open space.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">According to Assistant Principal of Operations Jerry Berkson, the PAC’s schedule is packed with events, partly due to Gunn High School’s Spangenberg Theater which is currently undergoing renovation.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“[The PAC] is booked a lot because right now we are sharing because Gunn’s theater is under renovation,” Berkson said. “We will eventually rent it out to outside parties. We’re not going to do that for at least the first year, and probably beyond that. … We've got two plays from us per year, two plays per year for Gunn, all the choir events [and] all the instrumentals. There's so much going on that there is not a lot of space.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Robotics is not alone in its struggle to utilize Paly’s resources. During the winter season, Paly’s wrestling team requested to use the PAC.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“<\/span><span style=\"font-weight: 400;\">We wanted to use the PAC because we currently don't have a gym to use for our dual meets,” said wrestling coach Ryan Kessler. “Our home competitions are all at Gunn High School. When I told my team it was a possibility we would be wrestling in there, they were pretty fired up. I mostly feel bad for our seniors Seth Goyal and Sara Aguilar who will miss out on the new gym that's being built. It would have been nice to send them off with a home match at Paly.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">There are four different categories used to determine the charges for renting a Palo Alto Unified School District facility. District and school-sponsored clubs and groups are allowed to rent all district facilities, with the exception of pools, at no charge. Departments of local governments, community organizations with 501c3 (nonprofit) status, and government agencies that are not charging fees are all required to pay a fee for rental. Businesses and religious organizations must pay a fee higher than that of the aforementioned groups. The charge for camps is per week rather than per hour. <\/span><span style=\"font-weight: 400;\">The rental charge per hour is also dependent on the room or field one wishes to rent, with a greater charge for larger spaces.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">A calendar delineating the PAC, Haymarket Theater and Gunn’s Spangenberg Theater schedules may be found <\/span><a href=\"http:\/\/spangenbergtheatre.org\/productioncalendar.html\"><span style=\"font-weight: 400;\">here<\/span><\/a><span style=\"font-weight: 400;\">.<\/span>\r\n\r\nThe robotics team is looking forward to the PAC being available for more students to use.\r\n\r\n<span style=\"font-weight: 400;\">According to Kuszmaul, “the PAC seems to be like the guest towels that nobody can use because we might make them dirty.”<\/span>","excerpt":"The newly-built Performing Arts Center is Palo Alto High School’s newest landmark. With a grand total of 25,100 square feet that boasts a motorized orchestra pit and 582 seats, the PAC is a display of grandeur on Paly’s campus. However, as of now, the PAC remains a closed-off resource that many Paly students find difficult to utilize.","date":"2017-02-07 11:25:38","author":"Soumya Jhaveri","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_31222.jpg","categories":["News"],"tags":["admin","Berkson","chris","fun","Jerry","jonathan","kessler","kuszmaul","mac","mrc","pac","robotics","ryan","School","wrestling","zwiebel"]},{"id":129226,"title":"Recap: Boys&#8217; basketball clinches league title; suffers tough road loss","permalink":"http:\/\/palyvoice.com\/2017\/02\/06\/recap-boys-basketball-clinches-league-title-suffers-tough-road-loss\/","content":"Saturday night's game is one the Palo Alto Vikings boys' basketball team (18-3, 9-0) is hoping to forget soon. Nothing seemed to go right for the Vikings; shots didn't fall, rebounds just out of reach, and calls didn't go their way.\r\n\r\nPalo Alto suffered its first defeat in over a month, falling to the Menlo-Atherton Bears (17-4, 8-1), 58-46.\r\n\r\nThe loss was especially surprising, after another resounding league victory against the Wilcox Chargers (9-10, 4-4) on Friday night, 73-52, clinching first place in league play in the De Anza League.\r\n\r\nJunior guard Jared Wulbrun thinks that the title can be a stepping stone to success for Paly.\r\n\r\n\"As a team, we set goals for the season and this was our first one,\" Wulbrun said. \"You have to take the season one step at a time and we reached that on Friday night. We can't be satisfied, though. We all know what our other goals are that we want to achieve, so this is just the beginning. There's a lot of work left to do.\"\r\n\r\nThe game started off well for the Vikings, who led by eight points at the end of the first quarter and extended their lead to 12 points just into the second quarter.\r\n\r\nThen, everything began to fall apart for the Vikings. Menlo-Atherton senior guard Eric Norton, who scored a game-high 22 points, led the charge for the Bears and netted seven points in the second quarter. The Bears dominated the latter parts of the second period and the teams headed into halftime knotted at 28-28.\r\n\r\nThe second half started no better than the first half ended. Menlo-Atherton took an early lead and never relented, ultimately outlasting the Vikings.\r\n\r\n[caption id=\"attachment_129227\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_1344.jpg\"><img class=\"wp-image-129227\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_1344.jpg\" alt=\"Junior Bryant Jefferson lines up a free throw against Menlo-Atherton. Photo by Benner Mullin\" width=\"600\" height=\"450\" \/><\/a> Junior Bryant Jefferson lines up for a free throw against Menlo-Atherton. Photo: Benner Mullin[\/caption]\r\n\r\nJunior forward Max Dorward, who scored a team-high 16 points and grabbed five rebounds, believes Palo Alto can take away some important lessons from the tough game atmosphere.\r\n\r\n\"We knew it was gonna be a tough game going to their place but we've been doing it for the past couple years without our home gym,\" Dorward said. \"We just focused on playing our game and not worrying about that too much.\"\r\n\r\nThe loss should provide a wake-up call the Vikings, who hadn't played an opponent of Menlo-Atherton's quality since Dec. 30th, 2016, in a loss to Saint Francis.\r\n\r\nNext week, the Vikings will look to bounce back from their defeat when they trek to Cupertino to play the Cupertino Pioneers (13-8, 5-4) on Friday, Feb. 10 at 7:45 p.m.","excerpt":"Saturday night's game is one the Palo Alto Vikings boys' basketball team (18-3, 9-0) is hoping to forget soon. Nothing seemed to go right for the Vikings; shots didn't fall, rebounds just out of reach, and calls didn't go their way.","date":"2017-02-06 22:56:34","author":"Benner Mullin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/IMG_1344.jpg","categories":["Basketball","Sports","Uncategorized"],"tags":["basketball","League title","loss","MA","menlo-atherton","vikings"]},{"id":129241,"title":"Students qualify for FBLA state conference","permalink":"http:\/\/palyvoice.com\/2017\/02\/06\/students-qualify-for-fbla-state-conference\/","content":"<span style=\"font-weight: 400;\">Three members of Palo Alto High School’s Future Business Leaders of America club are preparing for an upcoming state conference after their successes at Saturday’s Bay Section Leadership Conference.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Sophomores Ria Vora, Emily Wang and Leyton Ho <\/span> <span style=\"font-weight: 400;\">qualified for the California State Leadership Conference. Vora and Wang placed fifth as a team in the Entrepreneurship event, while Ho ranked fourth in Introduction to Financial Math.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">In addition, sophomores Caity Berry and Soumya Jhaveri placed sixth in Impromptu and fifth in Public Speaking I, respectively. Wang came in 10th for Intro to Business.<\/span>\r\n\r\n[caption id=\"attachment_129298\" align=\"alignnone\" width=\"600\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/DSC_1476.jpg\"><img class=\"size-full wp-image-129298\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/DSC_1476.jpg\" alt=\"Left to right: Emily Wang, Ria Vora, Soumya Jhaveri and Leyton Ho pose with their plaques after placing at different conference events. Caity Berry, not pictured, also placed at the conference. Wang, Vora, and Ho will be competing at an upcoming state conference.\" width=\"600\" height=\"400\" \/><\/a> Left to right: Sophomores Emily Wang, Ria Vora, Soumya Jhaveri and Leyton Ho pose with their plaques after placing at different conference events. Sophomore Caity Berry, not pictured, also placed at the conference. Wang, Vora, and Ho will be competing at an upcoming state conference.[\/caption]\r\n\r\n\"It [Impromptu] is a super fun event and I really love thinking on my toes,\" Berry said. \"It's a great skill to have because throughout my life I'm going to be put in a lot of situations where I have to think fast.\"\r\n\r\n<span style=\"font-weight: 400;\">Paly's FBLA began two years ago as part of a nationwide student-run initiative to give high school students an introduction to the field of business through competitive conferences.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">At these conferences, members compete in different events, listen to speakers, network and participate in workshops. The Bay Section Leadership Conference was the first conference held this year, and included high schools in the Bay Area such as Lynbrook, Monta Vista, Cupertino and Homestead. While any member can participate in conferences at the sectional level, participants must qualify for the proceeding conferences. The state level conference will be held April 6-9 in Sacramento, and the national conference will be in Anaheim June 29 - July 2.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Junior and club co-president Adeline Zhou credits the success of club members to individual dedication, as this is the first year that members of the club have qualified for the state conference.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“During our meetings, we [club officers] handed out study guides and provided lists of resources,” Zhou said. “For the most part, our members are self-driven, and we are there for guidance and logistics.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Looking forward, Zhou is optimistic about the future of FBLA.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“We're really looking forward to seeing how we'll progress as a chapter in the upcoming months and years,” Zhou said. “Hopefully, with some hard work and dedication, we'll be able to qualify for Nationals or have more members qualify for States in the next years.”<\/span>","excerpt":"Three members of Palo Alto High School’s Future Business Leaders of America club are looking to prepare for the upcoming state conference after successes at this Saturday’s Bay Section Leadership Conference.\r\n","date":"2017-02-06 19:12:26","author":"Maya Akkaraju","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/DSC_1476-1.jpg","categories":["News","Spotlight"],"tags":["business","club","conference","FBLA","state"]},{"id":128964,"title":"Preview:  Boys&#8217; basketball faces tough test on the road","permalink":"http:\/\/palyvoice.com\/2017\/02\/04\/preview-boys-basketball-faces-tough-test-on-the-road\/","content":"<span style=\"font-weight: 400;\">The keys to success in basketball are consistency and showing up ready to play with 100 percent effort each time your team steps on the court. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">This message is one that varsity boys' basketball head coach Peter Diepenbrock has echoed to his team the past few weeks.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Our motivation comes from our goal to be the best team we can be,” Diepenbrock said. “So each night we are striving to play our best game of the season and improve in every area.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">On Saturday, the Vikings (17-2, 8-0) head down Middlefield Road to take on the Menlo-Atherton Bears (14-4, 6-1) at 6 p.m. <\/span><span style=\"font-weight: 400;\">The Bears present the toughest opponent for the Vikings since their last loss at the Saint Francis Lancers (15-4, 6-3) on Dec. 30th.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Diepenbrock believes the key to the Vikings’ success on Saturday will depend on their ability to shut down Menlo-Atherton’s star guard, senior Eric Norton. Norton was voted Most Valuable Player of the Peninsula South Basketball League his junior year, and his strong play has continued in this season.<\/span>\r\n\r\n[caption id=\"attachment_129209\" align=\"alignnone\" width=\"601\"]<a href=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/012717-Boys-Varsity-Basketball-vs-Gunn_DH-8758.jpg\"><img class=\"wp-image-129209\" src=\"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/012717-Boys-Varsity-Basketball-vs-Gunn_DH-8758.jpg\" alt=\"Palo Alto Children's Theatre Outreach, Aladdin, Palo Alto, CA: January 28, 2017\" width=\"601\" height=\"400\" \/><\/a> Junior Jared Wulbrun looks for the open man against rival Gunn. Photo by David Hickey[\/caption]\r\n\r\n<span style=\"font-weight: 400;\">Tuesday’s matchup at Los Altos proved to be a bumpy contest for the Vikings, before prevailing, 66-61, in double overtime. <\/span>\r\n\r\n<span style=\"font-weight: 400;\">“The game should have been over in regulation,” junior forward William Schlemmer said. “We didn’t make our free throws and we didn’t make our possessions count.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Diepenbrock hopes the sloppy game on Tuesday can be a lesson for the team in their upcoming games.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">“Hopefully the experience of Tuesday night will help us be a better finishing team moving forward,” Diepenbrock said. “We need to rebound for 32 minutes.”<\/span>\r\n\r\n<span style=\"font-weight: 400;\">The Vikings will have to execute and remain composed in a hostile game environment. Diepenbrock believes the game will have an electrifying playoff atmosphere and encourages all Viking faithful to make to trip and support their Vikes.<\/span>\r\n\r\n<span style=\"font-weight: 400;\">Palo Alto also has a league game on Friday night against the Wilcox Chargers (9-9, 4-3), who they trounced in their first meeting, 75-54.<\/span>","excerpt":"On Saturday, the Vikings (17-2, 8-0) head down Middlefield Road to take on the Menlo-Atherton Bears (14-4, 6-1) at 6 p.m. The Bears present the toughest opponent for the Vikings since their last loss versus at the Saint Francis Lancers (15-4, 6-3) on Dec. 30th.","date":"2017-02-04 12:38:08","author":"Benner Mullin","thumbnail":"http:\/\/palyvoice.com\/wp-content\/uploads\/2017\/02\/012717-Boys-Varsity-Basketball-vs-Gunn_DH-8758.jpg","categories":["Basketball","Sports","Uncategorized"],"tags":["bears","eric norton","los altos eagles","menlo-atherton","palo alto","Peter Diepenbrock","vikings","wilcox chargers","william schlemmer"]}]